<h1 class="firstHeading">FAQ-500 Wie sortiere ich meine Daten?</h1><p class='urlname' style='display: none'>Sort-Data</p>
<p class='faqID'>Letztes Update: 22.09.2021</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#To_sort_the_whole_worksheet_based_on_the_order_of_a_column"><span class="tocnumber">1</span> <span class="toctext">Das gesamte Arbeitsblatt basierend auf der Reihenfolge einer Spalte sortieren</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#To_sort_the_whole_worksheet_based_on_the_order_of_multiple_columns"><span class="tocnumber">2</span> <span class="toctext">Das gesamte Arbeitsblatt basierend auf der Reihenfolge von mehreren Spalten sortieren</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#To_sort_multiple_columns_based_on_the_order_of_a_column"><span class="tocnumber">3</span> <span class="toctext">Mehrere Spalten basierend auf der Reihenfolge einer Spalte sortieren</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#To_sort_multiple_columns_based_on_the_order_of_multiple_column.28s.29"><span class="tocnumber">4</span> <span class="toctext">Mehrere Spalten basierend auf der Reihenfolge mehrerer Spalten sortieren</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#To_sort_a_single_column_only"><span class="tocnumber">5</span> <span class="toctext">Nur eine einzelne Spalte sortieren</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#To_reverse_the_data_order_in_a_single_column"><span class="tocnumber">6</span> <span class="toctext">Datenreihenfolge in einer einzelnen Spalte umkehren</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#To_sort_each_column_individually"><span class="tocnumber">7</span> <span class="toctext">Jede Spalte einzeln sortieren</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#To_sort_columns_based_on_column_label_row"><span class="tocnumber">8</span> <span class="toctext">Spalten basierend auf der Spaltenbeschriftungszeile sortieren</span></a></li>
</ul>
</div>

<h3><a name="To_sort_the_whole_worksheet_based_on_the_order_of_a_column"></a><span class="mw-headline">Das gesamte Arbeitsblatt basierend auf der Reihenfolge einer Spalte sortieren</span></h3>
<p>W&auml;hlen Sie die Spalte, nach der Sie sortieren m&ouml;chten, w&auml;hlen Sie <b>Arbeitsblatt: Arbeitsblatt sortieren</b> und dann <b>Aufsteigend</b> oder <b>Absteigend</b>.</p><p>Wenn die ausgew&auml;hlte Spalte <b>Auf kategorisch gesetzt</b> ist, klicken Sie auf <b>Nach kategorialer Reihenfolge</b>, um das Arbeitsblatt mit der Methode zu sortieren, die in der <a class="external text" href="../../UserGuide/UserGuide/Displaying_Supporting_Data_in_Worksheet_Header_Rows.html#Categories">Zelle <b>Kategorien</b></a> der ausgew&auml;hlten Spalte aufgef&uuml;hrt ist.</p><p>Beziehungen des Zeilenindexes werden beim Sortieren beibehalten.</p>
<h3><a name="To_sort_the_whole_worksheet_based_on_the_order_of_multiple_columns"></a><span class="mw-headline">Das gesamte Arbeitsblatt basierend auf der Reihenfolge von mehreren Spalten sortieren</span></h3>
<p>W&auml;hlen Sie <b>Arbeitsblatt: Arbeitsblatt sortieren</b> und dann die Option <b>Benutzerdefiniert...</b>. Legen Sie fest, welche Spalte als erste und welche als zweite etc. mit Hilfe geschachtelter Sortierung sortiert werden soll.</p><p>Wenn das Arbeitsblatt eine oder mehr Spalten mit kategorialen Daten enth&auml;lt, k&ouml;nnen Sie das Arbeitsblatt in diesen Spalten sortieren.</p><p>Weitere Einzelheiten finden Sie unter <a class="external text" href="../../UserGuide/UserGuide/Sorting_Worksheet_Data.html#Nested_Sorting">geschachteltes Sortieren</a>.</p><p>Das Verh&auml;ltnis des Zeilenindexes &uuml;ber alle Spalten wird nach dem Sortieren beibehalten.</p>
<h3><a name="To_sort_multiple_columns_based_on_the_order_of_a_column"></a><span class="mw-headline">Mehrere Spalten basierend auf der Reihenfolge einer Spalte sortieren</span></h3>
<p>Wenn sich die Spalte, nach der sortiert werden soll, links von den anderen Spalten befindet, markieren Sie alle zu sortierenden Spalten, w&auml;hlen Sie <b>Arbeitsblatt: Spalte sortieren</b> und dann <b>Aufsteigend</b> oder <b>Absteigend</b>. Wenn die sich am weitesten links befindende Spalte eine kategoriale Spalte ist (d. h., sie wurde auf <b>Als kategorisch setzen</b> gesetzt), w&auml;hlen Sie <b>Nach kategorialer Reihenfolge</b>. Diese Aktionen sortieren alle ausgew&auml;hlten Spalten auf Grundlage der Sortierungsreihenfolge der Spalte links au&szlig;en.</p><p>Wenn sich die Spalte, nach der sortiert werden soll, nicht am weitesten links von den anderen Spalten befindet, dann w&auml;hlen Sie <b>Arbeitsblatt: Spalte sortieren</b> und <b>Benutzerdefiniert...</b>. Legen Sie fest, nach welcher Spalte sortiert werden soll.</p><p>Das Verh&auml;ltnis des Zeilenindexes &uuml;ber alle ausgew&auml;hlten Spalten wird nach dem Sortieren beibehalten. Das Verh&auml;ltnis des Zeilenindexes mit den nicht ausgew&auml;hlten Spalten wird aufgehoben.</p>
<h3><a name="To_sort_multiple_columns_based_on_the_order_of_multiple_column.28s.29"></a><span class="mw-headline">Mehrere Spalten basierend auf der Reihenfolge mehrerer Spalten sortieren</span></h3>
<p>Markieren Sie alle zu sortierenden Spalten, w&auml;hlen Sie <b>Arbeitsblatt: Spalte sortieren</b> und dann <b>Benutzerdefiniert...</b>. Legen Sie fest, welche Spalte als erste und welche als zweite etc. mit Hilfe geschachtelter Sortierung sortiert werden soll.</p><p>Lesen Sie <a class="external text" href="../../UserGuide/UserGuide/Sorting_Worksheet_Data.html">Arbeitsblattsdaten sortieren</a>, um weitere Einzelheiten zum geschachtelten Sortieren zu erfahren.</p><p>Das Verh&auml;ltnis des Zeilenindexes &uuml;ber alle ausgew&auml;hlten Spalten wird nach dem Sortieren beibehalten. Das Verh&auml;ltnis des Zeilenindexes mit den nicht ausgew&auml;hlten Spalten wird aufgehoben.</p>
<h3><a name="To_sort_a_single_column_only"></a><span class="mw-headline">Nur eine einzelne Spalte sortieren</span></h3>
<p>Wenn Sie nur eine Spalte sortieren und die entsprechenden Zeilenwerte in anderen Spalten nicht &auml;ndern m&ouml;chten, klicken Sie mit der rechten Maustaste auf den Spaltenheader der einzelnen Spalte und w&auml;hlen Sie <b>Spalten sortieren: Aufsteigend</b> oder <b>Absteigend</b>.</p>
<h3><a name="To_reverse_the_data_order_in_a_single_column"></a><span class="mw-headline">Datenreihenfolge in einer einzelnen Spalte umkehren</span></h3>
<p>Wenn Sie nur die Reihenfolge der Daten in einer Spalte umkehren m&ouml;chten, ohne die entsprechenden Zeilenwerte in anderen Spalten zu beeintr&auml;chtigen, klicken Sie auf den Spaltenheader, um die Spalte zu markieren und w&auml;hlen Sie im Men&uuml; <b>Spalte: Umgekehrte Reihenfolge</b>.</p>
<h3><a name="To_sort_each_column_individually"></a><span class="mw-headline">Jede Spalte einzeln sortieren</span></h3>
<p>Hierf&uuml;r gibt es kein Men&uuml;. Aber Sie k&ouml;nnen den Dialog Werte setzen verwenden und die Funktion sort() daf&uuml;r aufrufen. Um alle Spalten in aufsteigender Reihenfolge zu sortieren,</p>
<ol><li> w&auml;hlen Sie diese Spalten, die Sie sortieren m&ouml;chten.</li>
<li> Klicken Sie mit der rechten Maustaste auf Ihre Auswahl und w&auml;hlen Sie <b>Mehrere Spaltenwerte festlegen</b>.</li>
<li> Geben Sie im Dialog Mehrere Spaltenwerte festlegen im Textfeld unter &quot;wcol(j)&quot; diesen Ausdruck ein und klicken Sie auf <b>Anwenden</b> oder <b>OK</b>:<dl><dd><pre class="lt" style="font-family:monospace;">sort<span style="color: #000000;">(</span>wcol<span style="color: #000000;">(</span>j<span style="color: #000000;">)</span><span style="color: #000000;">)</span></pre></dd></dl></li>
<li> Um in <i>absteigender</i> Reihenfogle zu sortieren, klicken Sie nach Durchf&uuml;hren der obenstehenden Schritte mit der rechten Maustaste auf diese Auswahl der sortierten Spaltenwerte und w&auml;hlen Sie <b>Umgekehrte Reihenfolge</b>.</li></ol>
<p>Das Verh&auml;ltnis des Zeilenindexes &uuml;ber die Spalten wird nach dem Sortieren NICHT beibehalten.</p>
<h3><a name="To_sort_columns_based_on_column_label_row"></a><span class="mw-headline">Um Spalten auf Grundlage der Spaltenbeschriftungszeile zu sortieren:</span></h3>
<p>Klicken Sie mit der rechten Maustaste auf die ausgew&auml;hlten Arbeitsblattspalten und w&auml;hlen Sie <b>Spalten nach Beschriftungen sortieren</b> oder w&auml;hlen Sie (bei aktivem Arbeitsblatt) <b>Arbeitsblatt: Spalten nach Beschriftungen sortieren</b> im Hauptmen&uuml;.</p><p>Lesen Sie Einzelheiten unter <a class="external text" href="../../UserGuide/UserGuide/Sort_Columns_by_Labels.html">Spalten nach Beschriftungen sortieren</a>.</p>
<hr class='keywordshr'><p><span class='keywords'>Schl&uuml;sselw&ouml;rter:</span><span class='keywordsInput'> aufsteigend, absteigend, Spalten sortieren, Beschriftungszeile</span></p>
<p class="version" >Origin-Version mind. erforderlich: 9.1 SR0</p>







    