<h1 class="firstHeading">Tern&auml;res 3D-Punktdiagramm mit Ankerlinien</h1><p class='urlname' style='display: none'>3D-Ternary-Scatter</p>
<h2><a name="Summary"></a><span class="mw-headline">Zusammenfassung</span></h2>
<p>In diesem Tutorial wird ein tern&auml;res 3D-Punktdiagramm aus XYZZ-Arbeitsblattdaten erstellt. Zuerst wird die Zeichnung als ein <b>tern&auml;res 3D-Oberfl&auml;chendiagramm</b> erstellt und dann in ein <b>Punkt</b>diagramm verwandelt. Dann werden Ankerlinien f&uuml;r die Datenpunkte hinzugef&uuml;gt, um auf ihre genauen Positionen in der Achsenebene zu verweisen.</p>
<dl><dd><dl><dd><a  class="image"><img alt="3D Ternary Scatter1.png" src="../images/3D_Ternary_Scatter/3D_Ternary_Scatter1.png" width="462" height="389" /></a></dd></dl></dd></dl>
<p class="version" >Origin-Version mind. erforderlich: Origin 2015 SR0</p>
<h2><a name="What_you_will_learn"></a><span class="mw-headline">Was Sie lernen werden</span></h2>
<p>Dieses Tutorial zeigt Ihnen, wie Sie:</p>
<ul><li> ein tern&auml;res 3D-Punktdiagramm erzeugen.</li>
<li> Ankerlinien f&uuml;r Datenpunkte zeichnen.</li></ul>
<h2><a name="Steps"></a><span class="mw-headline">Schritte</span></h2>
<p>Dieses Tutorial basiert auf dem Tutorialdaten-Projekt: <i>&lt;Origin-Verzeichnis&gt;\Samples\Tutorial Data.opj</i>.</p>
<ol><li>&Ouml;ffnen Sie das Tutorialdaten-Projekt und navigieren Sie zu dem Ordner <i>3D Ternary Surface</i>.</li>
<li> Aktivieren Sie das Arbeitsblatt <b>3D Ternary Scatter</b> in der Mappe <b>Book1F</b> und markieren Sie die Spalten col(C) und col(D). W&auml;hlen Sie <b>Zeichnen: 3D-Oberfl&auml;che: Tern&auml;re 3D-Oberfl&auml;che mit Farbabbildung</b>, um eine Oberfl&auml;che mit Farbabbildung zu erzeugen.</li>
<li> Klicken Sie zum &Ouml;ffnen des Dialogs <b>Details Zeichnung</b> doppelt auf die Zeichnung. Markieren Sie <b>Layer1</b> im linken Bedienfeld und wechseln Sie zur Registerkarte <b>Ebenen</b> im rechten Bedienfeld. W&auml;hlen Sie f&uuml;r <b>Prisma</b> die Option <b>Gesamtes Prisma</b> und aktivieren Sie das Kontrollk&auml;stchen <b>Ebenengrenze</b>.<dl><dd><a  class="image"><img alt="3D Surface plane-12.png" src="../images/3D_Ternary_Scatter/3D_Surface_plane-12.png" width="512" height="290" /></a></dd></dl></li>
<li> Gehen Sie zur&uuml;ck zum linken Bedienfeld und klicken Sie auf <b>Layer1</b> (achten Sie darauf, dass das Kontrollk&auml;stchen neben dem Symbol von Layer1 nicht deaktiviert wird) und markieren Sie die Zeichnung unter dem Symbol von Layer1. &Auml;ndern Sie unten im Dialog Details Zeichnung den <b>Diagrammtyp</b> in <b>3D-Streu-/Ankerlinien/Vektordiagramm</b>.<dl><dd><a  class="image"><img alt="3D Ternary Scatter.png" src="../images/3D_Ternary_Scatter/3D_Ternary_Scatter.png" width="330" height="124" /></a></dd></dl></li>
<li> Kehren Sie zur&uuml;ck zum linken Bedienfeld und klicken Sie auf <b>Original</b> (unter der Zeichnung). Gehen Sie im rechten Bedienfeld auf die Registerkarte <b>Symbole</b> und duplizieren Sie die folgenden Einstellungen:<dl><dd><a  class="image"><img alt="3D Ternery symbol-vNext.png" src="../images/3D_Ternary_Scatter/3D_Ternery_symbol.png" width="330" height="258" /></a></dd></dl></li>
<li>Jetzt werden die Ankerlinien gezeichnet. W&auml;hlen Sie Ihr Punktdiagramm (Original) im linken Bedienfeld aus. Wechseln Sie im rechten Bedienfeld zur Registerkarte <b>Ankerlinien</b>. Aktivieren Sie das Kontrollk&auml;stchen <b>Parallel zur Z-Achse</b>. &Auml;ndern Sie <b>Stil</b> in <b>Punkte Kurz</b>, <b>Breite</b> in <b>1</b>, <b>Farbe</b> in <b>Grau</b> und <b>F&uuml;hren zu</b> in <b>Z=Achsenanfang Ebene</b>. Best&auml;tigen Sie mit <b>OK</b>, um den Dialog Details Zeichnung zu schlie&szlig;en.<dl><dd><a  class="image"><img alt="3D Ternary droplines-vNext.png" src="../images/3D_Ternary_Scatter/3D_Ternary_droplines.png" width="396" height="200" /></a></dd></dl></li>
<li> Klicken Sie doppelt auf die Achse, um den <b>Dialog Achsen</b> zu &ouml;ffnen. Dr&uuml;cken Sie im linken Bedienfeld auf die <b>Strg</b>-Taste, um die Achsen <b>X</b>, <b>Y</b>, <b>Z</b> und <b>Zh</b> auszuw&auml;hlen. Gehen Sie dann zur Registerkarte <b>Gitternetze</b>, um die Einstellungen f&uuml;r die <b>Hauptgitternetzlinien</b>, wie im folgenden Bild zu sehen, benutzerdefiniert zu definieren. Klicken Sie auf <b>OK</b>.<dl><dd><a  class="image"><img alt="3D Surface Grids-vNext.png" src="../images/3D_Ternary_Scatter/3D_Surface_Grids.png" width="481" height="373" /></a></dd></dl></li>
<li> Um die Skalierung und die Haupthilfsstriche der X-/Y-/Z-Achse benutzerdefiniert anzupassen, dr&uuml;cken Sie die <b>Strg</b>-Taste und w&auml;hlen Sie die <b>X</b>-, <b>Y</b>- und <b>Z</b>-Achse im linken Bedienfeld. Wechseln Sie dann zur Registerkarte <b>Skalierung</b>, um <b>Gro&szlig;e Hilfsstriche</b> &gt; <b>Werte</b> auf <b>0,2</b> festzulegen, wie im Bild unten zu sehen:<dl><dd><a  class="image"><img alt="3D Surface Tick-1-vNext.png" src="../images/3D_Ternary_Scatter/3D_Surface_Tick-1.png" width="475" height="375" /></a></dd></dl></li>
<li> Um die Skalierung und die gro&szlig;en Hilfsstriche der Zh-Achse benutzerdefiniert festzulegen, w&auml;hlen Sie die <b>Zh</b>-Achse und wechseln dann zur Registerkarte Skalierung. Passen Sie den Skalierungsbereich und <b>Gro&szlig;e Hilfsstriche</b> &gt; <b>Wert</b> wie im Folgenden gezeigt an:<dl><dd><a  class="image"><img alt="3D Surface Tick-2-vNext.png" src="../images/3D_Ternary_Scatter/3D_Surface_Tick-2.png" width="473" height="377" /></a></dd></dl></li>
<li> Klicken Sie einmal in den Layerrahmen (aber nicht auf die Zeichnung), um die Funktionen Verschieben/In der Gr&ouml;&szlig;e ver&auml;ndern/Drehen zu aktivieren. Drehen Sie die Zeichnung, bis Sie sie in eine bessere Ansicht gezogen haben. Alternativ k&ouml;nnen Sie die Hilfsmittel auf der Symbolleiste <b>3D-Drehung</b> verwenden.</li></ol>
<p><br /><br /> <a  class="image"><img alt="3D Ternary rotter.png" src="../images/3D_Ternary_Scatter/3D_Ternary_rotter.png" width="448" height="392" /></a><br /><br /></p>






    