<h1 class="firstHeading">Textbeschriftungen erstellen</h1><p class='urlname' style='display: none'>Create-TextLabel</p>
<p><br /> Die einfachste Methode zum Hinzuf&uuml;gen von Textbeschriftungen in Ihren Origin-Fenstern ist die Verwendung von Origins <b>WYSIWYG</b>-Hilfsmittel zur Texterstellung und -bearbeitung:</p>
<ul><li>Verwenden Sie das Hilfsmittel <b>Text</b> der Symbolleiste <b>Hilfsmittel</b>, um Ihre Beschriftungen zu erstellen.</li></ul>
<ul><li>Verwenden Sie die Symbolleisten <a href="../../UserGuide/UserGuide/The_Format_Toolbar.html" title="UserGuide:The Format Toolbar"><b>Format</b></a> und <a href="../../UserGuide/UserGuide/The_Style_Toolbar.html" title="UserGuide:The Style Toolbar"><b>Stil</b></a>, die <a class="external text" href="../../GettingStarted/OriginLab/The_Origin_Interface.html#Mini_Toolbars"><b>Minisymbolleisten</b></a> und den Dialog <a href="../../UserGuide/UserGuide/The_(Text_Object_Properties)_Text_tab.html" title="UserGuide:The (Text Object Properties) Text tab"><b>Eigenschaften</b></a> des Textobjekts, um die Format- und Stiloptionen festzulegen, die Objekte mit LabTalk-Variablen und Skripts zu verkn&uuml;pfen, Anh&auml;ngungsmethode und Position des Objekts zu steuern etc.</li></ul>
<ul><li>Verwenden Sie die <b>Abbildung Symbole</b> -- durch Rechtsklick im direkten Bearbeitungsmodus verf&uuml;gbar -- um Ihren Beschriftungen Sonderzeichen hinzuzuf&uuml;gen.</li></ul>
<ul><li>Verwenden Sie <b>Infovariable einf&uuml;gen</b> -- verf&uuml;gbar durch Rechtsklick im internen Bearbeitungsmodus &ndash; , um Metadaten und Spaltenbeschriftungen zu Ihrer Beschriftung hinzuzuf&uuml;gen.</li></ul>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Creating_and_customizing_a_label"><span class="tocnumber">1</span> <span class="toctext">Eine Beschriftung erstellen und benutzerdefiniert anpassen</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Shortcut_keyboard_combinations_for_general_editing_of_text_labels"><span class="tocnumber">2</span> <span class="toctext">Tastenkombinationen f&uuml;r die allgemeine Bearbeitung von Textbeschriftungen</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Resizing_a_text_label"><span class="tocnumber">3</span> <span class="toctext">Die Gr&ouml;&szlig;e einer Textbeschriftung &auml;ndern</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Rotating_a_text_label"><span class="tocnumber">4</span> <span class="toctext">Eine Textbeschriftung drehen</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#In-place_.28WYSIWYG.29_editing_of_text_labels"><span class="tocnumber">5</span> <span class="toctext">Direkte Bearbeitung (WYSIWYG) von Textbeschriftungen</span></a><ul>
<li class="toclevel-2 tocsection-6"><a href="#Length_of_text_string_limitation"><span class="tocnumber">5.1</span> <span class="toctext">L&auml;nge der Einschr&auml;nkung von Textzeichenketten</span></a></li>
<li class="toclevel-2 tocsection-7"><a href="#Turning_off_in-place_.28WYSIWYG.29_editing_of_text_labels"><span class="tocnumber">5.2</span> <span class="toctext">Modus der direkten Bearbeitung (WYSIWYG) von Textbeschriftungen deaktivieren</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-8"><a href="#Insert_Links_and_Variables"><span class="tocnumber">6</span> <span class="toctext">Links und Variablen einf&uuml;gen</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#Object_Properties.2C_advanced_control_of_text_labels"><span class="tocnumber">7</span> <span class="toctext">Objekteigenschaften, erweiterte Steuerung der Textbeschriftungen</span></a></li>
<li class="toclevel-1 tocsection-10"><a href="#Using_LabTalk_for_custom_formatting_of_text_labels"><span class="tocnumber">8</span> <span class="toctext">LabTalk f&uuml;r die benutzerdefinierte Formatierung der Textbeschriftungen verwenden</span></a></li>
<li class="toclevel-1 tocsection-11"><a href="#Using_the_Symbol_Map_to_add_special_characters_to_your_labels"><span class="tocnumber">9</span> <span class="toctext">Symbol&uuml;bersicht zum Hinzuf&uuml;gen von Sonderzeichen zu Ihren Beschriftungen verwenden</span></a></li>
<li class="toclevel-1 tocsection-12"><a href="#Creating_a_shortcut_key_combination_to_insert_special_characters"><span class="tocnumber">10</span> <span class="toctext">Eine Tastenkombination zum Hinzuf&uuml;gen von Sonderzeichen erstellen</span></a></li>
</ul>
</div>

<h2><a name="Creating_and_customizing_a_label"></a><span class="mw-headline">Eine Beschriftung erstellen und benutzerdefiniert anpassen</span></h2>
<ol><li>Klicken Sie auf die Schaltfl&auml;che <b>Text-Hilfsmittel</b> <a  class="image"><img alt="Button Text Tool.png" src="../images/Creating_Text_Labels/Button_Text_Tool.png" width="23"  /></a>.</li>
<li>Klicken Sie auf die Stelle in Ihrem Origin-Fenster (Grafik, Arbeitsblatt etc.), an der Sie den Text einf&uuml;gen m&ouml;chten.</li></ol>
<p><i>oder</i></p>
<ol><li>Klicken Sie mit der rechten Maustaste auf die gew&uuml;nschte Stelle in Ihrem Origin-Fenster.</li>
<li>W&auml;hlen Sie im Kontextmen&uuml; <b>Text hinzuf&uuml;gen</b>.</li></ol>
<p><br /> <i><b>Geben Sie Ihren Text ein und passen Sie ihn mit Hilfe einer Kombination des Folgenden benutzerdefiniert an:</b></i></p>
<dl><dd><ul><li> W&auml;hlen Sie Ihre Optionen mit Hilfe der Schaltfl&auml;che auf den Symbolleisten <b>Format</b> und <b>Stil</b>. </li></ul>
<dl><dd><a  class="image"><img alt="Creating a new text label 01.png" src="../images/Creating_Text_Labels/Creating_a_new_text_label_01.png" width="486"  /></a></dd></dl>
<ul><li> Wenn ein Textobjekt ausgew&auml;hlt ist, k&ouml;nnen Sie die Schaltfl&auml;chen auf der Minisymbolleiste des Objekts (z. B. Ausrichtung des Texts) verwenden.</li></ul>
<dl><dd><a  class="image"><img alt="MT text object alignment.png" src="../images/Creating_Text_Labels/MT_text_object_alignment.png" width="276"  /></a></dd></dl>
<ul><li> Um den Textumbruch ein- und auszuschalten, klicken Sie auf <b>Textumbruch</b> auf der Minisymbolleiste des Objekts; oder aktivieren Sie das Kontrollk&auml;stchen <b>Textumbruch, H&ouml;he anpassen</b> auf der Registerkarte <b>Rahmen</b> im Dialog Eigenschaften (<i>siehe n&auml;chsten Punkt</i>).</li></ul>
<dl><dd><a  class="image"><img alt="MT text object wrap text.png" src="../images/Creating_Text_Labels/MT_text_object_wrap_text.png" width="279"  /></a></dd></dl>
<ul><li> Um auf alle Textobjekteigenschaften zugreifen zu k&ouml;nnen, klicken Sie mit der rechten Maustaste auf das Objekt und w&auml;hlen Sie <a href="../../UserGuide/UserGuide/The_(Text_Object_Properties)_Text_tab.html" title="UserGuide:The (Text Object Properties) Text tab"><b>Eigenschaften</b></a>.</li></ul></dd></dl>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Wenn Sie Textbeschriftungen erstellen, wird, wenn Sie in den Layerrahmen geklickt udn Ihre Textbeschriftung erstellt haben, diese Beschriftung automatisch mit dem Rahmen verbunden (siehe auch <a href="../../UserGuide/UserGuide/Object_Attachment_and_Scaling.html" title="UserGuide:Object Attachment and Scaling">Objektverbindung und Skalierung</a>). Wenn Textbeschriftungen mit dem Layerrahmen verbunden sind, werden diese beim Verschieben und Vergr&ouml;&szlig;ern/Verkleinern des Layers ebenfalls entsprechend verschoben oder vergr&ouml;&szlig;ert/verkleinert. Wenn Sie au&szlig;erhalb des Layers klicken und eine Textbeschriftung erstellen, wird die Beschriftung automatisch mit der Seite verbunden, in der die Beschriftung nicht mit dem Layer verschoben, vergr&ouml;&szlig;ert oder verkleinert werden kann.</p>
</td></tr></table>
<h2><a name="Shortcut_keyboard_combinations_for_general_editing_of_text_labels"></a><span class="mw-headline">Tastenkombinationen f&uuml;r die allgemeine Bearbeitung von Textbeschriftungen</span></h2>
<p>Wenn Sie es vorziehen, Tastenkombinationen statt der Schaltfl&auml;chen in den Symbolleisten zu verwenden, k&ouml;nnen Sie folgende Tastenkombinationen verwenden:</p>
<table class="xfvar">
<tr>
<th>Bedienelement</th>
<th>Tastenkombination</th></tr>
<tr>
<td>Fett</td>
<td>STRG + B, STRG + UMSCHALT + B</td></tr>
<tr>
<td>Kursiv</td>
<td>STRG + I, STRG + UMSCHALT + I</td></tr>
<tr>
<td>Unterstrichen</td>
<td>STRG + U, STRG + UMSCHALT + U</td></tr>
<tr>
<td>Griechisch</td>
<td>STRG + G, STRG + UMSCHALT + G</td></tr>
<tr>
<td>Hochgestellt</td>
<td>STRG + UMSCHALT + =</td></tr>
<tr>
<td>Tiefgestellt</td>
<td>STRG + =</td></tr>
<tr>
<td>Hoch-/Tiefgestellt</td>
<td>STRG + -</td></tr>
<tr>
<td>Schrift vergr&ouml;&szlig;ern</td>
<td>STRG + UMSCHALT + &gt;</td></tr>
<tr>
<td>Schrift verkleinern</td>
<td>STRG + UMSCHALT + &gt;</td></tr>
<tr>
<td>Alles markieren</td>
<td>STRG + A, STRG + 5 (Zahlenblock)</td></tr></table>
<h2><a name="Resizing_a_text_label"></a><span class="mw-headline">Die Gr&ouml;&szlig;e einer Textbeschriftung &auml;ndern</span></h2>
<p>Um die Gr&ouml;&szlig;e einer Textbeschriftung anzupassen</p>
<ol><li>Klicken Sie einmal auf die Beschriftung.</li>
<li>W&auml;hlen Sie die gew&uuml;nschte <b>Schriftgr&ouml;&szlig;e</b> aus dem Kombinationsfeld in der Symbolleiste <b>Format</b> aus.  </li></ol>
<p><i>oder</i></p><p>2. Klicken Sie auf die Schaltfl&auml;chen <b>Schrift vergr&ouml;&szlig;ern</b> oder <b>Schrift verkleinern</b> <a  class="image"><img alt="Button Increase Font.png" src="../images/Creating_Text_Labels/Button_Increase_Font.png" width="23"  /></a><a  class="image"><img alt="Button Decrease Font.png" src="../images/Creating_Text_Labels/Button_Decrease_Font.png" width="23"  /></a>  auf der Symbolleiste <b>Format</b>.</p>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> F&uuml;r schnelle Anpassungen der Gr&ouml;&szlig;e des Textobjekts, w&auml;hlen Sie das Objekt und ziehen Sie an einem der Angriffspunkte.</p>
</td></tr></table>
<h2><a name="Rotating_a_text_label"></a><span class="mw-headline">Drehen von Textbeschriftungen</span></h2>
<p>Um eine Textbeschriftung zu drehen:</p>
<ol><li>Klicken Sie zweimal (lassen Sie eine ausreichende Pause zwischen den beiden Klicks, um einen Doppelklick zu vermeiden). In der Mitte der Beschriftung erscheint ein Rotationssymbol <a  class="image"><img alt="Creating Text Labels 02.png" src="../images/Creating_Text_Labels/Creating_Text_Labels_02.png" width="32"  /></a>, und an den Ecken der Beschriftung werden runde Einstellelemente angezeigt.  </li>
<li>Greifen Sie sich eines der Elemente und drehen Sie die Beschriftung in die gew&uuml;nschte Richtung.  </li></ol>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b> Sie k&ouml;nnen einen exakten Rotationswinkel auch im Dialog <b>Objekteigenschaften</b> (<b>Format: Objekteigenschaften</b>) festlegen.</p>
</td></tr></table>
<p><br /> <i><b>Um den Zugang zur Beschriftungsrotation &uuml;ber den zweiten Mausklick zu sperren:</b></i></p>
<ol><li>W&auml;hlen Sie <b>Einstellungen: Optionen</b>, um den Dialog <b>Optionen</b> zu &ouml;ffnen.  </li>
<li>W&auml;hlen Sie die Registerkarte <b>Zeichens&auml;tze</b> und aktivieren Sie das Kontrollk&auml;stchen <b>Einfacher Auswahlmodus</b>.</li></ol>
<h2><a name="In-place_.28WYSIWYG.29_editing_of_text_labels"></a><span class="mw-headline">Direkte Bearbeitung (WYSIWYG) von Textbeschriftungen</span></h2>
<h3><a name="Length_of_text_string_limitation"></a><span class="mw-headline">L&auml;nge der Einschr&auml;nkung von Textzeichenketten</span></h3>
<p>Wenn Sie doppelt auf ein Textobjekt klicken, wird standardm&auml;&szlig;ig der direkte Bearbeitungsmodus ge&ouml;ffnet. Aber es gibt eine Einschr&auml;nkung f&uuml;r die L&auml;nge der Textzeichenketten f&uuml;r diese Situation.</p><p>F&uuml;r den Umbruch von Text wird der direkte Bearbeitungsmodus deaktiviert, falls die L&auml;nge der Textzeichenkette mehr als <i><b>80</b></i> betr&auml;gt (dieser Wert wird von der Systemvariable <b>@TLIP</b> gesteuert. Wenn Sie doppelt auf ein Textobjekt klicken, wird der Dialog <b>Eigenschaften Textobjekt</b> ge&ouml;ffnet.</p><p><br /> Um den Umbruch von Text nicht zu aktivieren, wird der direkte Bearbeitungsmodus deaktiviert, falls die L&auml;nge der Textzeichenkette mehr als <i><b>60</b></i> betr&auml;gt (dieser Wert wird von der Systemvariable <b>@TLIPN</b> gesteuert. Wenn Sie doppelt auf ein Textobjekt klicken, wird der Dialog <b>Eigenschaften Textobjekt</b> ge&ouml;ffnet.</p><p><br /></p>
<h3><a name="Turning_off_in-place_.28WYSIWYG.29_editing_of_text_labels"></a><span class="mw-headline">Deaktivieren des Modus&apos; direkte Bearbeitung (WYSIWYG) von Textbeschriftungen</span></h3>
<p>Diese Informationen sind in erster Linie f&uuml;r Langzeitnutzer von Origin gedacht, die die alten Methoden (vor Version 7) der Textbearbeitung bevorzugen</p><p>Um den Modus direktes Bearbeiten auszuschalten:</p>
<ol><li>W&auml;hlen Sie <b>Einstellungen: Optionen</b>, um den Dialog <b>Optionen</b> zu &ouml;ffnen.  </li>
<li>W&auml;hlen Sie die Registerkarte <b>Zeichensatz</b> und w&auml;hlen Sie das Kontrollk&auml;stchen <b>Direktes Bearbeiten deaktivieren</b>. </li>
<li>Klicken Sie auf <b>OK</b>. Wenn Sie gefragt werden, ob Sie dies als Startup-Option festlegen wollen, w&auml;hlen Sie <b>Ja</b>, um diese Einstellung bei jedem Start von Origin zu aktivieren (w&auml;hlen Sie <b>Nein</b>, um die Einstellung nur auf die aktuelle Sitzung anzuwenden). </li></ol>
<p>Wenn der Modus direktes Bearbeiten ausgeschaltet ist, &ouml;ffnet ein Doppelklick auf die Beschriftung des Dialogs <b>Objekteigenschaften.</b> Dieser Dialog besitzt &auml;ltere WYSIWYG-Methoden. Viele betrachten ihre Funktionalit&auml;t als weniger intuitiv als neuere WYSIWYG-Methoden.</p>
<h2><a name="Insert_Links_and_Variables"></a><span class="mw-headline">Links und Variablen einf&uuml;gen</span></h2>
<p>Die einfachste Textbeschriftung ist ein simples, statisches Objekt. Origin-Beschriftungen k&ouml;nnen aber dynamisch mit Variablenwerten &uuml;ber den Dialog <b>Eigenschaften</b> des Textobjekt verkn&uuml;pft sein. Es gibt zwei M&ouml;glichkeiten, Beschriftungen mit Variablen zu verkn&uuml;pfen:</p>
<ul><li><a href="../../UserGuide/UserGuide/Linking_Text_Labels_to_Data_and_Variables.html" title="UserGuide:Linking Text Labels to Data and Variables">Variablen einf&uuml;gen</a>, wobei ein gewisses Ma&szlig; an Interaktion mit LabTalk-Skripten stattfindet,</li>
<li><a href="../../UserGuide/UserGuide/Inserting_Variables_Extracted_from_Imported_ASCII_Files_into_Text_Labels.html" title="UserGuide:Inserting Variables Extracted from Imported ASCII Files into Text Labels">Infovariable einf&uuml;gen , um mit Metadaten zu verkn&uuml;pfen</a>.</li></ul>
<h2><a name="Object_Properties.2C_advanced_control_of_text_labels"></a><span class="mw-headline">Objekteigenschaften, erweiterte Steuerung der Textbeschriftungen</span></h2>
<p>Zus&auml;tzlich zum Verkn&uuml;pfen von Beschriftungen und Variablen, stehen auch weitere Bedienelemente im Dialog Eigenschaften des Textobjekts zur Verf&uuml;gung, einschlie&szlig;lich Bedienelementen, die speziell f&uuml;r die Objekte <a href="../../UserGuide/Category/Graph_Legends_and_Color_Scales.html" title="Category:Graph Legends and Color Scales"><b>Legende</b></a> und <a href="../../UserGuide/UserGuide/Creating_Annotation.html" title="UserGuide:Creating Annotation"><b>Anmerkung</b></a> gedacht sind:</p>
<ul><li> Auf der Registerkarte <a href="../../UserGuide/UserGuide/The_(Text_Object_Properties)_Text_tab.html" title="UserGuide:The (Text Object Properties) Text tab"><b>Text</b></a> k&ouml;nnen Sie Textobjekte bearbeiten und ihren Stil ver&auml;ndern.</li>
<li> Auf der Registerkarte <a href="../../UserGuide/UserGuide/The_(Text_Object_Properties)_Symbol_tab.html" title="UserGuide:The (Text Object Properties) Symbol tab"><b>Symbol</b></a> (nur Legendenobjekte) k&ouml;nnen Sie die Legendensymbole benutzerdefiniert anpassen.</li>
<li> Auf der Registerkarte <a href="../../UserGuide/UserGuide/The_(Text_Object_Properties)_Frame_tab.html" title="UserGuide:The (Text Object Properties) Frame tab"><b>Rahmen</b></a> k&ouml;nnen Sie den Objektrahmen, die F&uuml;llung, das Auff&uuml;llen etc. festlegen.</li>
<li> Auf der Registerkarte <a href="../../UserGuide/UserGuide/The_(Text_Object_Properties)_Position_tab.html" title="UserGuide:The (Text Object Properties) Position tab"><b>Position</b></a> beeinflussen Sie die Objektposition, die Verschiebung etc.</li>
<li> Auf der Registerkarte <a href="../../UserGuide/UserGuide/The_(Annotation_Object)_Leader_Line_tab.html" title="UserGuide:The (Annotation Object) Leader Line tab"><b>Verbindungslinie</b></a> (nur Anmerkungsobjekte) k&ouml;nnen Sie die Verbindungslinien der Anmerkungen steuern.</li>
<li> Die Registerkarte <a href="../../UserGuide/UserGuide/The_(Object_Properties)_Programming_tab.html" title="UserGuide:The (Object Properties) Programming tab"><b>Programmierung</b></a> enth&auml;lt Bedienelemente zum Verkn&uuml;pfen von Objekt mit Variablen und Skripts.</li></ul>
<h2><a name="Using_LabTalk_for_custom_formatting_of_text_labels"></a><span class="mw-headline">LabTalk f&uuml;r die benutzerdefinierte Formatierung der Textbeschriftungen verwenden</span></h2>
<p>Beim Erstellen von Vorlagen etc. k&ouml;nnen Sie LabTalk-Skript einbinden, um eine Textbeschriftung mit Hilfe von <a class="external text" href="../../LabTalk/LabTalk/Numeric_to_String_Conversion.html#Origin_Formats"><b>Origin-Formaten</b></a> zu formatieren.</p><p>Sie gehen folgenderma&szlig;en vor:</p>
<ol><li> Erstellen Sie die Textbeschriftung und aktivieren Sie die LabTalk-Substitution, wie unten dargestellt.</li>
<li> Klicken Sie mit der rechten Maustaste auf die Beschriftung und w&auml;hlen Sie <b>Eigenschaften</b>, klicken Sie auf die Registerkarte <b>Programmierung</b> und setzen Sie <b>Verkn&uuml;pfung zu (%, $), Substitutionsebene</b> auf <i>1</i>.</li></ol>
<p><br /> <i><b>Beispiele</b></i>:</p><p>Beginnen Sie, indem Sie das Hilfsmittel <b>Text</b> <a  class="image"><img alt="Button Text Tool.png" src="../images/Creating_Text_Labels/Button_Text_Tool.png" width="23"  /></a> ausw&auml;hlen und auf das Diagramm oder Arbeitsblatt klicken:</p>
<dl><dd><ul><li> Angefangen bei der Zahl <i>37,34255</i> k&ouml;nnten Sie dies als <i>$(37.34255, D MS)</i> formatieren, woraus sich <i>37° 20&apos; 33 ergibt. </i></li>
<li> Angefangen bei der  (Julianischen Tages-) Zahl <i>2458421</i> k&ouml;nnten Sie dies als <i>$(2458421, D1)</i> formatieren, woraus sich <i>Dienstag, 30. Oktober 2018</i> ergibt.</li>
<li> Angefangen bei der Zahl <i>203465987</i> k&ouml;nnten Sie dies als <i>$(203465987, S*3)</i> formatieren, woraus sich <i>2.03E + 08</i> ergibt.</li></ul></dd></dl>
<p><br /> Weitere Informationen zum benutzerdefinierten Formatieren von Textbeschriftungen finden Sie unter <a class="external text" href="../../LabTalk/LabTalk/Numeric_to_String_Conversion.html#Origin_Formats">Origin-Formate</a>.</p><p>Weitere Informationen zur benutzerdefinierten Formatierung von numerischen Daten siehe <a class="external text" href="../../LabTalk/LabTalk/Origin_Formats.html">Benutzerdefinierte numerische Formate</a>.</p>
<h2><a name="Using_the_Symbol_Map_to_add_special_characters_to_your_labels"></a><span class="mw-headline">Symbol&uuml;bersicht zum Hinzuf&uuml;gen von Sonderzeichen zu Ihren Beschriftungen verwenden</span></h2>
<p>Einf&uuml;gen von Sonderzeichen in Ihre Textbeschriftung</p>
<ol><li>W&auml;hrend Sie sich im Modus der direkten Bearbeitung befinden, klicken Sie mit der rechten Maustaste und w&auml;hlen Sie <b>Abbildung Symbole</b> im Kontextmen&uuml;. Der Dialog <b>Abbildung Symbole</b> wird ge&ouml;ffnet<dl><dd><a  class="image"><img alt="Creating Text Labels 03.png" src="../images/Creating_Text_Labels/Creating_Text_Labels_03.png" width="279"  /></a>.</dd></dl></li>
<li>W&auml;hlen Sie den <b>Zeichensatz</b> aus, der das gew&uuml;nschte Sonderzeichen in der Auswahlliste enth&auml;lt.</li>
<li>Markieren Sie das Sonderzeichen in der Liste und klicken Sie entweder doppelt darauf oder klicken Sie auf <b>Einf&uuml;gen</b>, um das Sonderzeichen in Ihre Textbeschriftung einzuf&uuml;gen.</li></ol>
<table class="note">

<tr>
<td>
<p><b>Hinweis:</b></p><p>Der Dialog <b>Abbildung Symbole</b>, der zum Einf&uuml;gen von Zeichen in Textbeschriftungen verwendet wird, unterst&uuml;tzt <b><i>Unicode</i></b>-Zeichen. Sie k&ouml;nnen eine Vielzahl mathematischer und Sonderzeichen sowie Sprachzeichen (z.B. Kyrillisch, Hebr&auml;isch, Arabisch, Koreanisch, Chinesisch, Japanisch etc.) mit Hilfe Unicode-f&auml;higer Schriftarten wie <b>Arial Unicode MS</b> eingeben.</p><p>Um ein Unicode-Zeichen einzuf&uuml;gen, aktivieren Sie das Kontrollk&auml;stchen <b>Unicode</b> neben <b>Zeichensatz</b> und w&auml;hlen Sie dann das Sonderzeichen in der Symbolgalerie aus. Wenn Sie den entsprechenden Punkt des Unicodes kennen, k&ouml;nnen Sie die Ziffern, die auf &quot;U+&quot; folgen, in das Textfeld <b>Zu Unicode gehen</b> eingeben und direkt zu diesem Zeichen gelangen. Weitere Informationen finden Sie unter <a href="../../UserGuide/UserGuide/Accessing_the_Extended_Character_Set.html" title="UserGuide:Accessing the Extended Character Set">Sonderzeichen in eine Textbeschriftung einf&uuml;gen</a>.</p>
</td></tr></table>
<h2><a name="Creating_a_shortcut_key_combination_to_insert_special_characters"></a><span class="mw-headline">Eine Tastenkombination zum Hinzuf&uuml;gen von Sonderzeichen erstellen</span></h2>
<p>Wenn Sie bestimmte Zeichen h&auml;ufig in Ihren Textbeschriftungen verwenden, k&ouml;nnen Sie <b>Tastenkombinationen</b> f&uuml;r diese Zeichen erstellen und so die Symbol&uuml;bersicht umgehen.</p><p>Der einfachste Weg daf&uuml;r ist das gew&uuml;nschte Sonderzeichen bereits in eine Textbeschriftung eingef&uuml;gt zu haben. Dann:</p>
<ol><li>Klicken Sie doppelt auf das Textobjekt, um in den Modus direkte Bearbeitung zu gelangen, und w&auml;hlen Sie den Text, den Sie mit einer Tastenkombination einf&uuml;gen m&ouml;chten. </li>
<li>Klicken Sie mit der rechten Maustaste auf den ausgew&auml;hlten Text und w&auml;hlen Sie <b>Shortcut zuweisen</b> aus. Der Dialog Shortcut verbinden wird ge&ouml;ffnet. Der Text, den Sie ausgew&auml;hlt haben, wird in das Textfeld <b>String</b> eingegeben.  </li>
<li>W&auml;hlen Sie eine Tastenkombination aus dem Auswahlmen&uuml; <b>Schl&uuml;ssel</b> aus.</li>
<li>Klicken Sie auf die Schaltfl&auml;che <b>Hinzuf&uuml;gen</b>.  </li></ol>
<table class="note">

<tr>
<td>
<p>Hinweis: Sie k&ouml;nnen den Text f&uuml;r das Textfeld <b>String</b> auch manuell eingeben. Wenn Sie das tun, m&uuml;ssen Sie jedoch auch jede Formatierungssyntax (z. B. \b(text) etc.) manuell eingeben. Um zum Beispiel eine Tastenkombination f&uuml;r den griechischen Buchstaben <img src="../images/Creating_Text_Labels/math-d744af1210420bc542a6a63b938a5601.png" title="\Pi" alt="\Pi" class="tex"/> einzugeben:</p>
<ol><li>Klicken Sie auf das Hilfsmittel <b>Text</b> und anschlie&szlig;end in Ihr Diagrammfenster. Dies startet den Modus der direkten Bearbeitung.  </li>
<li>Klicken Sie mit der rechten Maustaste und w&auml;hlen Sie <b>Abbildung Symbole</b>.  </li>
<li>W&auml;hlen Sie <img src="../images/Creating_Text_Labels/math-d744af1210420bc542a6a63b938a5601.png" title="\Pi" alt="\Pi" class="tex"/> aus und klicken Sie auf <b>Einf&uuml;gen</b>.  </li>
<li>Klicken Sie auf <b>Schlie&szlig;en</b>.  </li>
<li>Markieren Sie nun das Zeichen und klicken Sie mit der rechten Maustaste darauf.  </li>
<li>W&auml;hlen Sie <b>Shortcut zuweisen</b>.  </li>
<li>W&auml;hlen Sie eine Tastenkombination aus dem Auswahlmen&uuml; <b>Schl&uuml;ssel</b>.</li>
<li>Klicken Sie auf <b>Hinzuf&uuml;gen</b>.<dl><dd><a  class="image"><img alt="Creating Text Labels 04.png" src="../images/Creating_Text_Labels/Creating_Text_Labels_04.png" width="300"  /></a></dd></dl></li>
<li>Klicken Sie auf <b>OK</b>, um den Dialog zu schlie&szlig;en.  </li></ol>
<p>Sie k&ouml;nnen nun <b>STRG+0</b> (beispielsweise) als Tastenkombination f&uuml;r <img src="../images/Creating_Text_Labels/math-d744af1210420bc542a6a63b938a5601.png" title="\Pi" alt="\Pi" class="tex"/> verwenden, wenn Sie Text direkt bearbeiten.</p><p>Weitere Informationen finden Sie unter <a href="../../UserGuide/UserGuide/Escape_Sequences.html" title="UserGuide:Escape Sequences">Escape-Sequenzen</a>.</p>
</td></tr></table>
<p><br /> <i><b>Um eine Tastenkombination zu entfernen:</b></i></p>
<ol><li>&Ouml;ffnen Sie den Dialog <b>Shortcut verbinden</b> erneut.</li>
<li>W&auml;hlen Sie die Tastenkombination, die Sie entfernen wollen, aus dem Listenfeld <b>Aktuelle Shortcuts</b> aus.</li>
<li>Dr&uuml;cken Sie ENTF.</li></ol>
<p><br /></p>
<table class="topiclist">

<tr>
<td> <i><b>Themen, die in diesem Abschnitt behandelt werden:</b></i><div class="CategoryTreeTag" data-ct-mode="20" data-ct-options="{&quot;mode&quot;:20,&quot;hideprefix&quot;:10,&quot;showcount&quot;:false,&quot;namespaces&quot;:false}"><li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Accessing_the_Extended_Character_Set.html">Unicode- und ANSI-Zeichen zu Textbeschriftungen hinzuf&uuml;gen</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Add_hyperlinks_to_text_labels.html">Hyperlinks zu Textbeschriftungen hinzuf&uuml;gen</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Linking_Text_Labels_to_Data_and_Variables.html">Textbeschriftungen mit Daten und Variablen verkn&uuml;pfen</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Inserting_Variables_Extracted_from_Imported_ASCII_Files_into_Text_Labels.html">Variablen aus importierten ASCII-Dateien in Textbeschriftungen einf&uuml;gen</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Escape_Sequences.html">Escape-Sequenzen</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Insert_image_from_file_web.html">Bilder aus Datei, Web-URL oder Arbeitsblattzellen einf&uuml;gen</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/Adding_Page_Layer_Title.html">Titel f&uuml;r Diagrammseiten/Layer hinzuf&uuml;gen</a></li>
		
		</div>
</td></tr></table>





    