<h1 class="firstHeading">Elemente des Diagrammlayers anpassen</h1><p class='urlname' style='display: none'>Customize-Layer-Element</p>
<p><br /></p><p>Die Registerkarten des Dialogs <b>Details Zeichnung</b> auf Layerebene bieten Bedienelemente f&uuml;r die Layerfarbe, die Layergr&ouml;&szlig;e, das Abschneiden von Daten, das Verbergen von Diagrammelementen, das Skalieren von Elementen, wenn der Layer in seiner Gr&ouml;&szlig;e ver&auml;ndert wird, und das Auslassen von Datenpunkten. W&auml;hrend das Diagrammfenster nur eine einzelne Seite enth&auml;lt, kann es mehrere Diagrammlayer beinhalten und jeder einzelne Layer kann unabh&auml;ngig mit Hilfe dieser Bedienelemente der Layerebene konfiguriert werden.</p><p><b>Die Bedienelemente f&uuml;r 2D-Diagramme auf Layerebene</b></p>
<dl><dd><a  class="image"><img alt="Customizing Graph Layer Elements-1.png" src="../images/Customizing_Graph_Layer_Elements/Customizing_Graph_Layer_Elements-1.png" width="751"  /></a></dd></dl>
<p><b>Die Bedienelemente f&uuml;r 3D-Diagramme auf Layerebene</b></p>
<dl><dd><a  class="image"><img alt="Customizing Graph Layer Elements-5.png" src="../images/Customizing_Graph_Layer_Elements/Customizing_Graph_Layer_Elements-5.png" width="875"  /></a></dd></dl>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#The_layer_icon_and_the_active_graph_layer"><span class="tocnumber">1</span> <span class="toctext">Das Layersymbol und der aktive Diagrammlayer</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Displaying_a_layer_background_color_and_adding_a_border"><span class="tocnumber">2</span> <span class="toctext">Layerhintergrundfarbe anzeigen und Rand hinzuf&uuml;gen</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Controlling_the_size_of_the_graph_layer"><span class="tocnumber">3</span> <span class="toctext">Gr&ouml;&szlig;e des Diagrammlayers festlegen</span></a></li>
<li class="toclevel-1 tocsection-4"><a href="#Increasing_screen_redraw_speed:_Graphing_image_caching_and_selective_plotting_of_data"><span class="tocnumber">4</span> <span class="toctext">Aktualisierungsgeschwindigkeit des Diagramms erh&ouml;hen: Grafikzwischenspeicher und ausgew&auml;hltes Zeichnen von Daten</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#Scaling_elements"><span class="tocnumber">5</span> <span class="toctext">Elemente skalieren</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#Showing_and_hiding_elements"><span class="tocnumber">6</span> <span class="toctext">Elemente anzeigen oder verbergen</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Data_plot_drawing_options"><span class="tocnumber">7</span> <span class="toctext">Optionen der Diagrammzeichnung</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#Data_Plots.2C_Graphic_Objects_and_the_Layer_Frame"><span class="tocnumber">8</span> <span class="toctext">Datenzeichnungen, Grafikobjekte und Layerrahmen</span></a><ul>
<li class="toclevel-2 tocsection-9"><a href="#For_2D_Graphs"><span class="tocnumber">8.1</span> <span class="toctext">F&uuml;r 2D-Diagramme</span></a></li>
<li class="toclevel-2 tocsection-10"><a href="#For_3D_Graphs"><span class="tocnumber">8.2</span> <span class="toctext">F&uuml;r 3D-Diagramme</span></a></li>
<li class="toclevel-2 tocsection-11"><a href="#Object_clipping"><span class="tocnumber">8.3</span> <span class="toctext">Objektausschnitte</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-12"><a href="#Rotate_the_3D_graph"><span class="tocnumber">9</span> <span class="toctext">3D-Diagramme drehen</span></a></li>
<li class="toclevel-1 tocsection-13"><a href="#Move_and_adjust_the_planes"><span class="tocnumber">10</span> <span class="toctext">Ebenen verschieben und anpassen</span></a></li>
<li class="toclevel-1 tocsection-14"><a href="#Control_the_light_source"><span class="tocnumber">11</span> <span class="toctext">Lichtquelle festlegen</span></a></li>
</ul>
</div>

<h2><a name="The_layer_icon_and_the_active_graph_layer"></a><span class="mw-headline">Das Layersymbol und der aktive Diagrammlayer</span></h2>
<p>Jeder Layer im Diagrammfenster hat eine Nummer und ist mit einem grauen Symbol in der oberen linken Ecke der Diagrammseite gekennzeichnet. Diese Layersymbole bieten einen visuellen Anhaltspunkt &uuml;ber die Anzahl der vorhandenen Layer und welcher Layer zur Zeit aktiv ist. Sie werden nicht gedruckt oder mit dem Diagramm exportiert. Die Anzeige der Layersymbole kann ein- oder ausgeschaltet werden (<b>Ansicht: Zeige: Layersymbole</b>).</p><p>Wie erw&auml;hnt ist eine der Funktionen der Layersymbole die Anzeige des aktiven Layers. Wenn ein Diagramm auch mehrere Layer haben kann, so ist doch immer nur ein Layer auf einmal aktiv. Der aktive Diagrammlayer wird durch ein gedr&uuml;cktes <b>Layer n</b><i>-</i>Symbol markiert (das Symbol erscheint &quot;flach&quot; und die Nummer ist schwarz). In dieser Abbildung ist Layer <b>2</b> der aktive Layer.</p>
<dl><dd><a  class="image"><img alt="The Graph Layer-1.png" src="../images/Customizing_Graph_Layer_Elements/The_Graph_Layer-1.png" width="104"  /></a></dd></dl>
<p>Wenn Sie ein Diagramm mit mehreren Layern anpassen, bearbeiten Sie notwendigerweise den aktiven Layer. Wenn der gew&uuml;nschte Layer noch nicht aktiv ist, m&uuml;ssen Sie ihn zun&auml;chst aktivieren, bevor Sie die Gr&ouml;&szlig;e oder das Aussehen des Layers anpassen k&ouml;nnen.</p><p>Um einen Layer zu aktivieren, w&auml;hlen Sie eine der folgenden Vorgehensweisen:</p>
<ul><li>Klicken Sie (einmal) auf das Layersymbol <i>n</i> in der oberen linken Ecke des Diagrammfensters (siehe Hinweis unten).</li></ul>
<p><i>oder</i></p>
<ul><li>Klicken Sie auf die X-, Y-, oder Z-Achse (oder auf eine beliebige Stelle des Layerrahmens) des Layers <i>n</i></li></ul>
<p><i>oder</i></p>
<ul><li>Klicken Sie auf ein Objekt (Zeichnung, Textobjekt usw.), das mit dem Layer <i>n</i> verbunden ist.</li></ul>
<p><i>oder</i></p>
<ul><li>Klicken Sie bei gedr&uuml;ckter ALT-Taste auf eine Zeichnung im Layer <i>n</i>.</li></ul>
<p>Beachten Sie, dass, wenn das Dialogfeld <b>Details Zeichnung</b> ge&ouml;ffnet ist, Sie jeden beliebigen Layer der Seite ausw&auml;hlen k&ouml;nnen, indem Sie auf das entsprechende Layersymbol auf der linken Seite des Dialogfelds klicken. Dies erlaubt es Ihnen, die Eigenschaften eines Layers zu bearbeiten, ohne eine der oben genannten Aktionen ausf&uuml;hren zu m&uuml;ssen.</p><p>Der aktive Layer wird auch durch die markierten Diagrammachsen gekennzeichnet, wenn der Men&uuml;befehl <b>Ansicht: Zeige: Markierung bei aktivem Layer</b> ausgew&auml;hlt wurde. Beachten Sie, dass diese Markierung nicht allgemeing&uuml;ltig ist; sie muss f&uuml;r jede Diagrammseite angewendet werden.</p>
<dl><dd><a  class="image"><img alt="The Graph Layer-2.png" src="../images/Customizing_Graph_Layer_Elements/The_Graph_Layer-2.png" width="422"  /></a></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Customizing_Graph_Layer_Elements/Tip_icon.png" width="57"  border="0" /></td><td><p>Zus&auml;tzlich zu den Layersymbolen gibt es eine Anzahl von allgemeinen Elementen f&uuml;r die Diagrammseite, die &uuml;ber <b>Ansicht: Zeigen</b> gezeigt bzw. verborgen werden k&ouml;nnen. Sie k&ouml;nnen aktiviert oder deaktiviert werden.</p>
<dl><dd><a  class="image"><img alt="View show graph elements.png" src="../images/Customizing_Graph_Layer_Elements/View_show_graph_elements.png" width="484"  /></a></dd></dl>
<p>Unter ihnen sind:</p>
<ul><li> <a href="../../UserGuide/UserGuide/Recalculating_Analysis_Results.html#Recalculate_Toolbar_Buttons_and_Operation_Lock_Icons" title="UserGuide:Recalculating Analysis Results">Schlosssymbole</a></li>
<li> <a href="../../UserGuide/Category/Customizing_Graph_Page_Elements.html#Displaying_and_customizing_the_page_grid" title="Category:Customizing Graph Page Elements">Layer- und Seitengitternetze</a></li>
<li> <a href="#Data_Plots.2C_Graphic_Objects_and_the_Layer_Frame">Rahmen</a></li>
<li> <a href="../../UserGuide/UserGuide/Creating_a_master_Page_Layout_for_Graphs.html" title="UserGuide:Creating a master Page Layout for Graphs">Master Items</a></li></ul>
</td></tr></table>
<h2><a name="Displaying_a_layer_background_color_and_adding_a_border"></a><span class="mw-headline">Anzeigen eines Layerhintergrunds und Hinzuf&uuml;gen eines Randes</span></h2>
<p>Standardm&auml;&szlig;ig hat ein Layer keine Hintergrundfarbe, vielmehr wird er transparent angezeigt. Jede Farbe, die der Diagrammseite nachtr&auml;glich zugeordnet wurde, wird auch in jedem Layer der Seite angezeigt. Der Layerrand stellt eine Umrandung au&szlig;erhalb des Layerrahmens dar. &Uuml;ber die Bedienelemente auf der Registerkarte <b>Hintergrund</b> des Dialogfelds <b>Details Zeichnung</b> l&auml;sst sich dem Layer eine (Hintergrund-)Farbe und ein Rahmen hinzuf&uuml;gen.</p><p>Um einem Layer eine Hintergrundfarbe hinzuzuf&uuml;gen:</p>
<ol><li>W&auml;hlen Sie die gew&uuml;nschte Farbe aus der Auswahlliste <b>Farbe</b> aus (<b>Keine</b> = transparent).</li></ol>
<p>Um den Layerrand anzuzeigen:</p>
<ol><li>W&auml;hlen Sie einen Rand aus der Auswahlliste <b>Rahmenstil</b> aus.  </li></ol>
<h2><a name="Controlling_the_size_of_the_graph_layer"></a><span class="mw-headline">Einstellen der Gr&ouml;&szlig;e des Diagrammlayers</span></h2>
<p>Sie k&ouml;nnen ungef&auml;hre Anpassungen der Gr&ouml;&szlig;e des Diagrammlayers vornehmen, indem Sie den Layer ausw&auml;hlen und ein Bedienelement hin&uuml;berziehen.</p><p>Um den Layer zu verschieben oder in seiner Gr&ouml;&szlig;e zu ver&auml;ndern:</p>
<ol><li>Klicken Sie auf den Rahmen, um ihn auszuw&auml;hlen. Die Bedienelemente werden angezeigt.  </li>
<li>Verschieben oder ver&auml;ndern Sie die Gr&ouml;&szlig;e des Rahmens wie bei allen anderen Objekten auch .  </li></ol>
<dl><dd><a  class="image"><img alt="Customizing Graph Layer Elements-2.png" src="../images/Customizing_Graph_Layer_Elements/Customizing_Graph_Layer_Elements-2.png" width="373"  /></a></dd></dl>
<p>Um eine pr&auml;zisere Anpassung vorzunehmen, k&ouml;nnen Sie die Abmessungen des Layers mit Hilfe der Bedienelemente auf der Registerkarte <b>Gr&ouml;&szlig;e</b> des Dialogs <b>Details Zeichnung</b> auf Ebene des Layers bearbeiten.</p><p>Um die Registerkarte <b>Gr&ouml;&szlig;e</b> des Dialogs <b>Details Zeichnung</b> zu &ouml;ffnen:</p>
<ol><li>W&auml;hlen Sie bei aktivem Diagrammfenster <b>Format: Layereigenschaften</b>.  </li>
<li>W&auml;hlen Sie die Registerkarte <b>Gr&ouml;&szlig;e</b>.</li></ol>
<p>Um den Layer &uuml;ber Zahlenangaben zu positionieren oder in seiner Gr&ouml;&szlig;e zu ver&auml;ndern, geben Sie Werte in die Textfelder <b>Links</b>, <b>Oben</b> <b>Breite</b> und <b>H&ouml;he</b> ein. Die Werte im Textfeld <b>Links</b> bestimmen die Position des Rahmens relativ zum linken Rand der Seite. Die Werte im Textfeld <b>Oben</b> bestimmen die Position des Rahmens relativ zum oberen Rand der Seite. Die Werte der Textfelder <b>H&ouml;he</b> und <b>Breite</b> bestimmen die Gr&ouml;&szlig;e des Rahmens. Legen Sie die Einheiten mit der Auswahlliste <b>Einheiten</b> fest.</p>
<ul><li>W&auml;hlen Sie <b>Zoll</b>, <b>cm</b>, <b>mm</b>, <b>Pixel</b> oder <b>Punkt</b>.</li></ul>
<ul><li>Die Einheit <b>% der Seite</b> erweist sich als n&uuml;tzlich, um dieselbe Layergr&ouml;&szlig;e relativ zur Seitengr&ouml;&szlig;e beizubehalten. Wurde diese Einheit ausgew&auml;hlt, entsprechen die Werte in den Textfeldern <b>Links</b>, <b>Oben</b>, <b>H&ouml;he</b> und <b>Breite</b> den Prozentwerten der H&ouml;he und Breite der Diagrammseite.  </li></ul>
<ul><li>Die Option <b>% des verbundenen Layers</b> ist n&uuml;tzlich f&uuml;r die Erstellung von eingesetzten Grafiken. Diese Einheit erm&ouml;glicht Ihnen, die Rahmenabmessungen und den Versatz f&uuml;r das Unterlayer in Angaben der Rahmenabmessungen im Hauptlayer festzulegen. Wurde diese Einheit ausgew&auml;hlt, entsprechen die Werte in den Textfeldern <b>Links</b>, <b>Oben</b>, <b>H&ouml;he</b> und <b>Breite</b> den Prozentwerten der H&ouml;he und Breite des Rahmens im Hauptlayer. Diese Option steht nur dann zur Verf&uuml;gung, wenn der aktuelle Layer mit einem Hauptlayer verkn&uuml;pft ist.</li></ul>
<table class="note">
<tr>
<td>
<p><b>Hinweis:</b></p>
<ul><li>Wird die Auswahl der Einheit &uuml;ber die Auswahlliste ver&auml;ndert, werden die Werte der Textfelder <b>Links</b>, <b>Oben</b>, <b>H&ouml;he</b> und <b>Breite</b> automatisch aktualisiert, so dass der Layer die gleiche Gr&ouml;&szlig;e und Position beibeh&auml;lt.</li></ul>
<ul><li>Die Gr&ouml;&szlig;eneingabe f&uuml;r den Layer bestimmt auch die Gr&ouml;&szlig;e der Achsen im Layer. Um den Layer (und somit auch die Achsen) auf eine bestimmte Breite und H&ouml;he festzulegen, w&auml;hlen Sie die gew&uuml;nschten Einheiten (z.B. <b>Zoll</b>, <b>cm</b> oder <b>mm</b>) aus der Auswahlliste <b>Einheiten</b> in der Gruppe Layerbereich aus und geben anschlie&szlig;end die Abmessungen in die Textfelder <b>Breite</b> und <b>H&ouml;he</b> ein. </li></ul>
</td></tr></table>
<h2><a name="Increasing_screen_redraw_speed:_Graphing_image_caching_and_selective_plotting_of_data"></a><span class="mw-headline">Erh&ouml;hen der Aktualisierungsgeschwindigkeit des Diagramms: Grafikzwischenspeicher und gezieltes Zeichnen von Daten</span></h2>
<ul><li>Der <b>Grafikzwischenspeicher</b> erm&ouml;glicht Ihnen, einen Puffer zur Darstellung von Diagrammen in einem Layer zu verwenden, anstatt die Diagramme jedes Mal, wenn ein Diagrammfenster aktiviert oder ein Dialog, der ein Diagramm verdeckt hat, geschlossen wird, neu zu erstellen.</li></ul>
<ul><li>Im <b>Entwurfsmodus</b> l&auml;sst sich die maximale Anzahl an Datenpunkten festlegen, die f&uuml;r jedes Diagramm in einem Layer angezeigt werden. Dies erh&ouml;ht nicht nur die Aktualisierungsgeschwindigkeit, sondern erm&ouml;glicht Ihnen au&szlig;erdem, systematisch die Anzahl der Datenpunkte in Ihrem Diagramm zu verkleinern (was die Lesbarkeit des Diagramms erh&ouml;hen kann). Um mehr zu erfahren, siehe <a class="external text" href="../../GettingStarted/OriginLab/2D_Graphs.html#Speed_Mode">Entwurfsmodus</a> in der Origin-Hilfe.</li></ul>
<p>Die Bedienelemente des Entwurfsmodus und des Grafikzwischenspeichers befinden sich auf der <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html" title="UserGuide:The (Plot Details) Display Tab">Registerkarte Anzeige und Performance</a> des Dialogs Details Zeichnung auf Ebene des Layers.</p>
<h2><a name="Scaling_elements"></a><span class="mw-headline">Skalieren von Elementen</span></h2>
<p>Es gibt eine Anzahl an Diagrammelementen, die eventuell in ihrer Gr&ouml;&szlig;e angepasst werden m&uuml;ssen, wenn Sie die Gr&ouml;&szlig;e des Layers ver&auml;ndern. Dies beinhaltet die Hilfsbeschriftungen der Achsen, die Beschriftung von Objekten wie beispielsweise die Diagrammlegende und m&ouml;glicherweise hinzugef&uuml;gte Diagrammanmerkungen (Text- und Zeichenobjekte). Wenn Sie dies geschehen lassen wollen oder nicht, gibt es eine Einstellung in den <b>Details Zeichnung</b>, die M&ouml;glichkeiten zum Einstellen der Elementskalierung bietet.</p><p>Die Handhabung der Bedienelemente der Elementskalierung werden mit den folgenden Themen in der Origin-Hilfe abgedeckt:</p>
<ul><li><a href="../../UserGuide/UserGuide/Object_Attachment_and_Scaling.html" title="UserGuide:Object Attachment and Scaling">Objektverbindung und Skalierung</a></li>
<li><a href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html" title="UserGuide:The (Plot Details) Display Tab">Anzeige festlegen und Objekte in einem Layer skalieren</a></li></ul>
<h2><a name="Showing_and_hiding_elements"></a><span class="mw-headline">Anzeigen oder Verbergen von Elementen</span></h2>
<p>Die Registerkarte <b>Anzeige</b> des Dialogs <b>Details Zeichnung</b> beinhaltet Bedienelemente zum Anzeigen oder Verbergen verschiedener Diagrammelemente. Um mehr dar&uuml;ber zu erfahren, lesen Sie bitte <a href="../../UserGuide/UserGuide/Hiding_Labels_Data_and_Layers.html" title="UserGuide:Hiding Labels Data and Layers">Elemente in einem Diagrammlayer verbergen</a> in der Origin-Hilfe.</p>
<h2><a name="Data_plot_drawing_options"></a><span class="mw-headline">Optionen der Diagrammzeichnung</span></h2>
<p>Die Registerkarte <b>Anzeige</b> der <b>Details Zeichnung</b> besitzt Bedienelemente f&uuml;r:</p>
<ul><li>Zeichnen von Diagrammen und Symbolen auf den Layerachsen</li>
<li>Zeichnen von Achsengitterlinien auf Diagrammen und Symbolen</li></ul>
<p>Weitere Einzelheiten finden Sie unter <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html" title="UserGuide:The (Plot Details) Display Tab">Anzeige festlegen und Objekte in einem Layer skalieren</a> in der Origin-Hilfe.</p>
<h2><a name="Data_Plots.2C_Graphic_Objects_and_the_Layer_Frame"></a><span class="mw-headline">Datenzeichnungen, Grafikobjekte und Layerrahmen</span></h2>
<p>Datenzeichnungen und andere mit der Zeichnung verbundene Objekte (Datenbeschriftungen, Fehlerbalken), die &uuml;ber den Layerrahmen hinausgehen, k&ouml;nnen in der Diagrammseite verborgen werden.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Customizing_Graph_Layer_Elements/Tip_icon.png" width="57"  border="0" /></td><td><p>Um den Layerrahmen f&uuml;r die aktive Diagrammseite zu zeigen, w&auml;hlen Sie <b>Ansicht: Zeige: Rahmen</b>.</p></td></tr></table>
<h3><a name="For_2D_Graphs"></a><span class="mw-headline">Bei 2D-Diagrammen</span></h3>
<p><span class='headerInParagraph'>Um das Diagramm an den aktiven Diagrammlayer anzupassen:</span></p>
<ol><li>W&auml;hlen Sie <b>Format: Layer</b>. Hierdurch wird das Dialogfeld Details Zeichnung mit dem ausgew&auml;hlten Layersymbol auf der linken Seite des Dialogfelds ge&ouml;ffnet.  </li>
<li>W&auml;hlen Sie die<a href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html#Data_Drawing_Options_Group" title="UserGuide:The (Plot Details) Display Tab">Registerkarte <b>Anzeige und Performance</b></a> und dann das Kontrollk&auml;stchen <b>Nur innerhalb des Rahmens</b> in der Gruppe <b>Optionen Daten zeichnen</b>. Um die verborgenen Daten wieder anzuzeigen, deaktivieren Sie dieses Kontrollk&auml;stchen.  </li></ol>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Customizing_Graph_Layer_Elements/Alert_icon.png" width="57"  border="0" /></td><td><p>Das Verhalten zum Abschneiden von Daten hat sich seit <b>Origin 2019b</b> etwas ver&auml;ndert. Weitere Informationen finden Sie in <a class="external text" href="../../QuickHelp/QuickHelp/Why_my_data_on_frame_cannot_be_clipped.html">dieser FAQ</a>.</p>
	</td>
	</tr>
	</table>
<p><br /> <span class='headerInParagraph'>Um die Begrenzungsr&auml;nder innerhalb oder au&szlig;erhalb des Layerrahmens zu setzen:</span></p>
<ol><li>Geben Sie die Prozentwerte f&uuml;r die R&auml;nder in die Textfelder <b>Horizontal</b> und <b>Vertikal</b> in der Gruppe <b>Datenzeichnung</b> ein.  </li>
<li>Geben Sie einen negativen Wert ein, um das Diagramm an einem Punkt au&szlig;erhalb des Rahmens anzubringen.  </li>
<li>Geben Sie einen positiven Wert ein, um das Diagramm an einem Punkt innerhalb des Rahmens anzubringen.</li></ol>
<p><br /> Weitere Informationen zu den Bedienelementen zum Beschneiden der Datenfinden Sie in der Dokumentation zur <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html#Data_Drawing_Options_Group" title="UserGuide:The (Plot Details) Display Tab">Registerkarte <b>Anzeige und Performance</b> im Dialog Details Zeichnung</a>.</p><p><span class='headerInParagraph'>Um ein Diagrammobjekt oder einen Diagrammlayer auf der Diagrammseite auszurichten oder zu zentrieren, </span></p>
<ol><li>w&auml;hlen Sie ein Diagrammobjekt oder Layer.</li>
<li>Klicken Sie auf die Schaltfl&auml;chen auf der <a href="../../UserGuide/UserGuide/The_Object_Edit_Toolbar.html" title="UserGuide:The Object Edit Toolbar">Symbolleiste Objekt bearbeiten</a>.<dl><dd>Bitte beachten Sie, dass die verkn&uuml;pften Layer zusammen ausgerichtet werden, wenn Sie eine der Layer an der Seite ausrichten.</dd></dl></li></ol>
<h3><a name="For_3D_Graphs"></a><span class="mw-headline">Bei 3D-Diagrammen</span></h3>
<p><span class='headerInParagraph'>Um 3D-OpenGL-Diagramme zu beschneiden und die R&auml;nder einzustellen:</span></p>
<ol><li>W&auml;hlen Sie <b>Format: Layer</b>. Hierdurch wird das Dialogfeld Details Zeichnung mit dem ausgew&auml;hlten Layersymbol auf der linken Seite des Dialogfelds ge&ouml;ffnet. </li>
<li>Wechseln Sie zur <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Miscellaneous_Tab_for_Layer.html#Clipping" title="UserGuide:The (Plot Details) Miscellaneous Tab for Layer">Registerkarte <b>Sonstiges</b></a> und aktivieren Sie das Kontrollk&auml;stchen <b>Aktivieren</b> unter <b>Abschneiden</b>.</li>
<li>Legen Sie den Rand fest, indem Sie die Werte f&uuml;r <b>% Von</b> und&nbsp;<b>% Bis</b> f&uuml;r jeweils <b>X</b>, <b>Y</b> bzw. <b>Z</b> eingeben.</li></ol>
<h3><a name="Object_clipping"></a><span class="mw-headline">Objektausschnitte</span></h3>
<p>Wenn Sie ein Text- oder Zeichenobjekt zu einem Origin-Diagramm hinzuf&uuml;gen, wird es Teil des Diagrammlayers, der zum Erstellungszeitpunkt des Objekts aktiv war. Dies ist wahr, auch wenn das Objekt au&szlig;erhalb des Layerrahmens erstellt wurde (in dem Fall kann es an die Diagrammseite angeh&auml;ngt sein; weitere Informationen finden Sie unter <a href="../../UserGuide/UserGuide/Object_Attachment_and_Scaling.html" title="UserGuide:Object Attachment and Scaling"><b>Objektanhang und Skalierung</b></a>).</p><p>Standardm&auml;&szlig;ig werden diese Objekte <i>nicht</i> am Layerrahmen ausgerichtet beschnitten. Solche Objekte, die sich au&szlig;erhalb des Layerrahmens befinden, bleiben per Standard sichtbar. Sie k&ouml;nnen jedoch auf Situationen treffen, in denen Sie nicht m&ouml;chten, dass ein Objekt au&szlig;erhalb des Layerrahmens angezeigt wird.</p><p><a  class="image"><img alt="Clip object problem.png" src="../images/Customizing_Graph_Layer_Elements/Clip_object_problem.png" width="797"  /></a></p><p>Sie k&ouml;nnen solche Probleme festlegen, indem Sie die <b>Beschneidungs</b>einstellung auf <b>1</b> setzen.</p><p><b><i>ObjectName</i>.clip=1;</b> // Objekt folgt der Einstellung im Dialog Details Zeichnung &quot;Nur innerhalb des Rahmens&quot; des entsprechenden Layers.</p>
<ol><li> Klicken Sie mit der rechten Maustaste auf das Objekt und w&auml;hlen Sie <b>Eigenschaften</b>.</li>
<li> Klicken Sie auf die Registerkarte <b>Programmierung</b> und setzen Sie die Eigenschaft des Beschneidens mittels des Objekt<b>namens</b> auf 1.</li></ol>
<p>Auf diese Weise wird der Objektausschnitt gezwungen, der Einstellung <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html#Data_Drawing_Options_Group" title="UserGuide:The (Plot Details) Display Tab"><b>Nur innerhalb des Rahmens</b></a> des entsprechenden Layers zu folgen; wenn <b>Daten beschneiden</b> f&uuml;r den Layer eingeschaltet ist, <i>wird jedes enthaltene Objekt, f&uuml;r das die Einstellung auf 1 gesetzt ist</i>, verborgen, wenn es au&szlig;erhalb des Layerrahmens liegt. Beachten Sie, dass diese Einstellung f&uuml;r jedes Objekt einzeln festgelegt werden muss.</p><p><a  class="image"><img alt="Clip object problem2.png" src="../images/Customizing_Graph_Layer_Elements/Clip_object_problem2.png" width="708"  /></a></p><p><br /> Informationen zum Verbinden von Diagrammobjekten mit LabTalk-Skript oder zur Einstellungen <b><i>ObjectName</i>.clip</b> finden Sie unter <a class="external text" href="../../LabTalk/LabTalk/Graphic_Objects.html"><b>Grafische Objekte</b></a>.</p>
<h2><a name="Rotate_the_3D_graph"></a><span class="mw-headline">3D-Diagramme drehen</span></h2>
<p>Sie k&ouml;nnen f&uuml;r 3D-Diagramme Werte f&uuml;r L&auml;nge und Winkel eingeben, um das Diagramm zu drehen.</p><p>Um das 3D-Oberfl&auml;chendiagramm zu drehen, k&ouml;nnen Sie:</p>
<ol><li>W&auml;hlen Sie <b>Rahmen: Layereigenschaften</b>, um den Dialog <b>Details Zeichnung</b> zu &ouml;ffnen.</li>
<li>Gehen Sie zur Registerkarte <b>Achsen</b>, geben Sie <i>50</i> in das Fel der X-L&auml;nge ein und <i>200</i> im Feld <b>Azimut</b>.</li>
<li> Setzen Sie den <b>Perspektivwinkel (0-30)</b> auf <i>20</i>.</li></ol>
<h2><a name="Move_and_adjust_the_planes"></a><span class="mw-headline">Ebenen verschieben und anpassen</span></h2>
<p>In 3D-Diagrammlayern k&ouml;nnen Sie die Position und die Anzeige von XY-, YZ- und ZX-Ebenen festlegen.</p><p>Um die XY-Ebene in die Mitte der Z-Achse verschieben:</p>
<ol><li>W&auml;hlen Sie <b>Rahmen: Layereigenschaften</b>, um den Dialog <b>Details Zeichnung</b> zu &ouml;ffnen.</li>
<li> Wechseln Sie zur Registerkarte <b>Ebenen</b>. Setzen Sie die XY-Position auf dieser Registerkarte auf <b>% Von unten</b> und geben Sie 50 in dem folgenden Feld <b>Prozent/Wert</b> ein.</li>
<li> Setzen Sie die Farbe der XY-Ebene auf Gr&uuml;n und die Transparenz auf 40.</li></ol>
<h2><a name="Control_the_light_source"></a><span class="mw-headline">Lichtquelle festlegen</span></h2>
<p>In dem Layer des 3D-Diagrammlayers k&ouml;nnen Sie die Beleuchtung des 3D-Diagramms steuern, einschlie&szlig;lich Lichtposition und Lichtfarben.</p><p>Um Beleuchtung zu dem 3D-Oberfl&auml;chendiagramm hinzuzuf&uuml;gen, k&ouml;nnen Sie:</p>
<ol><li> W&auml;hlen Sie <b>Rahmen: Layereigenschaften</b>, um den Dialog Details Zeichnung zu &ouml;ffnen.</li>
<li> Gehen Sie zur Registerkarte <b>Beleuchtung</b> und w&auml;hlen Sie <b>Richtung</b>, um die direktionale Beleuchtung zu der Oberfl&auml;che hinzuzuf&uuml;gen.</li>
<li> Passen Sie die Richtung und die Lichtfarbe an, um die Oberfl&auml;che mit Beleuchtung zu zeigen.</li></ol>
<table class="topiclist">

<tr>
<td><i><b>Themen, die in diesem Abschnitt behandelt werden:</b></i><div class="CategoryTreeTag" data-ct-mode="20" data-ct-options="{&quot;mode&quot;:20,&quot;hideprefix&quot;:10,&quot;showcount&quot;:false,&quot;namespaces&quot;:false}"><li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Background_Tab.html">Die Registerkarte Hintergrund (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Size_Speed_Tab.html">Die Registerkarte Gr&ouml;&szlig;e (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Display_Tab.html">Die Registerkarte Anzeige und Performance (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Waterfall_Tab.html">Die Registerkarte Wasserfall (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Stack_Tab.html">Die Registerkarte Stapeln (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Axis_Tab.html">Die Registerkarte Achsen (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Planes_Tab.html">Die Registerkarte Ebenen (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Link_Axes_Scales_Tab.html">Die Registerkarte Achsenskalierungen verbinden (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Miscellaneous_Tab_for_Layer.html">Die Registerkarte Allgemeines (Ebene Graph) (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Lighting_Tab.html">Die Registerkarte Beleuchtung (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Ternary_Tab.html">Die Registerkarte Tern&auml;r (Details Zeichnung)</a></li>
		
		<li> <a class="CategoryTreeLabel  CategoryTreeLabelNs114 CategoryTreeLabelPage" href="../../UserGuide/UserGuide/The_(Plot_Details)_Bridge_Chart_Tab.html">Die Registerkarte Br&uuml;ckendiagramm (Details Zeichnung)</a></li>
		
		</div>
</td></tr></table>

    