<h1 class="firstHeading">Die Origin-Oberfl&auml;che</h1><p class='urlname' style='display: none'>Origin-Interface</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#The_Origin_Workspace"><span class="tocnumber">1</span> <span class="toctext">Der Origin-Arbeitsbereich</span></a><ul>
<li class="toclevel-2 tocsection-2"><a href="#Windows_File_Explorer_Previews"><span class="tocnumber">1.1</span> <span class="toctext">Vorschau des Windows File Explorer</span></a></li>
<li class="toclevel-2 tocsection-3"><a href="#Origin_Menus_and_Menu_Commands"><span class="tocnumber">1.2</span> <span class="toctext">Origin-Men&uuml;s und -Men&uuml;befehle</span></a></li>
<li class="toclevel-2 tocsection-4"><a href="#Origin_Toolbars"><span class="tocnumber">1.3 </span><span class="toctext">Origin-Symbolleisten</span></a></li>
<li class="toclevel-2 tocsection-5"><a href="#Mini_Toolbars"><span class="tocnumber">1.4 </span><span class="toctext">Minisymbolleisten</span></a></li>
<li class="toclevel-2 tocsection-6"><a href="#Start_Menu"><span class="tocnumber">1.5</span> <span class="toctext">Startmen&uuml;</span></a></li>
<li class="toclevel-2 tocsection-7"><a href="#Learning_Center"><span class="tocnumber">1.6</span> <span class="toctext">Lernzentrum</span></a></li>
<li class="toclevel-2 tocsection-8"><a href="#Project_Explorer"><span class="tocnumber">1.7 </span><span class="toctext">Projekt Explorer</span></a><ul>
<li class="toclevel-3 tocsection-9"><a href="#Using_Project_Explorer_to_manage_your_projects"><span class="tocnumber">1.7.1</span> <span class="toctext">Projekt Explorer zum Verwalten Ihrer Projekte verwenden</span></a></li>
<li class="toclevel-3 tocsection-10"><a href="#Folder_Notes"><span class="tocnumber">1.7.2</span> <span class="toctext">Ordnernotizen</span></a></li>
<li class="toclevel-3 tocsection-11"><a href="#Folders_and_Windows_Toolbar"><span class="tocnumber">1.7.3</span> <span class="toctext">Symbolleiste Ordner und Fenster</span></a></li>
<li class="toclevel-3 tocsection-12"><a href="#Window_Shortcuts"><span class="tocnumber">1.7.4</span> <span class="toctext">Fenster-Shortcuts</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-13"><a href="#Apps_Center_and_App_Gallery"><span class="tocnumber">1.8</span> <span class="toctext">App-Center und App-Galerie</span></a></li>
<li class="toclevel-2 tocsection-14"><a href="#Object_Manager"><span class="tocnumber">1.9</span> <span class="toctext">Objektverwaltung</span></a></li>
<li class="toclevel-2 tocsection-15"><a href="#Origin_Child_Windows"><span class="tocnumber">1.10</span> <span class="toctext">Origin-Unterfenster</span></a><ul>
<li class="toclevel-3 tocsection-16"><a href="#Arranging_Child_Windows"><span class="tocnumber">1.10.1</span> <span class="toctext">Unterfenster anordnen</span></a><ul>
<li class="toclevel-4 tocsection-17"><a href="#Arrange_Windows_Dialog"><span class="tocnumber">1.10.1.1</span> <span class="toctext">Dialog Fenster anordnen</span></a></li>
<li class="toclevel-4 tocsection-18"><a href="#Snapping_Windows"><span class="tocnumber">1.10.1.2</span> <span class="toctext">Fenster ausrichten</span></a></li>
</ul>
</li>
<li class="toclevel-3 tocsection-19"><a href="#Float_and_Pin_Child_Windows"><span class="tocnumber">1.10.2</span> <span class="toctext">Unterfenster frei bewegen und verankern</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-20"><a href="#The_Command_Window_and_Script_Window"><span class="tocnumber">1.11</span> <span class="toctext">Das Befehlsfenster und Skriptfenster</span></a></li>
<li class="toclevel-2 tocsection-21"><a href="#The_Formula_Bar"><span class="tocnumber">1.12</span> <span class="toctext">Die Formelleiste</span></a></li>
<li class="toclevel-2 tocsection-22"><a href="#The_Status_Bar"><span class="tocnumber">1.13</span> <span class="toctext">Die Statusleiste</span></a></li>
<li class="toclevel-2 tocsection-23"><a href="#Smart_Hints_and_the_Smart_Hint_Log"><span class="tocnumber">1.14</span> <span class="toctext">Praktische Hinweise</span></a></li>
<li class="toclevel-2 tocsection-24"><a href="#Code_Builder"><span class="tocnumber">1.15</span> <span class="toctext">Code Builder</span></a></li>
<li class="toclevel-2 tocsection-25"><a href="#Messages_Log"><span class="tocnumber">1.16</span> <span class="toctext">Meldungsprotokoll</span></a></li>
<li class="toclevel-2 tocsection-26"><a href="#Results_Log"><span class="tocnumber">1.17</span> <span class="toctext">Ergebnisfenster</span></a></li>
<li class="toclevel-2 tocsection-27"><a href="#Float.2C_Dock_and_Auto-Hide_Windows"><span class="tocnumber">1.18</span> <span class="toctext">Fenster frei bewegen, andocken und automatisch verbergen</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-28"><a href="#Numbers_in_Origin"><span class="tocnumber">2</span> <span class="toctext">Zahlen in Origin</span></a></li>
<li class="toclevel-1 tocsection-29"><a href="#Topics_for_Further_Reading"><span class="tocnumber">3</span> <span class="toctext">Weiterf&uuml;hrende Themen</span></a></li>
</ul>
</div>

<h2><a name="The_Origin_Workspace"></a><span class="mw-headline">Der Origin-Arbeitsbereich</span></h2>
<p><span class="OIndex" style="display:none">Origin-Arbeitsbereich</span></p><p>Dieses Kapitel enth&auml;lt grundlegende Informationen zum Navigieren im Origin-Arbeitsbereich. Versierte Origin-Anwender k&ouml;nnen dieses Kapitel &uuml;berspringen.</p>
<dl><dd><a  class="image"><img alt="GSB Origin Interface.png" src="../images/The_Origin_Interface/GSB_Origin_Interface.png" width="750"  /></a></dd></dl>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Fenstergr&ouml;&szlig;e und -position werden im Arbeitsbereich automatisch angepasst, um die unterschiedlichen Anzeigen zu ber&uuml;cksichtigen. Dies soll dem Wechsel zwischen Ihrem Laptop und einem Monitor mit h&ouml;herer Aufl&ouml;sung Rechnung tragen, so dass Sie die Gr&ouml;&szlig;e/Position jedes Fensters und Dialogs nicht mehr &auml;ndern m&uuml;ssen. Es gibt eine Systemvariable, die das Neuskalierungsverhalten steuert: <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#S"><b>@SRWS</b></a> (<i>0</i> = vorheriges Verhalten; <i>1</i> = Breite anpassen, Y skalieren; <i>2</i> = H&ouml;he anpassen, X skalieren; <i>3</i> (Standard) = Breite und H&ouml;he anpassen).</p></td></tr></table>
<h3><a name="Windows_File_Explorer_Previews"></a><span class="mw-headline">Vorschau des Windows File Explorer</span></h3>
<p>Auch wenn er kein Teil der Origin-Bedienoberfl&auml;che ist, k&ouml;nnen Sie den Windows <b>File Explorer</b> (zuvor &quot;Windows Explorer&quot;) verwenden, um Diagramme in einer Projektdatei als Vorschau anzuzeigen.</p>
<dl><dd><a  class="image"><img alt="Interface Windows Explorer2.png" src="../images/The_Origin_Interface/Interface_Windows_Explorer2.png" width="750"  /></a></dd></dl>
<ul><li> Die <b>gro&szlig;en</b> bzw. <b>extragro&szlig;en Symbole</b> des Windows Explorer (klicken Sie mit der rechten Maustaste auf den Datei-Explorer und w&auml;hlen Sie <b>Ansicht: Gro&szlig;e Symbole</b> bzw. <b>Extragro&szlig;e Symbole</b> oder im Explorer-Men&uuml; <b>Ansicht</b>) zeigen ein Bild des <i>letzten aktiven Diagramms, bevor die Projektdatei gespeichert wurde</i>.</li>
<li> &Ouml;ffnen Sie das Vorschaufeld (<b>ALT + P</b>) und scrollen Sie durch alle Diagramme in der Projektdatei.</li>
<li> Wenn Sie NICHT m&ouml;chten, dass Diagrammvorschauen in der Datei gespeichert werden (entweder in der Symbolansicht oder im Vorschaufeld des Explorers), dann k&ouml;nnen Sie die LabTalk-Systemvariable <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#P.2CQ"><b>@PESS = 0</b> oder <b>= -1</b></a> setzen. Informationen zum &Auml;ndern des Wert einer Systemvariablen finden Sie unter <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">FAQ-708 Wie &auml;ndere ich permanent den Wert einer Systemvariablen?</a>.</li></ul>
<h3><a name="Origin_Menus_and_Menu_Commands"></a><span class="mw-headline">Men&uuml;s und Men&uuml;befehle in Origin</span></h3>
<p><span class="OIndex" style="display:none">Men&uuml;s</span></p>
<ul><li> <b>Kontextsensitivit&auml;t der Men&uuml;leiste und Men&uuml;s</b>: Die Men&uuml;leiste und die Men&uuml;befehle sind kontextsensitiv; sie &auml;ndern sich mit dem Fenstertyp (von Arbeitsblatt in Diagramm zu Matrix beispielsweise). Nur die zu dem aktiven Fenster zugeh&ouml;rigen Men&uuml;s werden angezeigt. </li>
<li> <b>Men&uuml;-Bitmaps, Symbolleistenschaltfl&auml;chen und Tastenkombinationen</b>: Einige Men&uuml;befehle haben Bitmaps, die links von dem Befehl angezeigt werden. Zus&auml;tzlich wird zuweilen eine Tastenkombination rechts von einem Men&uuml;befehl angezeigt. Die Schaltfl&auml;chen-Bitmap und die Tastenkombinationen sind alternative M&ouml;glichkeiten f&uuml;r den Zugriff auf die gleiche Funktionalit&auml;t.</li>
<li> <b>Kontextmen&uuml;befehle</b>: Viele Befehle sind auch in den Kontextmen&uuml;s verf&uuml;gbar. Um ein Kontextmen&uuml; zu &ouml;ffnen, klicken Sie mit der rechten Maustaste auf ein Origin-Objekt (Arbeitsblattfenster, Diagrammachse, Textobjekt etc.). Es werden nur die zugeh&ouml;rigen Men&uuml;befehle gezeigt.</li>
<li> <b>Minimierbare Men&uuml;s</b>: <span class="OIndex" style="display:none">Minimierbare Men&uuml;s</span><span class="OIndex" style="display:none">Vollst&auml;ndige Men&uuml;s</span>Standard ist der minimierte Zustand von Haupt- und Kontextmen&uuml;s in Origin, d.h., es werden nur ein paar Befehle angezeigt. Wenn Sie ein Men&uuml;element verwenden, das nicht in dem Men&uuml; enthalten ist, wird es zu dem Men&uuml; hinzugef&uuml;gt. Wenn Sie es vorziehen, immer die gesamten Men&uuml;s zu sehen, klicken Sie auf <b>Einstellungen: Optionen</b> &gt; <b>Sonstiges</b> und deaktivieren Sie das Kontrollk&auml;stchen <b>Minimierbare Men&uuml;s aktivieren</b>.</li>
<li> <b>Am h&auml;ufigsten verwendete Men&uuml;befehle der Analyse</b>: Die zuletzt verwendeten Men&uuml;befehle werden unten in den Analysemen&uuml;s angezeigt (<b>Worksheet</b>, <b>Analyse</b>, <b>Statistik</b>, <b>Bild</b> etc.). Dies erm&ouml;glicht Ihnen einen schnellen Zugriff auf Hilfsmittel f&uuml;r wiederkehrende Operationen.</li>
<li> <b>Am h&auml;ufigsten zuletzt verwendete Dateien</b>: Mehrere Untermen&uuml;s f&uuml;r <b>Datei</b> (z. B. <b>Datei: Zuletzt verwendete Projekte</b>) bewahren eine Liste der am h&auml;ufigsten zuletzt ge&ouml;ffneten oder gespeicherten Dateien. Auf diese Weise k&ouml;nnen Sie Dateien, an denen Sie aktuell arbeiten, einfach finden und &ouml;ffnen.</li>
<li> <b>Men&uuml; benutzerdefiniert anpassen</b>: Seit Origin 8.1 k&ouml;nnen Origin-Anwender ihre <b>Men&uuml;s benutzerdefiniert anpassen</b> <span class="OIndex" style="display:none">Men&uuml;s, anpassen</span>, indem Sie Men&uuml;elemente hinzuf&uuml;gen oder entfernen. Weitere Informationen erhalten Sie in dem Kapitel <a href="../../GettingStarted/OriginLab/Customizing_Origin.html#Customizing_Menus" title="OriginLab:Customizing Origin"><i>Origin benutzerdefiniert anpassen</i></a> in diesem Handbuch.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Es gibt ein Klartextprotokoll mit den gesamten Aktivit&auml;ten der Origin-Dateien hinzu. Die Datei hat den Namen &quot;OriginProjHistory.txt&quot; und wird in den Anwenderdateien gespeichert (<b>Hilfe: Ordner &ouml;ffnen: Anwenderordner</b>). Die maximale Anzahl der Eintr&auml;ge wird durch die Systemvariable <b>@MHF</b> (Standard = 1000) gesteuert.</p></td></tr></table>
<h3><a name="Origin_Toolbars"></a><span class="mw-headline">Symbolleisten in Origin</span></h3>
<p><span class="OIndex" style="display:none">Symbolleiste, benutzerdefiniert anpassen</span></p><p>Mit Hilfe des Dialogs <b>Anpassen</b> (<b>Ansicht: Symbolleisten</b>) k&ouml;nnen Sie die Anzeige der Symbolleisten steuern und zur&uuml;cksetzen sowie Symbolleisten neu initialisieren.</p>
<ul><li> <b>Anzeige der Symbolleisten benutzerdefiniert anpassen</b>: Verwenden Sie die Bedienelemente auf der Registerkarte <b>Optionen</b> im Dialog <b>Anpassen</b>, um das Aussehen von Schaltfl&auml;chen und Symbolleisten zu modifizieren.</li>
<li> <b>Symbolleiste andocken/frei bewegen</b>: Symbolleisten k&ouml;nnen aus dem Bereich der Symbolleisten gezogen werden und sind dann im Arbeitsbereich frei verschiebbar. Um eine Symbolleiste zu verschieben, f&uuml;hren Sie die Maus &uuml;ber die linke Kante der Symbolleiste. Wenn der Cursor ein vierfacher Pfeil wird, ziehen Sie die Symbolleiste aus dem Symbolleistenbereich. Um die Symbolleiste in ihre vorherige Position zur&uuml;ckzusetzen, klicken Sie doppelt auf die Titelleiste der Symbolleiste. </li>
<li> <b>Symbolleiste verbergen/zeigen</b>: Wenn Sie auf die Schaltfl&auml;che <b>Schlie&szlig;en</b> auf einer frei beweglichen Symbolleiste klicken, wird die Symbolleiste aus der Ansicht entfernt. Um eine verborgene Symbolleiste wiederherzustellen, &ouml;ffnen Sie den Dialog <b>Anpassen</b> und f&uuml;gen Sie auf der Registerkarte <b>Symbolleisten</b> ein H&auml;kchen neben der Symbolleiste hinzu.</li>
<li> <b>Schaltfl&auml;che verbergen/zeigen</b>: Klicken Sie auf einen kleinen Pfeil am rechten Ende einer Symbolleiste und &ouml;ffnen Sie ein Ausklappmen&uuml;, um Schaltfl&auml;chen auf Symbolleisten zu aktivieren/deaktivieren.</li></ul>
<dl><dd><a  class="image"><img alt="UG hide-show toolbar buttons.png" src="../images/The_Origin_Interface/UG_hide-show_toolbar_buttons.png" width="799"  /></a></dd></dl>
<ul><li> <b>Schaltfl&auml;che verschieben/verbergen</b>: Dr&uuml;cken Sie die Alt-Taste und ziehen Sie an einer Schaltfl&auml;che, um sie in eine neue Position zu verschieben, innerhalb einer oder zwischen den Symbolleisten. Dr&uuml;cken Sie die Alt-Taste und ziehen Sie die Schaltfl&auml;che auf eine leere Stelle im Arbeitsbereich, um eine neue Symbolleiste zu erstellen. Oder verbergen Sie eine Schaltfl&auml;che, indem Sie die Alt-Taste dr&uuml;cken und die Schaltfl&auml;che in ein Unterfenster ziehen (keinen leeren Arbeitsbereich!). Wenn die Schaltfl&auml;che als &quot;X&quot; angezeigt wird, lassen Sie los, um die Schaltfl&auml;che auf der Symbolleiste zu verbergen.</li></ul>
<dl><dd><a  class="image"><img alt="UG alt-drag toolbar button.png" src="../images/The_Origin_Interface/UG_alt-drag_toolbar_button.png" width="249"  /></a></dd></dl>
<p>Weitere Informationen zum benutzerdefinierten Anpassen von Origins Standardsymbolleisten, siehe <a href="../../GettingStarted/OriginLab/Customizing_Origin.html#Customizing_Toolbars_and_Buttons" title="OriginLab:Customizing Origin"><b>Symbolleisten und Schaltfl&auml;chen benutzerdefiniert anpassen</b></a> weiter hinten im diesem Handbuch.</p>
<h3><a name="Mini_Toolbars"></a><span class="mw-headline">Minisymbolleisten</span></h3>
<p>OriginLab verbessert die <b>Minisymbolleisten</b> f&uuml;r h&auml;ufig verwendete Objekte und Aufgaben kontinuierlich . Diese Symbolleisten werden angezeigt, wenn die Anwender ein Objekt ausw&auml;hlen oder wenn sie in bestimmte Schl&uuml;sselbereiche innerhalb der Seite klicken. Verf&uuml;gbare Bedienelemente h&auml;ngen vom Kontext ab (ausgew&auml;hltes Objekt, Fenstertyp etc.).</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG interface mini toolbars.png" src="../images/The_Origin_Interface/UG_interface_mini_toolbars.png" width="799"  /></a></dd></dl></dd></dl>
<ul><li> Stellen Sie vor Verwendung der Minisymbolleisten sicher, dass sich neben <b>Ansicht: Minisymbolleisten</b> (Standard) ein H&auml;kchen befindet.</li>
<li> Um die Symbolleiste anzuzeigen, w&auml;hlen Sie ein Objekt wie eine Datenzeichnung, eine Textbeschriftung oder eine Arbeitsblattzelle.</li>
<li> Es gibt zus&auml;tzlich Symbolleisten f&uuml;r allgemeinere Anpassungen auf Seiten- und Layerebene. Diese Symbolleisten werden durch Bewegen der Maus in Randn&auml;he des Fensters angezeigt. Wenn Sie sehen, dass sich Ihr Mauscursor in etwas wie <a  class="image"><img alt="UG sheet toolbar cursor 2.png" src="../images/The_Origin_Interface/UG_sheet_toolbar_cursor_2.png" width="20"  /></a> verwandelt, ist dies Ihr Zeichen daf&uuml;r, dass ein Klick auf diesen Punkt eine Minisymbolleiste der relevanten Hilfsmittel anzeigt. </li></ul>
<dl><dd><dl><dd><dl><dd><a  class="image"><img alt="UG sheet toolbar cursor.png" src="../images/The_Origin_Interface/UG_sheet_toolbar_cursor.png" width="285"  /></a></dd></dl></dd></dl></dd></dl>
<ul><li> Die meisten Minisymbolleisten haben eine Schaltfl&auml;che <b>Eigenschaften</b> <a  class="image"><img alt="Button MT Properties.png" src="../images/The_Origin_Interface/Button_MT_Properties.png" width="24"  /></a>, die Zugriff auf komplexere Einstellungen gew&auml;hrt (z. B. den Dialog Details Zeichnung des Diagrammfensters). </li>
<li> Wenn Sie den Cursor wegbewegen oder nicht schnell genug handeln, wird eine Minisymbolleiste wieder ausgeblendet. Um eine Minisymbolleiste nach dem Ausblenden wiederherzustellen, dr&uuml;cken Sie die Shift-Taste.</li>
<li> Um Schaltfl&auml;chen zu einer Minisymbolleiste hinzuzuf&uuml;gen oder aus ihr zu entfernen, klicken Sie auf die drei Punkte unten in der Mitte der Symbolleiste. Der Dialog <b>Minisymbolleiste benutzterdefiniert anpassen</b> wird ge&ouml;ffnet, in dem Sie Schaltfl&auml;che nach Bedarf aktivieren bzw. deaktivieren k&ouml;nnen.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="UG customize mini toolbar dialog.png" src="../images/The_Origin_Interface/UG_customize_mini_toolbar_dialog.png" width="771"  /></a></dd></dl></dd></dl>
<h3><a name="Start_Menu"></a><span class="mw-headline">Startmen&uuml;</span></h3>
<p>Geben Sie Stichw&ouml;rter und Phrasen in das Feld <b>Suchen</b> ein, um relevante <b>Men&uuml;</b>eintr&auml;ge, <b>Apps</b>, <b>FAQ</b>, <b>Videos</b> und <b>X-Funktionen</b> anzuzeigen. &Ouml;ffnen Sie zuletzt ge&ouml;ffnete <b>Dateien</b>, <b>Men&uuml;s</b> und <b>Apps</b>.</p><p>&Ouml;ffnen Sie das <b>Start</b>men&uuml;, indem Sie (1) <b>F1</b> dr&uuml;cken (wenn keine anderen Dialoge offen sind), (2) auf das Suchsymbol mit der Lupe unten links im Origin-Arbeitsbereich klicken oder (3) im Hauptmen&uuml; auf <b>Hilfe: Startmen&uuml; aktivieren</b> w&auml;hlen.</p>
<dl><dd><a  class="image"><img alt="Start menu result.png" src="../images/The_Origin_Interface/Start_menu_result.png" width="447"  /></a></dd></dl>
<p>Um Ihre Suche zu verfeinern, geben Sie die folgenden Buchstaben vor den Suchbegriffen ein:<br /> <br /><b>m</b> = Sucht nur Men&uuml;eintr&auml;ge <br /><b>a</b> = Sucht nur Apps <br /><b>h</b> = Sucht nur Hilfethemen + FAQs <br /><b>v</b> = Sucht nur Videos <br /><b>x</b> = Sucht nur X-Funktionen <br /><b>p</b> = Sucht nur zuletzt verwendete Projekte <br /><b>s</b> = Sucht nur Beispielprojekte <br /><b>e</b> = Sucht nur Men&uuml;s + Apps + X-Funktionen (nur ausf&uuml;hrbar)</p><p><i><b>Alternativ:</b></i></p><p>Klicken Sie auf das Symbol neben dem Suchfeld, um die <b>Einstellungen</b> zu &ouml;ffnen. Hier k&ouml;nnen SIe die Suchergebnisse einschr&auml;nken und andere Sucheinstellungen ver&auml;ndern.</p>
<dl><dd><a  class="image"><img alt="Start menu settings.png" src="../images/The_Origin_Interface/Start_menu_settings.png" width="586"  /></a></dd></dl>
<h3><a name="Learning_Center"></a><span class="mw-headline">Lernzentrum</span></h3>
<p>Das <b>Lernzentrum</b> ist ein Dialog, der beim Start von Origin angezeigt wird und dazu dienen soll, Ihnen einen schnellen Zugriff auf Diagramm- und Analysebeispiele zu gew&auml;hren. Erg&auml;nzt wird das durch verschiedene Lernressourcen (Tutorials, Videos, den OriginLab Blog etc.).</p>
<ol><li> Um den Dialog zu &ouml;ffnen, w&auml;hlen Sie <b>Hilfe: Lernzentrum</b> oder dr&uuml;cken Sie F11.</li>
<li> Aktivieren oder deaktivieren Sie das Kontrollk&auml;stchen <b>Bei Start zeigen</b>, um diesen Dialog jedes Mal zu zeigen, wenn Origin ge&ouml;ffnet wird.</li></ol>
<p><a  class="image"><img alt="ORG-14520-75PC.png" src="../images/The_Origin_Interface/ORG-14520-75PC.png" width="781"  /></a></p>
<ul><li> Zeigen und laden Sie Beispieldiagramme, einschlie&szlig;lich Beispieldaten und Hinweise, zum erneuten Erstellen des Diagramms.</li>
<li> Laden Sie Analysebeispiele mit Daten.</li>
<li> Navigieren Sie &uuml;ber die Registerkarte <b>Lernressourcen</b> zu Tutorials und Videos und Links zum Origin Blog, Anwenderforum und Seiten der sozialen Medien von Origin.</li>
<li> Verschieben Sie Dateien aus Ihrem vorherigen <a class="external text" href="../../UserGuide/UserGuide/Transfer_User_Files.html"><b>Anwenderdateiordner</b></a> in Ihren neuen Anwenderdateiordner.</li></ul>
<p><br /></p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Um die neuen Diagramme in <b>Origin 2023</b> zu sehen, &ouml;ffnen Sie das Lernzentrum, klicken Sie auf die Registerkarte <b>Diagrammbeispiele</b>, setzen Sie den Diagrammfilter der Auswahlliste auf <i>Alle Diagrammtypen</i> und suchen Sie nach <i>2023</i>.</p></td></tr></table>
<h3><a name="Project_Explorer"></a><span class="mw-headline">Projekt Explorer</span></h3>
<p>Der <b><span class="OIndex">Projekt Explorer</span></b> ist ein Hilfsmittel, das Sie dabei unterst&uuml;tzt, die Inhalte Ihrer Origin-Projektdateien (OPJ) zu verwalten.</p>
<dl><dd><a  class="image"><img alt="PE window features2.png" src="../images/The_Origin_Interface/PE_window_features2.png" width="695"  /></a></dd></dl>
<p>Der Projekt Explorer besteht aus zwei Bedienfeldern. Das erste Bedienfeld zeigt die Ordnerstruktur der Projektdatei (OPJ). Das Unterbedienfeld zeigt Fenster, die in dem Ordner enthalten sind, der im Hauptbedienfeld markiert ist.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Vor 2018 listete das untere Bedienfeld die Unterordner in dem Ordner auf, der im oberen Bedienfeld ausgew&auml;hlt war. Um diesen Anzeigemodus wiederherzustellen, <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">setzen Sie den Wert</a> der Systemvariable <b>@PEF = 1</b>.</p></td></tr></table>
<h4><a name="Using_Project_Explorer_to_manage_your_projects"></a><span class="mw-headline">Projekt Explorer zum Verwalten Ihrer Projekte verwenden</span></h4>
<ul><li> Klicken Sie mit der rechten Maustaste auf die Titelleiste des Projekt Explorers oder klicken Sie auf die Auswahlliste, um die Bedienfelder gestapelt anzuzeigen (<b>Vertikale Ausrichtung</b>) oder nebeneinander (<b>Horizontale Ausrichtung</b>).</li>
<li> Kontextmen&uuml;s in beiden Bedienfeldern bieten Optionen zum L&ouml;schen, Verbergen, Drucken etc. Men&uuml;optionen variieren abh&auml;ngig davon, was ausgew&auml;hlt ist bzw. auf welche Stelle Sie mit der rechten Maustaste geklickt haben. </li>
<li> Die Auswahl von mehreren Fenstern im untergeordneten Bedienfeld wird unterst&uuml;tzt (halten Sie Shift oder Strg gedr&uuml;ckt, w&auml;hrend Sie mit der Maus Ihre Auswahl treffen).</li>
<li> Das untergeordnete Bedienfeld unterst&uuml;tzt unterschiedliche Ansichten der Fenster: <b>Details</b> (Standard), <b>Liste</b>, <b>Kleine Symbole</b>, <b>Gro&szlig;e Symbole</b>, <b>Extragro&szlig;e Symbole</b>. </li>
<li> In jeder Ansicht wird durch Bewegen der Maus &uuml;ber ein Fenstersymbol eine Popup-Vorschau des Diagramms, des Arbeitsblatt, der Matrix oder des Layoutfensters gezeigt. Der Inhalt des Notizfensters wird in einem Tooltipp gezeigt.</li></ul>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Um die Vorschauen des Projekt Explorers zu deaktivieren, <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">setzen Sie den Wert</a> der Systemvariablen <b>@PEF = 1</b>.</p></td></tr></table>
<ul><li> Steuern Sie die Anzeige der Vorschauen per Rechtsklick auf das Unterbedienfeld und setzen Sie ein H&auml;kchen neben <b>Strg-Taste f&uuml;r Vorschauanzeige gedr&uuml;ckt halten</b>. Ab nun werden Popups nur angezeigt, wenn Sie die Strg-Taste dr&uuml;cken.</li></ul>
<dl><dd><a  class="image"><img alt="PE Preview on Hover.png" src="../images/The_Origin_Interface/PE_Preview_on_Hover.png" width="516"  /></a></dd></dl>
<ul><li> Wenn Sie die Fenster mit <b>extragro&szlig;en Symbolen</b> anzeigen, zeigt das Unterbedienfeld des Projekt Explorers eine Miniaturbild der Diagramme, Layoutfenster, Arbeits- und Matrixmappen. Der Inhalt des Notizfensters wird in einem Tooltipp gezeigt.</li></ul>
<dl><dd><a  class="image"><img alt="PE XLicons and tooltip3 600.png" src="../images/The_Origin_Interface/PE_XLicons_and_tooltip3_600.png" width="767"  /></a></dd></dl>
<ul><li> Sie k&ouml;nnen mit der rechten Maustaste auf einen PE-Ordner (oberes Bedienfeld) klicken und <b>Kopieren</b> w&auml;hlen -- oder Sie markieren den Ordner und dr&uuml;cken Strg + C und Strg + V --, um Ordnerstruktur und -inhalt zu kopieren und (a) in einen anderen Ordner im aktuellen Projekt oder (b) in ein anderes Projekt, das in einer zweiten Origin-Sitzung ausgef&uuml;hrt wird, einzuf&uuml;gen. Zum Kopieren eines einzelnen Arbeitsmappenfensters klicken Sie mit der rechten Maustaste auf das Fenster (unteres Bedienfeld) und kopieren und f&uuml;gen Sie das Fenster ein: (a) in einen anderen Ordner im gleichen Projekt oder (b) in ein neues Projekt, das in einer zweiten Origin-Sitzung ausgef&uuml;hrt wird.</li></ul>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tutorial_icon.png" width="57"  border="0" /></td>
	<td><ol><li> W&auml;hlen Sie <b>Hilfe: Ordner &ouml;ffnen: Programmordner</b> und klicken Sie auf den Unterordner <b>Samples</b>. Ziehen Sie dann die Datei <i>Tutorial Data.opj</i> in Ihren Origin-Arbeitsbereich.</li>
<li> Standardm&auml;&szlig;ig ist der Projekt Explorer am linken Rand des Origin-Arbeitsbereichs im Modus Automatisch verbergen angedockt. Bewegen Sie Ihre Maus &uuml;ber die Registerkarte des <b>Projekt Explorers</b>, um das zugeh&ouml;rige Fenster des Projekt Explorers anzuzeigen.<dl><dd><a  class="image"><img alt="PE tab mouseover.png" src="../images/The_Origin_Interface/PE_tab_mouseover.png" width="615"  /></a></dd></dl></li>
<li> Klicken Sie auf das Symbol der &quot;Stecknadel&quot; auf der Titelleiste des Projekt Explorers, um das Fenster in der angedockten Position zu befestigen.<dl><dd><a  class="image"><img alt="PE tab pushpin.png" src="../images/The_Origin_Interface/PE_tab_pushpin.png" width="396"  /></a></dd></dl></li>
<li> Standard des untergeordneten Bedienfelds ist die Ansicht Details. In dieser Ansicht werden die Fenstermetadaten wie <b>Name</b>, <b>Gr&ouml;&szlig;e</b> und <b>Kommentare</b> unter den entsprechenden Spalten&uuml;berschriften gezeigt. Ziehen Sie jetzt an den Spaltenk&ouml;pfen, um sie neu zu ordnen.<dl><dd><a  class="image"><img alt="PE headings.png" src="../images/The_Origin_Interface/PE_headings.png" width="759"  /></a></dd></dl></li>
<li> Klicken Sie mit rechten Maustaste auf die Spalten&uuml;berschriften und zeigen bzw. verbergen Sie sie, indem Sie das Kontrollk&auml;stchen neben der jeweiligen &Uuml;berschrift aktivieren bzw. deaktivieren.<dl><dd><a  class="image"><img alt="PE hide show headers.png" src="../images/The_Origin_Interface/PE_hide_show_headers.png" width="721"  /></a></dd></dl></li>
<li> Um einen Kommentar im Feld <b>Kommentare</b> hinzuzuf&uuml;gen, klicken Sie einmal, machen Sie eine kurze Pause und klicken Sie ein zweites Mal. So gelangen Sie in den Bearbeitungsmodus. Geben Sie einen Kommentar ein.<dl><dd> <a  class="image"><img alt="PE add comments.png" src="../images/The_Origin_Interface/PE_add_comments.png" width="675"  /></a></dd></dl></li>
<li> Um den Namen eines Fensters zu sehen, klicken Sie mit der rechten Maustaste auf die Zeile und w&auml;hlen Sie <b>Umbenennen</b>. Standard ist, dass das Feld <b>Name</b> den <b>Kurznamen</b> des Fensters anzeigt oder, falls ein Fensterlangname existiert den <b>Langnamen</b> (alle Fenster m&uuml;ssen einen Kurznamen haben; Langnamen sind optional). Klicken Sie auf die Schaltfl&auml;che <b>SN</b> oder <b>LN</b> rechts von dem bearbeitbaren Feld <b>Name</b>, um den Kurz- oder Langnamen zu bearbeiten. Wenn der Langname nicht existiert, k&ouml;nnen Sie einen eingeben.<dl><dd><a  class="image"><img alt="PE rename.png" src="../images/The_Origin_Interface/PE_rename.png" width="675"  /></a></dd></dl></li>
<li> Scrollen Sie im oberen Bedienfeld des Projekt Explorers zum Ordner <b>3D Surface with Point Label</b> und klicken Sie auf ihn. Das Unterbedienfeld zeigt, dass es drei Fenster im Ordner gibt. Beachten Sie, dass das Arbeitsblattfenster <i>eastcali3053</i> fett ist und damit anzeigt, dass es das aktive Fenster ist - das Fenster, mit dem gearbeitet wird und das bestimmt, welche Operationen verf&uuml;gbar sind. Es gibt auch ein Notizfenster und ein Matrixfenster mit dem Namen <i>MBook4</i>.<dl><dd><a  class="image"><img alt="PE active window.png" src="../images/The_Origin_Interface/PE_active_window.png" width="584"  /></a></dd></dl></li>
<li> Klicken Sie im Unterbedienfeld doppelt auf <i>MBook4</i> und beachten Sie, dass es jetzt fett ist und einen magentafarbenen &quot;Halo&quot; um sich herum hat, ein Kennzeichen daf&uuml;r, dass es sich um das aktive Fenster handelt. Sie sehen auch, dass das gesamte Fenster (im Arbeitsbereich) mit einem Halo angezeigt wird, der farblich mit Hilfe der <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#A">Systemvariablen @AWC</a> angepasst werden kann -- ein weiterer Hinweis darauf, dass dies das &quot;aktive&quot; Fenster ist. Klicken Sie erneut doppelt auf das Symbol <i>MBook4</i> und beachten Sie, dass das Symbol jetzt gedimmt ist. Beachten Sie auch, dass das tats&auml;chliche Fenster aus dem Arbeitsbereich verschwindet. Dies liegt daran, weil <i>MBook4</i> jetzt verborgen ist. Klicken Sie erneut doppelt auf das Symbol <i>MBook4</i>. Das Fenster wird wiederhergestellt und aktiviert.<dl><dd><a  class="image"><img alt="PE window hidden.png" src="../images/The_Origin_Interface/PE_window_hidden.png" width="673"  /></a></dd></dl></li>
<li> Klicken Sie bei aktivem <i>MBook4</i> auf <b>Zeichnen &gt; 3D: Oberfl&auml;che: 3D-Farbabbildung</b>. Auf diese Weise wird ein 3D-Oberfl&auml;chendiagramm mit Farbabbildung erstellt (schlie&szlig;en Sie die Warnmeldung). Beachten Sie auch, dass ein neues Fenster -- <i>Graph1</i> -- zum Unterbedienfeld des Projekt Explorers hinzugef&uuml;gt wurde .</li>
<li> Klicken Sie mit der rechten Maustaste auf einen leeren Teil des Unterbedienfeld und w&auml;hlen Sie <b>Ansicht: Extra gro&szlig;e Symbole</b>. Beachten Sie, dass <i>Graph1</i> jetzt als Miniaturbild des Diagramms angezeigt wird.<dl><dd><a  class="image"><img alt="PE XLarge Icons.png" src="../images/The_Origin_Interface/PE_XLarge_Icons.png" width="485"  /></a></dd></dl></li>
<li> Klicken Sie erneut mit der rechten Maustaste und w&auml;hlen Sie <b>Ansicht: Gro&szlig;e Symbole</b>. Beachten Sie, dass Fenster jetzt durch Symbole dargestellt werden. Wenn Sie jedoch mit der Maus &uuml;ber sie fahren, wird Ihnen der  Fensterinhalt als Popup angezeigt.<dl><dd><a  class="image"><img alt="PE large icon popup.png" src="../images/The_Origin_Interface/PE_large_icon_popup.png" width="295"  /></a></dd></dl></li></ol>
</td></tr></table>
<h4><a name="Folder_Notes"></a><span class="mw-headline">Ordnernotizen</span></h4>
<p>Sie k&ouml;nnen <b>Ordnernotizen</b> zu einem Ordner im Projekt Explorer hinzuf&uuml;gen.</p>
<ol><li> Klicken Sie mit der rechten Maustaste auf einen Ordner und w&auml;hlen Sie <b>Ordnernotizen</b>.<ul><li> Wenn kein Ordner <b>Kommentar</b> existiert, werden ein leeres Fenster f&uuml;r die <b>Ordnernotizen</b> zum Ordner hinzugef&uuml;gt (siehe auf <a href="../../GettingStarted/OriginLab/Publishing_and_Export.html#Notes_Windows_for_Reporting" title="OriginLab:Publishing and Export">dieser Seite</a> Optionen zum Hinzuf&uuml;gen und Anzeigen des Notizfensterinhalts).</li>
<li> Falls es einen <b>Kommentar</b> gibt (<b>Hinweis</b>: Klicken Sie mit der rechten Maustaste auf den Ordner und w&auml;hlen Sie <b>Eigenschaften</b>.) wird durch Hinzuf&uuml;gen von <b>Ordnernotizen</b> der <b>Kommentar</b> in das Fenster der Ordnernotizen kopiert.</li>
<li> Beim Wechseln zwischen Ordnern wie zum Beispiel mit der <a href="#Origin_Toolbars">neuen Symbolleiste <b>Ordner und Fenster</b></a> werden diese <b>Ordnernotizen</b> immer im Arbeitsbereich angezeigt, unabh&auml;ngig davon, ob sie <i>verankert</i> oder <i>minimiert</i> sind. </li>
<li> Wenn Sie die <b>Ordnernotizen</b> <i>schlie&szlig;en</i> (d. h. durch Klicken auf die Schaltfl&auml;che <b>Schlie&szlig;en</b> <a  class="image"><img alt="Button close embedded.png" src="../images/The_Origin_Interface/Button_close_embedded.png" width="32"  /></a>), werden Sie im Ordner eingebettet und erst dann wieder angezeigt, wenn Sie mit der rechten Maustaste auf den Ordner im PE klicken und <b>Ordnernotizen</b> w&auml;hlen.</li></ul></li></ol>
<p><br /> <i><b>Zus&auml;tzlich:</b></i></p>
<ul><li> Dr&uuml;cken Sie die Strg-Taste und bewegen Sie Ihre Maus &uuml;ber einen Ordner im Projekt Explorer, um den <a href="../../GettingStarted/OriginLab/Publishing_and_Export.html#Notes_Windows_for_Reporting" title="OriginLab:Publishing and Export">gerenderten Inhalt des Notizfensters</a> zu sehen.</li>
<li> Die Systemvariable <b>@FNS</b> wurde hinzugef&uuml;gt, um zu bestimmen, welche Syntax der Stand f&uuml;r die Ordnernotizen sein soll (= <i>0</i> (Text), = <i>1</i> (HTML), = <i>2</i> (Markdown), or = <i>3</i> Origin Rich Text (Standard)).</li>
<li> Es wurde eine Minisymbolleiste hinzugef&uuml;gt mit <b>Ordnernotizen</b>, <b>Duplikatsordner</b> und <b>Dialog Ordnereigenschaften &ouml;ffnen</b>.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="UG PE toolbar 2023.png" src="../images/The_Origin_Interface/UG_PE_toolbar_2023.png" width="379"  /></a></dd></dl></dd></dl>
<h4><a name="Folders_and_Windows_Toolbar"></a><span class="mw-headline">Symbolleiste Ordner und Fenster</span></h4>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Eine neue Symbolleiste <b>Ordner und Fenster</b> wurde hinzugef&uuml;gt, um mit Ordnern und Ordnerinhalt des Projekt Explorers zu arbeiten. Bei der ersten Ausf&uuml;hrung von Origin 2023 sehen Sie eventuell diese neue Symbolleiste &quot;frei beweglich&quot; im Origin-Arbeitsbereich. Sie k&ouml;nnen sie (an der Titelleiste) zu einem leeren Bereich der Symbolleistenfl&auml;che ziehen. Oder Sie k&ouml;nnen <b>Ansicht: Symbolleisten</b> w&auml;hlen und auf die Schaltfl&auml;che <b>Erneut initialisieren</b> klicken, um die Symbolleisten auf die Standardkonfiguration zur&uuml;ckzusetzen.</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG folders windows toolbar.png" src="../images/The_Origin_Interface/UG_folders_windows_toolbar.png" width="179"  /></a></dd></dl></dd></dl>
</td></tr></table>
<p>Die Symbolleiste <i>Ordner und Fenster</i> macht es einfacher, zwischen den Ordnern des Projekt Explorers (PE) zu wechseln (<b>Zur&uuml;ck zum vorherigen Ordner</b>) oder das aktive Fenster als einen Shortcut in den vorherigen Ordner einzuf&uuml;gen. Au&szlig;erdem kann das aktive Fenster &uuml;ber <b>Fenster: Fenster anordnen: &lt;Zuletzt verwendet&gt;</b> verankert oder die Fenster im aktiven Ordner angeordnet werden.</p>
<ul><li> <b>Ordner zur&uuml;ck</b>: Vom aktuellen Ordner zum vorherigen Ordner zur&uuml;ckkehren.</li>
<li> <b>Ordner weiter</b>: Vom vorherigen Ordner zum aktuellen Ordner zur&uuml;ckkehren.</li>
<li> <b>Zur&uuml;ck zum vorherigen Ordner</b>: Zwischen den beiden Orderner hin- und herwechseln (Strg + Alt + X). Im Men&uuml; <b>Fenster: Zur&uuml;ck zum vorherigen Ordner</b>. </li>
<li> <b>Shortcut des aktiven Fensters f&uuml;r Zur&uuml;ck zum vorherigen Ordner hinzuf&uuml;gen</b>: Das aktive Fenster mit dem vorherigen Ordner als Shortcut teilen (Strg + Shift +F7). Alternativ klicken Sie mit der rechten Maustaste auf den Fenstertitel und f&uuml;gen einen Shortcut zum vorherigen Ordner hinzu. </li>
<li> <b>Shortcuts von vorherigem Ordner hinzuf&uuml;gen</b>: Shortcuts nach Fenstertyp zum aktuellen Ordner hinzuf&uuml;gen.</li>
<li> <b>Fenster anordnen (zuletzt verwendet)</b>: Wie <b>Fenster: Fenster anordnen &lt;Zuletzt verwendet&gt;</b>.</li>
<li> <b>Aktives Fenster verankern</b>: Fenster verankern, so dass es nicht eingeschlossen ist, wenn auf <b>Fenster anordnen (Zuletzt verwendet)</b> geklickt wird. Alternativ klicken Sie mit der rechten Maustaste auf den Fenstertitel und <b>verankern Sie das Fenster</b> (oder l&ouml;sen Sie es).</li></ul>
<h4><a name="Window_Shortcuts"></a><span class="mw-headline">Fenster-Shortcuts</span></h4>
<p>Wenn Si in einem Ordner der Projekt Explorer sind, k&ouml;nnen Sie mit der Maus &uuml;ber einen anderen Ordner fahren, mit der rechten Maustaste klicken und <b>Shortcuts hinzuf&uuml;gen</b>. Ein Dialog zum Hinzuf&uuml;gen von Fenstern als Shortcuts nach Typ wird zum aktiven Ordner hinzugef&uuml;gt.</p>
<dl><dd> <a  class="image"><img alt="UG add shortcuts to active folder dialog.png" src="../images/The_Origin_Interface/UG_add_shortcuts_to_active_folder_dialog.png" width="376"  /></a></dd></dl>
<ul><li> Wenn ein Shortcutfenster zum aktiven Ordner hinzugef&uuml;gt wurde, wird eine Home-Schaltfl&auml;che angezeigt (&quot;Zum urspr&uuml;nglichen Ordner wechseln&quot;) <a  class="image"><img alt="UG go to original.png" src="../images/The_Origin_Interface/UG_go_to_original.png" width="32"  /></a>. Das Klicken auf die Schaltfl&auml;che navigiert zum (und aktiviert) das urspr&uuml;ngliche Fenster in dem Ordner, in dem es sich befindet.</li>
<li> Ein Shortcutfenster zeigt den Namen des Ordners im PE in Klammern auf der Fenstertitelleiste an.</li>
<li> Wenn Sie auf <b>Schlie&szlig;en</b> <a  class="image"><img alt="UG close window button.png" src="../images/The_Origin_Interface/UG_close_window_button.png" width="32"  /></a> in einem Shortcutfenster klicken, wird der Shortcut im aktuellen Ordner verborgen.</li>
<li> Um Shortcuts aus dem aktiven Ordner zu entfernen, klicken Sie mit der rechten Maustaste auf den Ordner im Projekt Explorer und <b>entfernen Sie die Shortcuts</b> (abgeblendet, wenn es keine zu entfernenden Shortycuts gibt).</li>
<li> Minimierte oder maximierte Fenster, die als Shortcuts hinzugef&uuml;gt worden sind, werden oben oder unten wiederhergestellt, so dass sie sichtbar sind, aber nicht den Arbeitsbereich f&uuml;llen.</li></ul>
<h3><a name="Apps_Center_and_App_Gallery"></a><span class="mw-headline">App-Center und App-Galerie</span></h3>
<p><span class="OIndex" style="display:none">Apps-Galerie</span> <b>Apps</b> sind benutzerdefinierte  Add-On-Applikationen f&uuml;r Origin, die spezifische Aufgaben der grafischen Darstellung und/oder Analyse durchf&uuml;hren. Ein kleine Anzahl von Apps, die verbreitet Anwendung in Wissenschaft und Ingenieurwesen finden, ist auf Ihrer Origin-Software vorinstalliert.<br /> <a  class="image"><img alt="LaTeX apps gallery.png" src="../images/The_Origin_Interface/LaTeX_apps_gallery.png" width="490"  /></a></p><p>Verwenden Sie den Dialog <b>App-Center</b> zum Durchsuchen, Aktualisieren bzw. Herunterladen von Origin-Apps. Dieser neue Dialog gestattet direkten Zugriff auf die Apps im Dateiaustausch von OriginLab, ohne dass Sie einen Browser &ouml;ffnen m&uuml;ssen.<br /> <a  class="image"><img alt="Interface App Central.png" src="../images/The_Origin_Interface/Interface_App_Central.png" width="747"  /></a></p><p>Um das App-Center zu &ouml;ffnen, klicken Sie auf die Schaltfl&auml;che <b>Apps hinzuf&uuml;gen</b>, die auf allen Registerkarten der Apps-Galerie angezeigt wird. Die Apps-Galerie befindet sich am rechten Rand des Origin-Arbeitsbereichs. Falls Sie die Apps-Galerie nicht sehen, klicken Sie auf <b>Ansicht: Apps</b> (oder ALT + 9) und &uuml;berpr&uuml;fen Sie, ob sich ein H&auml;kchen neben <b>Apps</b> befindet.</p>
<ul><li> Installierte und <b>aktuelle Apps</b> werden im App-Center mit einem gr&uuml;nen H&auml;kchen angezeigt. <a  class="image"><img alt="AC OK Icon.png" src="../images/The_Origin_Interface/AC_OK_Icon.png" width="26"  /></a> </li>
<li> Installierte Apps, f&uuml;r die es eine neuere Version gibt, werden mit einem <b>Update</b>-Symbol neben ihnen angezeigt. <a  class="image"><img alt="AC Update Icon.png" src="../images/The_Origin_Interface/AC_Update_Icon.png" width="26"  /></a></li>
<li> Die nicht installierten Apps werden mit dem Symbol <b>Download und Installation</b> angezeigt. <a  class="image"><img alt="AC Download Icon.png" src="../images/The_Origin_Interface/AC_Download_Icon.png" width="26"  /></a></li></ul>
<p>Origins Men&uuml;s <b>Statistik</b>, <b>Analyse: Anpassen</b> und <b>Analyse: Peaks und Basislinie</b> enthalten den Eintrag <b>Apps suchen</b>. Durch Klicken auf <b>Apps suchen</b> wird das App-Center aufgerufen, das nur die Apps zeigt, die f&uuml;r das aktuelle Men&uuml; (z. B. Statistik) relevant sind. Sie k&ouml;nnen Apps direkt vom App-Center aus herunterladen und aktualisieren.</p><p>Verwenden Sie die <b>App-Galerie</b>, um Ihre installierten Apps zu organisieren und auf sie zuzugreifen.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Neue Apps und Updates von Apps werden kontinuierlich f&uuml;r Anwender von Origin und OriginPro bereit gestellt. &Ouml;ffnen Sie Ihr App-Center gelegentlich (dazu dr&uuml;cken Sie die Taste <b>F10</b>). Falls die rote Schaltfl&auml;che <b>Jetzt herunterladen</b> (Download Now) angezeigt wird, klicken Sie auf die aktuelle Liste der verf&uuml;gbaren Apps.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Check Apps Update.png" src="../images/The_Origin_Interface/Check_Apps_Update.png" width="165"  /></a></dd></dl></dd></dl>
</td></tr></table>
<p>Weitere Informationen zu Apps finden Sie unter <a class="external text" href="http://originlab.com/index.aspx?go=PRODUCTS&amp;PID=3236" target="_blank"><b>www.originlab.com/apps</b></a>.</p>
<h3><a name="Object_Manager"></a><span class="mw-headline">Objektverwaltung</span></h3>
<p><span class="OIndex" style="display:none">Objektverwaltung</span> Die <b>Objektverwaltung</b> ist ein andockbares Bedienfeld, das standardm&auml;&szlig;ig auf der rechten Seite des Arbeitsbereichs ge&ouml;ffnet wird. Verwenden Sie die Objektverwaltung zur <a href="../../GettingStarted/OriginLab/2D_Graphs.html#Removing_or_Hiding_Plots_with_the_Object_Manager" title="OriginLab:2D Graphs">schnellen Bearbeitung</a> des aktiven Diagramm- oder Arbeitsmappenfensters.</p><p><br /> <i><b>fenster r&uuml;ckg&auml;ngig machen</b></i></p>
<ul><li> W&auml;hlen Sie ein Element (Layer, Zeichnungsgruppe, Datenzeichnung oder spezieller Punkt) in der Objektverwaltung, um das entsprechende Element in dem Diagrammfenster auszuw&auml;hlen und <i>umgekehrt</i>. Die Auswahl (a) blendet alle anderen Zeichnungen in dem Diagrammlayer ab und (b) w&auml;hlt die Quelldaten im Arbeitsblatt.</li></ul>
<dl><dd><a  class="image"><img alt="Object manager highlight.png" src="../images/The_Origin_Interface/Object_manager_highlight.png" width="797"  /></a></dd></dl>
<ul><li> Die <b>Objektverwaltung</b> verf&uuml;gt nun &uuml;ber die Ansichten &quot;Diagrammobjekte&quot; und &quot;Zeichnungen&quot; f&uuml;r Diagrammfenster. Klicken Sie mit der rechten Maustaste auf einen leeren Bereich der Objektverwaltung und w&auml;hlen Sie <b>Zeichnungen zeigen</b>/<b>Diagrammobjekte zeigen</b> oder dr&uuml;cken Sie Strg + Shift + S, um zwischen den zwei Ansichten zu wechseln.</li></ul>
<dl><dd><a  class="image"><img alt="UG OM objects vs plots.png" src="../images/The_Origin_Interface/UG_OM_objects_vs_plots.png" width="789"  /></a></dd></dl>
<ul><li> Verbergen oder zeigen Sie Zeichnungen oder Diagrammobjekte, indem Sie das entsprechende Kontrollk&auml;stchen in der Objektverwaltung deaktivieren bzw. aktivieren.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="Object manager hide element.png" src="../images/The_Origin_Interface/Object_manager_hide_element.png" width="594"  /></a></dd></dl></dd></dl>
<ul><li> &Auml;ndern Sie auf Grafikebene die Listenreihenfolge der Objektverwaltung (<b>Zeichenreihenfolge</b> oder die Umkehrung -- <b>Reihenfolge des Auftretens</b>).</li>
<li> Sie k&ouml;nnen die Layerreihenfolge auf Layerebene &auml;ndern.</li>
<li> Sie k&ouml;nnen auf Zeichnungsebene Beschriftungen zeigen, Zeichnungen zeigen/verbergen, Zeichnungen neu ordnen oder Zeichnungsgruppen erstellen.</li>
<li> Innerhalb einer Zeichnungsgruppe (bezeichnet als g<i>N</i>) k&ouml;nnen Sie die Gruppierung aufheben, die Reihenfolge der Zeichnungen durch Ziehen oder mittels des Kontextmen&uuml;s neu ordnen, den Diagrammtyp &auml;ndern.</li>
<li> Sie k&ouml;nnen eine Zeichnung (permanent) aus dem Diagrammfenster entfernen.</li>
<li> Auf die Dialoge <b>Details Zeichnung</b>, <b>Layerinhalt</b> und <b>Diagrammeinstellungen</b> zugreifen</li>
<li> Klicken Sie mit der rechten Maustaste auf das Layersymbol und w&auml;hlen Sie <b>Zeichnungsreihenfolge umkehren</b>.</li></ul>
<p><br /> <i><b>Arbeitsmappen- oder Matrixfenster</b></i></p><p>Die Objektverwaltung unterst&uuml;tzt auch bestimmte Aktionen f&uuml;r Arbeitsmappen und Matrizen:</p>
<ul><li> Es werden alle Bl&auml;tter in der aktiven Arbeitsmappe oder Matrix aufgelistet.</li>
<li> W&auml;hlen Sie schnell mehrere Bl&auml;tter aus, indem Sie die Tasten STRG + Pfeil nach oben/unten dr&uuml;cken.</li>
<li> Klicken Sie auf ein Blatt in der Objektverwaltung, um das entsprechende Blatt in der Arbeitsmappe oder Matrix zu aktivieren.</li>
<li> Klicken Sie mit der rechten Maustaste in die Objektverwaltung, um Zugriff auf die g&auml;ngigen Arbeitsblattoperationen zu erhalten, einschlie&szlig;lich <b>L&ouml;schen</b>, <b>Einf&uuml;gen</b>, <b>Hinzuf&uuml;gen</b>, <b>Verschieben</b>, <b>Kopieren</b> und <b>Duplizieren</b>.</li>
<li> Klicken Sie zum <b>Umbenennen</b> mit der rechten Maustaste in der Objektverwaltung auf eine Matrix oder virtuelle Matrix.</li></ul>
<p><br /></p>
<dl><dd><dl><dd><a  class="image"><img alt="UG UI OM workbook.png" src="../images/The_Origin_Interface/UG_UI_OM_workbook.png" width="494"  /></a></dd></dl></dd></dl>
<p><br /> <i><b>Layoutfenster</b></i></p><p>Wenn eine <b>Layoutseite</b> aktiv ist, listet die <b>Objektverwaltung</b> jetzt die Objekte auf und l&auml;sst ihre Anordnung &uuml;ber Kontextmen&uuml;befehle zu.</p>
<ul><li> Alle Objekte, einschlie&szlig;lich hinzugef&uuml;gter Diagramme, Tabellen und Textobjekte, werden nun in der Objektverwaltung aufgef&uuml;hrt.</li>
<li> Objekte k&ouml;nnen verborgen oder gezeigt werden, indem die zugeh&ouml;rigen K&auml;stchen aktiviert bzw. deaktiviert sind.</li>
<li> W&auml;hlen Sie mehrere Objekte in der Objektverwaltung, klicken Sie dann mit der rechten Maustaste und richten Sie sie aus bzw. verteilen Sie sie mit Hilfe von Kontextmen&uuml;befehlen.</li></ul>
<h3><a name="Origin_Child_Windows"></a><span class="mw-headline">Origin-Unterfenster</span></h3>
<p><span class="OIndex" style="display:none">Unterfenster</span></p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p><i><b>Aktive Fenster</b></i> -- das Fenster, in dem die Zeichen- und Analyseoperationen durchgef&uuml;hrt werden -- werden von einem farbigen Rahmen umgeben, um das aktive Fenster auff&auml;lliger zu machen. Sie k&ouml;nnen die Eigenschaften der Kennzeichnung des aktiven Fensters (Rahmenfarbe, Position des Rahmens, Stil der Rahmenlinie) mit <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#A">&quot;@ Systemvariablen&quot;</a> <b>@AWC</b> (Farbe) und <b>@AWI</b> (Stil) nach eigenen Geschmack anpassen.<br /></p>
<dl><dd><dl><dd><a  class="image"><img alt="Active window halo.png" src="../images/The_Origin_Interface/Active_window_halo.png" width="410"  /></a></dd></dl></dd></dl>
</td></tr></table>
<ul><li> <b>Arbeitsmappen</b>: Die Origin-Arbeitsmappe stellt einen Rahmen f&uuml;r das Importieren, Organisieren, Analysieren, Transformieren und Zeichnen Ihrer Daten zur Verf&uuml;gung. Die mit Reitern ausgestattete Arbeitsmappe kann zwischen 1 Blatt und 1.024 Bl&auml;tter enthalten. Jedes Blatt kann mehr als eine Million Zeilen und mehr als 65.000 Datenspalten enthalten. Zus&auml;tzlich zu Ihren Daten k&ouml;nnen Arbeitsmappenfenster Diagramme, Anmerkungen, spaltenbasierte Funktionen, Skripte und programmierbare Schaltfl&auml;chenobjekte, LabTalk-Variablen sowie Importfilter enthalten. </li>
<li> <b>Matrixmappen</b>: Wie das Arbeitsblatt ist das Matrixblatt ein Gitternetz aus Zellen, angeordnet in Zeilen und Spalten. Der Hauptunterschied liegt darin, dass im Arbeitsblatt jede Spalte ein Datensatz ist und jeder Datensatz so konfiguriert werden kann, dass er verschiedene Datentypen (Text, Text &amp; numerisch, numerisch (doppelt), numerisch (Int) usw.) enth&auml;lt. Die Matrix ist im Gegensatz dazu ein einzelner numerischer Datensatz aus Z-Werten, die in der XY-Ebene durch Indexnummern f&uuml;r Zeilen (Y) und Spalten (X) zueinander in Bezug gesetzt werden. Die Matrixmappe enth&auml;lt zwischen 1 Blatt und 1.024 Bl&auml;ttern. Jedes Blatt kann mehrere Matrixobjekte enthalten (bis zu 65.504).</li>
<li> <b>Diagramme</b>: Datenzeichnungen befinden sich prim&auml;r in Diagrammfenstern. Origin unterst&uuml;tzt &uuml;ber 100 Diagrammtypen, die wegen ihrer guten Anwendbarkeit in verschiedenen technischen Bereichen ausgew&auml;hlt wurden. Jedes Diagramm basiert auf einer in der Software enthaltenen, benutzerdefinierbaren Diagrammvorlage, die mit Ihren benutzerdefinierten Einstellungen gespeichert werden kann. Neben Zeichnungen kann das Diagramm auch Anmerkungen enthalten (Text und Zeichenobjekte) oder Schaltfl&auml;chen, mit denen Sie eine benutzerdefinierte Routine zur grafischen Darstellung oder Analyse durchf&uuml;hren k&ouml;nnen. Diagrammfenster k&ouml;nnen in Arbeitsblattzellen eingef&uuml;gt werden oder sich &quot;frei&quot; in Arbeitsbl&auml;tter (au&szlig;erhalb des Gitternetzes) in einem Arbeitsmappenfenster bewegen. </li>
<li> <b>Bilder</b>: Das Bildfenster ist ein Fenster zum Importieren, Anzeigen und Bearbeiten von Rasterbildern und Videos (.avi, .mov, .mp4).</li>
<li> <b>Funktionsdiagramme</b>: Das Funktionsdiagramm ist ein spezialisiertes Diagrammfenster, das eine durch eine Funktion beschriebene Kurve anzeigt. Das Funktionsdiagramm unterscheidet sich von anderen Origin-Diagrammen dadurch, dass es nicht auf Grundlage eines Datensatzes mit diskreten Werten erstellt wurde (obwohl Sie nach dem Zeichnen Daten erzeugen k&ouml;nnen). </li>
<li> <b>Layoutseiten</b>: Das Layoutfenster erm&ouml;glicht Ihnen die Kombination und Anordnung von Diagramm- und Arbeitsblattfenstern und verschiedenen Anmerkungen in einer einzigen &quot;Darstellungsebene&quot;. Es wird in erster Linie zur Erstellung von Pr&auml;sentationen verwendet. </li>
<li> <b>Excel-Arbeitsmappen</b> Excel-Arbeitsmappen k&ouml;nnen in Origin ge&ouml;ffnet oder erstellt werden. Arbeitsmappen k&ouml;nnen separat oder als Teil Ihrer Origin-Projektdatei gespeichert werden.<span class="OIndex" style="display:none">Excel</span> </li>
<li> <b>Hinweise</b>: Das Notizfenster unterst&uuml;tzt Klartext, Rich Text, HTML und Markdown. Verwenden Sie es f&uuml;r einfache Aufgaben wie das Aufzeichnen von Analyseverfahren, das Erstellen von Notizen f&uuml;r Studierende und Kollegen und das Ausschneiden und Einf&uuml;gen von Text aus anderen Applikationen. Oder rendern Sie hochformatierten Text, einschlie&szlig;lich <a href="../../GettingStarted/OriginLab/Publishing_and_Export.html#HTML_Reports_from_Notes_Windows" title="OriginLab:Publishing and Export">HTML-Berichte</a> und mathematische Ausdr&uuml;cke.</li></ul>
<dl><dd><dl><dd><a  class="image"><img alt="KaTeX Notes window.png" src="../images/The_Origin_Interface/KaTeX_Notes_window.png" width="391"  /></a></dd></dl></dd></dl>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen zu Origins Unterfenstern finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Grundlagen von Origin &gt; Elemente des Origin-Arbeitsbereichs &gt; <a class="external text" href="../../UserGuide/UserGuide/Creating_Child_Window.html">Ein Unterfenster erstellen</a></b></p><p><b>Hilfe: Origin: Origin-Hilfe &gt; Grundlagen von Origin &gt; Elemente des Origin-Arbeitsbereichs &gt; <a class="external text" href="../../UserGuide/UserGuide/Basic_Child_Window_Operations.html">Grundlegende Operationen der Unterfenster</a></b></p>
</td></tr></table>
<p><br /> <br /> <i><b>Um ein Origin-Unterfenster unabh&auml;ngig von der Origin-Projektdatei zu speichern:</b></i></p>
<ul><li> W&auml;hlen Sie <b>Datei: Fenster speichern unter...</b>, um das aktive Fenster zu speichern. Die Dateierweiterungen OGW(U), OGG(U) und OGM(U) sind f&uuml;r Arbeitsmappen-, Diagramm- bzw. Matrixfenster von Origin.</li>
<li> Klicken Sie mit der rechten Maustaste auf die Fenstertitelleiste und w&auml;hlen Sie im Kontextmen&uuml; <b>Speichern unter...</b> </li></ul>
<p><br /> Hinweis: Um ein Excel-Fenster als externe Excel-Datei zu speichern, klicken Sie mit der rechten Maustaste auf die Titelleiste des Excel-Fensters in Origin und w&auml;hlen Sie <b>Arbeitsmappe speichern unter...</b> im Kontextmen&uuml;.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Origin 2018 f&uuml;gte <b>Unicode-Unterst&uuml;tzung (UTF-8)</b> f&uuml;r Origin-Projekte, -Unterfenster und -Vorlagen hinzu. Wenn Sie eine Fensterdatei speichern -- <i>mit Ausnahme der Projektdatei, die seit Origin 2023 nur Unicode-kompatibel (*.opju) gespeichert werden kann </i> --, haben Sie die Option eine Datei mit oder ohne ein an den Dateityp (*.otp oder *.otpu) angeh&auml;ngtes  &quot;<b>u</b>&quot; zu speichern. Wenn Sie beabsichtigen, die Datei nur in der neuesten Version von Origin zu verwenden, sollten Sie die Unicode-Option (angeh&auml;ngtes &quot;u&quot;) verwenden, da sie einige Vorteile hinsichtlich der Performance zeigt.</p></td></tr></table>
<p><br /> <i><b>Um ein Arbeitsblatt, ein Diagramm, eine Matrix oder ein Notizfenster zu &ouml;ffnen, das in einer Datei gespeichert wurde:</b></i></p>
<ul><li> W&auml;hlen Sie <b>Datei: &Ouml;ffnen</b> oder klicken Sie auf die Schaltfl&auml;che <b>Excel &ouml;ffnen</b> <a  class="image"><img alt="Button Open.png" src="../images/The_Origin_Interface/Button_Open.png" width="25"  /></a> in der Symbolleiste Standard, um Fensterdateien zu &ouml;ffnen. </li>
<li> W&auml;hlen Sie <b>Datei: Zuletzt verwendete Mappen</b> bzw. <b>Datei: Zuletzt verwendete Diagramme</b>, um zuletzt gespeicherte Dateien von Arbeitsmappen- und Diagrammfenstern zu &ouml;ffnen. </li></ul>
<p><b>Hinweis:</b> Origin unterst&uuml;tzt <b>Kurznamen</b>, <b>Langnamen</b> und <b>Kommentare</b> f&uuml;r Fenster. Kurznamen m&uuml;ssen in einem Origin-Projekt einzigartig sein. Der Fensterkurzname wird umbenannt, wenn dieser Name bereits im Projekt existiert. Wenn Sie die Fensterdatei im aktuellen Projekt &ouml;ffnen und das Projekt dann speichern, wird das Fenster im Projekt eingeschlossen.</p><p><br /> <i><b>Um eine Excel-Arbeitsmappe zu &ouml;ffnen:</b></i></p>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Alert_icon.png" width="57"  border="0" /></td><td><p>Wenn Sie beabsichtigen, mit Excel-Dateien in Origin zu arbeiten, lesen Sie bitte diesen <a class="external text" href="../../UserGuide/UserGuide/Working_with_Microsoft_Excel.html#Working_with_Excel_Books_inside_Origin">Abschnitt der Origin-Hilfe</a>, bevor Sie fortfahren.</p>
	</td>
	</tr>
	</table>
<ul><li> W&auml;hlen Sie im Men&uuml; <b>Datei: Excel &ouml;ffnen...</b>, um eine externe Excel-Arbeitsmappe zu &ouml;ffnen. Sie k&ouml;nnen auch auf die Schaltfl&auml;che <b>Excel importieren</b> auf der Symbolleiste <b>Standard</b> klicken oder <b>Daten: Aus Datei importieren: Excel (XLS, XLSX, XLSM)...</b> im Hauptmen&uuml; w&auml;hlen, um die Excel-Datei zu importieren. </li></ul>
<p><b>Hinweis</b>: Wenn Sie <b>Excel &ouml;ffnen</b> w&auml;hlen, wird die Excel-Datei auch als Excel-Arbeitsmappe in einem Excel-Sitzung ge&ouml;ffnet, die in Origin ausgef&uuml;hrt wird. In diesem Modus haben Sie nur eingeschr&auml;nkten Zugriff auf die Origin-Funktionen. Wenn Sie <a class="external text" href="../../UserGuide/UserGuide/Importing_from_Excel.html#Importing_Excel_Data_using_the_Import_Excel_Data_Connector_Dialog"><b>Daten: Mit Datei verbinden: Excel</b></a> oder <a class="external text" href="../../UserGuide/UserGuide/Importing_from_Excel.html#Importing_Excel_Data_using_the_impMSExcel_X-Function_Dialog"><b>Daten: Aus Datei importieren: Excel</b></a> w&auml;hlen, wird die Excel-Datei in eine Origin-Arbeitsmappe importiert und alle Origin-Funktionen sind verf&uuml;gbar.</p>
<h4><a name="Arranging_Child_Windows"></a><span class="mw-headline">Unterfenster anordnen</span></h4>
<p>Origin f&uuml;gt einige neue Hilfsmittel zum Anordnen von Fenstern hinzu, die &uuml;ber die grundlegenden Funktionalit&auml;ten <b>Anordnen</b> und <b>Alle anordnen</b> hinausgehen. Benutzer in der Industrie und Forschung, die mit Monitoren mit hoher Aufl&ouml;sung und vielen Fenstern arbeiten, sollten die Hilfsmittel hilfreich finden.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><ul><li>Die <a href="#Origin_Toolbars">Symbolleiste <b>Ordner und Fenster</b></a> hat eine Schaltfl&auml;che <b>Aktives Fenster verankern</b>, die verwendet wird, um das aktive Fenster auszuschlie&szlig;en, wenn Fenster mit dem Men&uuml;befehl oder der Symbolleistenschaltfl&auml;che angeordnet werden. Durch Klicken auf diese Schaltfl&auml;che wird eine Schaltfl&auml;che zum Verankern <a  class="image"><img alt="UG Notes pin button.png" src="../images/The_Origin_Interface/UG_Notes_pin_button.png" width="32"  /></a> zur Fenstertitelleiste hinzugef&uuml;gt. Klicken Sie alternativ mit der rechten Maustaste auf ein beliebiges Fenster und w&auml;hlen Sie im Kontextmen&uuml; <b>Fenster verankern</b>. </li>
<li>Ab und zu entscheiden Sie sich eventuell -- nach Anordnen der Fenster --, ein Fenster f&uuml;r eine bessere Anzeige zu vergr&ouml;&szlig;ern. Sie k&ouml;nnen die vorherige Gr&ouml;&szlig;e und Position des Fensters wiederherstellen, indem Sie auf <b>Fenster: Fenstergr&ouml;&szlig;e wiederherstellen</b> (Strg + Shift + Z) klicken. </li></ul>
</td></tr></table>
<h5><a name="Arrange_Windows_Dialog"></a><span class="mw-headline">Dialog Fenster anordnen</span></h5>
<p>Zentral bei der Verwendung dieser Hilfsmittel ist der Dialog <b>Fenster anordnen</b> (winarrange) (<b>Fenster: Fenster anordnen</b>).</p>
<dl><dd><a  class="image"><img alt="UG winarrange dlg.png" src="../images/The_Origin_Interface/UG_winarrange_dlg.png" width="373"  /></a></dd></dl>
<p>Verwenden Sie den Dialog, um Fenster im Origin-Arbeitsbereich zu sortieren und anzuordnen.</p>
<ul><li> Ordnen Sie die Fenster in Spalten an.</li>
<li> Sortieren Sie nach Reihenfolge der Aktivierung, Reihenfolge des Projekt Explorers oder nach Fenstername (aufsteigend, absteigend).</li>
<li> Sortieren Sie innerhalb des Fenstertyps.</li>
<li> In horizontaler Richtung (links nach rechts) oder vertikaler Richtung (oben nach unten).</li>
<li> &Uuml;berlappen Sie jede Spalte (Kaskade) mit benutzerdefiniertem <b>Versatz</b>.</li>
<li> Alle obigen Anordnungen enthalten k&ouml;nnen minimierte Fenster enthalten oder auch nicht.</li></ul>
<h5><a name="Snapping_Windows"></a><span class="mw-headline">Fenster ausrichten</span></h5>
<p>Fenster, die in Zeilen und Spalten angeordnet werden, k&ouml;nnen ausgerichtet, d. h. &quot;eingerastet&quot; werden. Das hei&szlig;t, Sie werden entlang einer gemeinsamen Kante gezogen und in ihrer Gr&ouml;&szlig;e ver&auml;ndert. Das visuelle Kennzeichen zum Verwenden dieses &quot;Einrastens&quot; ist ein gr&uuml;ner Balken.</p>
<ol><li> Sie k&ouml;nnen diese Funktion ein- und ausschalten, indem Sie im Men&uuml; <b>Fenster: Fenster ausrichten</b> (Strg+F12) w&auml;hlen.</li></ol>
<dl><dd><a  class="image"><img alt="UG snap green bar.png" src="../images/The_Origin_Interface/UG_snap_green_bar.png" width="583"  /></a></dd></dl>
<p><br /></p>
<ul><li> Um die Gr&ouml;&szlig;e eines einzelnen Fensters ohne &quot;Einrasten&quot; zu ver&auml;ndern, dr&uuml;cken Sie die Shift-Taste, w&auml;hrend Sie den Fensterrahmen ziehen.</li>
<li> Wenn angeordnete Fenster den Arbeitsbereich abdecken, tauschen Sie zwei Fensterpositionen aus, indem Sie die ALT-Taste dr&uuml;cken, w&auml;hrend Sie die Titelleiste des Fensters ziehen.</li>
<li> Um ein Fenster in einem leeren Bereich auszurichten, dr&uuml;cken Sie w&auml;hrend des Ziehens die Shift-Taste.</li></ul>
<p><br /></p>
<h4><a name="Float_and_Pin_Child_Windows"></a><span class="mw-headline">Unterfenster frei bewegen und verankern</span></h4>
<p>Seit Origin 2023b k&ouml;nnen Unterfenster au&szlig;erhalb des Origin-Arbeitsbereich als <a class="external text" href="../../UserGuide/UserGuide/Floating_Windows.html">frei bewegliche Fenster</a> verschoben werden. Diese Fenster verf&uuml;gen &uuml;ber benutzerdefinierbare Men&uuml;s und Symbolleistenschaltfl&auml;chen, so dass Sie nicht zum Hauptfenster von Origin zur&uuml;ckkehren m&uuml;ssen, um Zugriff auf sie zu haben.</p><p>Frei bewegliche Fenster werden automatisch verankert, so dass sie beim Wechseln von Ordnern im Projekt Explorer beibehalten werden.</p><p><a class="external text" href="../../UserGuide/UserGuide/Basic_Child_Window_Operations.html#Pin_Windows">Verankerte Fenster</a> innerhalb von Origin werden beim Wechseln der Ordner im Projekt Explorer beibehalten. Um zum alten Verhalten zur&uuml;ckzukehren, setzen Sie die Systemvariable @pws = 0.</p>
<h3><a name="The_Command_Window_and_Script_Window"></a><span class="mw-headline">Das Befehlsfenster und Skriptfenster</span></h3>
<p>Das <b>Befehlsfenster</b> kann verwendet werden, um LabTalk-Befehle an Origin zu geben, einfache mathematische Berechnungen auszuf&uuml;hren oder den Wert von LabTalk-Variablen zu pr&uuml;fen. Das <span class="OIndex">Befehlsfenster</span> unterh&auml;lt einen Befehlsverlauf mit Zeitstempel, der von Sitzung zu Sitzung mitgenommen werden kann, und verf&uuml;gt &uuml;ber IntelliSense und damit &uuml;ber die Funktion der automatischen Vervollst&auml;ndigung beim Schreiben von X-Funktionsbefehlen. Das Befehlsfenster kann angedockt werden und hat zwei Bedienfelder. Der linke Bereich zeigt den Befehlsverlauf, w&auml;hrend der rechte Bereich die Eingabe von Befehlen erm&ouml;glicht.</p><p>Das <b>Skriptfenster</b> ist &auml;lter als das Befehlsfenster. Es unterst&uuml;tzt nicht alle Funktionen des Befehlsfensters (es gibt keine Befehlsaufforderung und keinen scrollbaren Befehlsverlauf), aber es ist praktisch zum Ausf&uuml;hren von einfachen LabTalk-Befehlen beim Cursor (Ausf&uuml;hren mehrzeiliger Skripte durch Markieren des gesamten Skripts und Dr&uuml;cken von Enter). Das Men&uuml; <b>Hilfsmittel</b> des Fensters &ouml;ffnet auch den Dialog <b>LabTalk-Variablen und -Funktionen</b>, in dem eine Liste der Origin-Variablen, -Funktionen, -Makros, ungebundenen Datens&auml;tze etc. angezeigt werden.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Das Skriptfenster unterst&uuml;tzt auch Unicode, automatische Vervollst&auml;ndigung, Syntaxf&auml;rbung und Steuern/Zoom der Schriftgr&ouml;&szlig;e (Strg + Mausrad). Diese Funktionen sollten die Bedienbarkeit, insbesondere f&uuml;r 4K-Monitore, verbessern. Wenn Sie Skriptfenster mit &quot;Klartext&quot; m&ouml;chten, setzen Sie <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#N%7C"><b>@NSW = 0</b></a> (Hilfe zum Festlegen des Werts einer Systemvariable finden Sie in <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">dieser FAQ</a>).</p></td></tr></table>
<p><br /> <i><b>Um das Befehlsfenster zu &ouml;ffnen:</b></i></p>
<ul><li> Klicken Sie die Schaltfl&auml;che <b>Befehlsfenster</b> <a  class="image"><img alt="Button Command Window.png" src="../images/The_Origin_Interface/Button_Command_Window.png" width="23"  /></a> in der Symbolleiste Standard. Alternativ k&ouml;nnen Sie  im Men&uuml; <b>Fenster: Befehlsfenster</b> w&auml;hlen oder ALT+3 dr&uuml;cken.</li></ul>
<p><br /> <i><b>Um das Skriptfenster zu &ouml;ffnen:</b></i></p>
<ul><li> W&auml;hlen Sie im Men&uuml; <b>Fenster: Skriptfenster</b> oder dr&uuml;cken Sie SHIFT+ALT+3.</li></ul>
<h3><a name="The_Formula_Bar"></a><span class="mw-headline">Die Formelleiste</span></h3>
<p>Die <b>Formelleiste</b> &auml;hnelt den Formelleisten in OpenOffice und Excel. Auch wenn es nicht erforderlich ist, die Formelleiste zu verwenden, um Zellenausdr&uuml;cke einzugeben, bietet sie die Vorteile der Funktionssuche, der interaktiven Bereichsauswahl und der verbesserten Sichtbarkeit der Ausdr&uuml;cke, insbesondere langer Ausdr&uuml;cke, die die Zellenbreite &uuml;berschreiten.</p>
<dl><dd><a  class="image"><img alt="UG Formula Bar UI.png" src="../images/The_Origin_Interface/UG_Formula_Bar_UI.png" width="741"  /></a></dd></dl>
<ol><li> Sie k&ouml;nnen die Formelleiste bei aktiver Arbeitsmappe ein- und ausschalten, indem Sie auf <b>Ansicht: Formelleiste</b> im Hauptmen&uuml; klicken.</li>
<li> Um die Schriftgr&ouml;&szlig;e zu &auml;ndern, <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">&auml;ndern Sie den Wert der LabTalk-Systemvariable <b>@FBFS</b></a> (Standardwert ist &quot;130&quot;).</li></ol>
<p><br /> Weitere Informationen finden Sie im <a href="../../GettingStarted/OriginLab/Workbooks_Worksheets_Columns.html#The_Formula_Bar" title="OriginLab:Workbooks Worksheets Columns">Kapitel <b>Arbeitsmappen, Arbeitsbl&auml;tter und Spalten</b></a>.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><ul><li> Der Dialog <b>Funktionen suchen</b>, der im Men&uuml; <b>Funktion</b> in bestimmten Dialogen (z. B. <a href="../../GettingStarted/OriginLab/Workbooks_Worksheets_Columns.html#Setting_Column_Values" title="OriginLab:Workbooks Worksheets Columns"><b>Werte setzen</b></a>) ge&ouml;ffnet wird, kann jetzt &uuml;ber das Men&uuml; <b>Hilfsmittel: Funktionen suchen</b> aufgerufen werden.</li></ul>
</td></tr></table>
<h3><a name="The_Status_Bar"></a><span class="mw-headline">Die Statusleiste</span></h3>
<p><a  class="image"><img alt="The Status Bar-1.png" src="../images/The_Origin_Interface/The_Status_Bar-1.png" width="777"  /></a><br /><br /></p><p>Der <span class="OIndex" style="display:none">Statusbalken</span> <b>Statusbalken</b> befindet sich am unteren Rand des Origin-Arbeitsbereichs. Er zeigt mehrere Parameter an, einschlie&szlig;lich:</p>
<ul><li> Hilfemeldungen und Hilfsmittelbeschreibungen, </li>
<li> Statistiken &uuml;ber die aktuelle Arbeitsmappen-, Matrix- oder Grafikauswahl, </li>
<li> ob die Analysefunktion <b>Automatisch aktualisieren</b> eingeschaltet ist, </li>
<li> ggf. den Namen des <b>Systemdesigns</b>, </li>
<li> zugeh&ouml;rige Informationen zum aktiven Fenster,</li>
<li> Winkeleinheiten (Radiant, Grad oder Gon),</li>
<li> Tooltipps f&uuml;r Funktionen, die im Men&uuml; <b>Werte setzen F(x)</b> aufgelistet sind.</li>
<li> <b>Benachrichtigungen von OriginLab</b>, dargestellt durch eine kleine rote Fahne rechts von der Statusleiste.<dl><dd><a  class="image"><img alt="The Status Bar-2.png" src="../images/The_Origin_Interface/The_Status_Bar-2.png" width="471"  /></a></dd></dl></li></ul>
<p><br /> <i><b>Daten der Statusleiste benutzerdefiniert anpassen und kopieren</b></i> <br /></p>
<ul><li> Sie k&ouml;nnen ausw&auml;hlen, was in der Statusleiste angezeigt wird, indem Sie mit der rechten Maustaste auf die Leiste klicken und dann die entsprechenden Elemente im Kontextmen&uuml; ausw&auml;hlen bzw. entfernen. </li>
<li> Kopieren Sie die angezeigten statistischen Werte, indem Sie im Kontextmen&uuml; <b>Statistik kopieren</b> ausw&auml;hlen. Die kopierten Daten werden durch Tabs zwischen Menge und Werten getrennt, wobei jedes Schl&uuml;sselwertpaar von einem CRLF-Trennzeichen getrennt wird.</li></ul>
<h3><a name="Smart_Hints_and_the_Smart_Hint_Log"></a><span class="mw-headline">Praktische Hinweise</span></h3>
<p><span class="OIndex" style="display:none">Hinweise, Software</span><span class="OIndex" style="display:none">Praktische Hinweise</span></p><p><b>Praktische Hinweise</b> werden durch Benutzeraktivit&auml;ten ausgel&ouml;st und sollen ihm bei seiner aktuellen Aufgabe Unterst&uuml;tzung bieten. Diese Hinweise k&ouml;nnen kurz in einem Dialog angezeigt werden, wie im folgenden Beispiel zu sehen. <br /></p>
<dl><dd><a  class="image"><img alt="Smart Hint1.png" src="../images/The_Origin_Interface/Smart_Hint1.png" width="540"  /></a></dd></dl>
<p><br /><br /> Alternativ k&ouml;nnen die Praktischen Hinweise auch in der untereren linken Ecke des Origin-Arbeitsbereichs abgebildet werden, wie dieses Beispiel zeigt. <br /></p>
<dl><dd><a  class="image"><img alt="Smart Hint2.png" src="../images/The_Origin_Interface/Smart_Hint2.png" width="290"  /></a></dd></dl>
<p><br /> Sobald Sie nicht mehr mit der Maus &uuml;ber den Hinweise fahren, wird er ausgeblendet. Sie k&ouml;nnen die Anzeige der einzelnen Praktischen Hinweise verhindern, indem Sie jeweils das Kontrollk&auml;stchen &quot;Diese Meldung nicht mehr anzeigen.&quot; unterhalb eines Hinweises aktivieren.</p><p>Diese Hinweise werden f&uuml;r die aktuelle Sitzung protokolliert und k&ouml;nnen durch Klicken auf die Registerkarte <b>Praktische Hinweise</b>, die sich am Rand des Origin-Arbeitsbereichs befindet, angezeigt und nachgelesen werden (Beachten Sie, dass Hinweise im Dialog nicht protokolliert werden). <br /></p>
<dl><dd><a  class="image"><img alt="Smart Hint3.png" src="../images/The_Origin_Interface/Smart_Hint3.png" width="326"  /></a></dd></dl>
<p><br /> <i><b>Um das Fenster des Meldungsprotokolls zu &ouml;ffnen (zu schlie&szlig;en):</b></i></p>
<ol><li> W&auml;hlen Sie im Origin-Men&uuml; <b>Ansicht: Praktische Hinweise</b> oder dr&uuml;cken Sie ALT+7.</li></ol>
<p>Klicken Sie mit der rechten Maustaste auf einen Hinweis im Protokoll der praktischen Hinweise und aktivieren Sie <b>Diesen Hinweis nicht mehr anzeigen</b> im Kontextmen&uuml;, um zu verhindern, dass dieser bestimmte praktische Hinweis erneut in der aktuellen Sitzung angezeigt wird. Sie werden gebeten zu best&auml;tigen, dass diese Meldung nicht mehr gezeigt bzw. protokolliert werden soll.</p><p>Um die Anzeige der Praktischen Hinweise in der Sitzung zu deaktivieren, &ouml;ffnen Sie das <b>Skriptfenster</b> und geben Sie Folgendes ein:</p>
<pre class="lt" style="font-family:monospace;">@SHS <span style="color: #000080;">=</span> <span style="color: #0000dd;">0</span>;</pre>
<p>Um die Anzeige der Praktischen Hinweise einzuschalten (einschlie&szlig;lich diejenigen, die einzeln verborgen wurden), geben Sie die Systemvariable @SHS = 1 ein und klicken Sie auf <b>Hilfe: Alle Hinweise reaktivieren</b>.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/The_Origin_Interface/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn Sie den Wert einer Systemvariablen mit Hilfe des Skriptfensters festlegen, &auml;ndern Sie das Verhalten Origins nur f&uuml;r die aktuelle Sitzung. Um den Wert einer Systemvariablen sitzungs&uuml;bergreifend festzulegen, lesen Sie bitte <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">diese FAQ</a>.</p></td></tr></table>
<h3><a name="Code_Builder"></a><span class="mw-headline">Code Builder</span></h3>
<p><span class="OIndex" style="display:none">Origin C, IDE</span> Die Integrierte Entwicklungsumgebung (IEU) wird als <b>Code Builder</b> bezeichnet. Der <span class="OIndex">Code Builder</span> stellt Hilfsmittel zum Schreiben, Kompilieren und Debuggen Ihrer Origin C-Funktionen bereit. Au&szlig;erdem kann er zum <a class="external text" href="../../Python/Python/Running_Python_Code.html#From_Code_Builder">Ausf&uuml;hren und Debuggen von Python-Code</a> verwendet werden.</p><p><i><b>Um den Code Builder zu &ouml;ffnen</b></i>:</p>
<ol><li> W&auml;hlen Sie im Origin-Men&uuml; <b>Ansicht: Code Builder</b> oder klicken Sie auf die Schaltfl&auml;che <b>Code Builder</b> <a  class="image"><img alt="Button Code Builder.png" src="../images/The_Origin_Interface/Button_Code_Builder.png" width="23"  /></a> auf der Standardsymbolleiste oder dr&uuml;cken Sie ALT+4. </li>
<li> Der Code Builder kann auch durch Klicken auf <b>Konnektivit&auml;t: untitled.py &ouml;ffnen</b> ge&ouml;ffnet werden. In diesem Modus k&ouml;nnen Sie den Python-Code durch Dr&uuml;cken von STRG + F5 einf&uuml;gen und ausf&uuml;hren.</li></ol>
<h3><a name="Messages_Log"></a><span class="mw-headline">Meldungsprotokoll</span></h3>
<p>Das Fenster <b><span class="OIndex">Meldungsprotokoll</span></b> zeigt Meldungen zu den Operationen, einschlie&szlig;lich Ausgabeinformationen, Ergebnissen und Fehlern. Es zeigt Meldungen an, die nicht zum <b>Skriptfenster</b> oder <b>Befehlsfenster</b> gesendet werden.</p><p><br /> <i><b>Um das Fenster des Meldungsprotokolls zu &ouml;ffnen (zu schlie&szlig;en):</b></i></p>
<ol><li> W&auml;hlen Sie im Origin-Men&uuml; <b>Ansicht: Meldungsprotokoll</b> oder dr&uuml;cken Sie ALT+6.</li></ol>
<p><br /> <i><b>Anklickbarer Link der Exportergebnisse</b></i></p><p>Exportdialoge (siehe Liste im Bild) f&uuml;gen einen mit Datums-/Zeitstempel versehenen anklickbaren Link zum Meldungsprotokoll hinzu. Klicken Sie auf den Link, um die Datei mit der Standardanwendung (z. B. Notepad f&uuml;r *.dat) zu &ouml;ffnen.</p>
<dl><dd><dl><dd><a  class="image"><img alt="UG Message Log Link.png" src="../images/The_Origin_Interface/UG_Message_Log_Link.png" width="565"  /></a></dd></dl></dd></dl>
<ul><li> Um den Dateispeicherort im Windows Explorer zu &ouml;ffnen, ohne die Datei zu &ouml;ffnen, klicken Sie mit der rechten Maustaste auf einen Link und w&auml;hlen Sie <b>Speicherort der Datei &ouml;ffnen</b> oder dr&uuml;cken Sie die Strg-Taste, w&auml;hrend Sie auf den Link klicken.</li>
<li> Zwei Systemvariablen werden hinzugef&uuml;gt, um das Verhalten des Links f&uuml;r den Bildexport zu steuern. Weitere Informationen finden Sie unter <a href="../../GettingStarted/OriginLab/Publishing_and_Export.html#Exporting_Graphs_and_Layout_Pages_to_an_Image_File" title="OriginLab:Publishing and Export">Diagramme und Layoutseiten in eine Bilddatei exportieren</a>.</li></ul>
<h3><a name="Results_Log"></a><span class="mw-headline">Ergebnisfenster</span></h3>
<p>Origin schreibt die meisten Analyse- und Anpassungsergebnisse automatisch in das <b><span class="OIndex">Ergebnisfenster</span></b>. Jeder Eintrag im Ergebnisfenster enth&auml;lt eine Datums-/Zeitangabe, den Namen des Fensters, eine Zahlenangabe, die dem Julianischen Tag entspricht (siehe <i>Datenangaben</i> unten), dem verwendeten Analysetyp und den Ergebnissen.</p><p>In den meisten F&auml;llen &ouml;ffnet sich das <b>Ergebnisfenster</b> automatisch, sobald Ergebnisse dort hineingeschrieben werden. Sie k&ouml;nnen das Ergebnisfenster manuell &ouml;ffnen (oder schlie&szlig;en), indem Sie einem der folgenden Schritte folgen:</p>
<ol><li> Klicken Sie auf die Schaltfl&auml;che <b>Ergebnisfenster</b> <a  class="image"><img alt="Button Results Log.png" src="../images/The_Origin_Interface/Button_Results_Log.png" width="23"  /></a> in der Symbolleiste Standard. W&auml;hlen Sie im Origin-Men&uuml; <b>Ansicht: Ergebnisse</b> oder dr&uuml;cken Sie ALT+2. </li></ol>
<p><br />Wenn Sie mit der rechten Maustaste in das Ergebnisfenster klicken, wird ein Kontextmen&uuml; mit Befehlen zum <b>Kopieren</b>, <b>Drucken</b>, <b>Entfernen</b> und zum <b>Anzeigen von Ergebnissen</b> ge&ouml;ffnet.</p>
<h3><a name="Float.2C_Dock_and_Auto-Hide_Windows"></a><span class="mw-headline">Fenster frei bewegen, andocken und automatisch im Hintergrund verbergen</span></h3>
<p><span class="OIndex" style="display:none">Fenster, andocken/frei bewegen/automatisch verbergen</span> Es gibt mehrere Origin-Fenster, die entweder frei bewegt, angedockt oder automatisch im Hintergrund verborgen oder einfach verborgen werden k&ouml;nnen. Diese Fenster umfassen den <b>Projekt Explorer</b>, die <b>Ergebnisse</b>, das <b>Befehlsfenster</b> und das <b>Meldungsprotokoll</b>. Dies erm&ouml;glicht Ihnen, Ihren Origin-Arbeitsbereich auf eine Weise anzupassen, dass der Arbeitsbereich maximal effizient genutzt und Bildschirmplatz gespart wird.</p>
<h2><a name="Numbers_in_Origin"></a><span class="mw-headline">Zahlen in Origin</span></h2>
<p><span class="OIndex" style="display:none">Zahlen in Origin</span></p>
<ul><li> <b>Angezeigter vs. tats&auml;chlicher Zellenwert</b>: Wenn Sie Ihre Daten in eine Arbeitsmappe oder Matrixmappe importieren oder eingeben, verwendet Origin eine Kombination von benutzerdefinierten Einstellungen, um die Anzeige der Daten in jeder Zelle zu bestimmen. Die Anzeige ist eine visuelle Darstellung des Datenwerts. Die tats&auml;chlichen Datenwerte werden mit der vollst&auml;ndigen Genauigkeit, die von dem Datentyp des Datensatzes zugelassen wird (siehe Tabelle unten), gespeichert. Wenn Sie Berechnungen durchf&uuml;hren, werden die tats&auml;chlichen Datenwerte verwendet und nicht die angezeigten.</li>
<li> <b>Wenn Inhalt Zellenbreite &uuml;berschreitet</b>: Vor 2020b, wenn die Zeichenabfolge in einer Blattzelle die Menge &uuml;berschritten hat, die in der aktuellen Zellenbreite (Spaltenbreite) angezeigt werden konnte, zeigte Origin den Inhalt als eine Reihe von Rautezeichen an (<b>######</b>). Dies hat sich ge&auml;ndert in Anlehnung an das Arbeitsblattverhalten von MS Excel:</li></ul>
<dl><dd><ul><li> Textzeichenketten zeigen nun keine Rautezeichen <b>######</b> mehr an, unabh&auml;ngig von der Spaltenbreite. Um die vollst&auml;ndige Zeichenkette anzuzeigen, m&uuml;ssen Sie die Spaltenbreite vergr&ouml;&szlig;ern.</li>
<li> Numerische Werte, die die Spaltenbreite &uuml;berschreiten, werden zuerst auf die n&auml;chstliegende Dezimalstelle gerundet und, nur wenn dies nicht ausreicht, um die volle ganze Zahl anzuzeigen, werden Rautezeichen <b>######</b> anstelle vom numerischen Wert angezeigt.</li>
<li> Dieses Runden der numerischen Werte hat nur Einfluss auf den angezeigten Wert. Der intern gespeicherte Wert &auml;ndert sich nicht.</li>
<li> Um das alte Verhalten wiederherzustellen, bei die Rautezeichen <b>######</b> angezeigt wurde, wenn der Zelleninhalt nicht vollst&auml;ndig angezeigt werden konnte, setzen Sie die Systemvariable <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#U.2CV.2CW"><b>@WPE = 1</b></a>. Eine Anleitung, wie Sie den Wert einer Systemvariablen &auml;ndern, finden Sie in <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_permanently_change_the_value_of_a_system_variable.html">dieser FAQ</a>.</li></ul></dd></dl>
<ul><li> <b>Fehlende Werte in dem Arbeitsblatt</b>: Als Tabellenkalkulationsprogramme zum ersten Mal aufkamen, konnte man bald feststellen, dass eine spezielle Zahl erforderlich war, die &quot;Nicht-eine-Zahl&quot; war und - wenn sie in einer Berechnung verwendet wurde - sich selbst erzeugte. Origin verf&uuml;gt &uuml;ber so eine Zahl und ihr interner Wert ist:<i>-1.23456789E-300</i>. Da Origin diesen Wert als einen speziellen Wert erkannte, kann er verwendet werden, um einen fehlenden Wert in einem Arbeitsblatt (oder einer Matrix) einzugeben, und er kann in Berechnungen oder Skripten eingesetzt werden (zum Beispiel f&uuml;r die R&uuml;ckgabe eines fehlenden Werts, es sei denn eine Bedingung wird erf&uuml;llt). Origin zeigt fehlende Werte in einem Arbeitsblatt oder Matrixblatt mit &quot;--&quot; an. Sie sollten diese Anzeige (Ausgabe) jedoch nicht damit verwechseln, was Sie selbst als fehlenden Wert eingeben (Eingabe).</li>
<li> <b>Dezimale, wissenschaftliche und technische Schreibweise</b>: Sie k&ouml;nnen w&auml;hlen, mit welcher Schreibweise Daten in der Arbeitsmappe bzw. Matrixmappe angezeigt werden soll: <b>Dezimal:1000</b>, <b>Wissenschaftlich: 1E3</b>, <b>Technisch (Ingenieur): 1k</b> und <b>Dezimal:1.000</b>. Sie k&ouml;nnen manuell eine dieser Optionen f&uuml;r die Datenanzeige w&auml;hlen. Es ist au&szlig;erdem m&ouml;glich, dass Sie Schwellenwerte f&uuml;r die automatische Anzeige der wissenschaftlichen Schreibweise vordefinieren. Standardm&auml;&szlig;ig werden diese Schwellenwerte der wissenschaftlichen Schreibweise auf <b>6</b> (oberer Wert) und <b>-3</b> (unterer Wert) gesetzt.</li>
<li> <b>Daten und Zeiten in Origin</b>: Origins mathematisches Langzeitsystem f&uuml;r Datums- und Zeitangaben basiert auf den astronomischen Julianischen Tageszahlen mit einem 12-Stunden-Versatz. Dieses System definiert den 1. Januar &ndash;4712,  (1. Januar 4713 v. u. Z.), 12 Uhr mitteleurop&auml;ische Greenwich-Zeit als Null. Seit Kurzem wurden zwei alternative Zeitsysteme hinzugef&uuml;gt: (1) einen wahren Julianischen Datumswert (0 ist Mittag anstatt die folgende Mitternacht) und (2) ein &quot;2018&quot;-System, in dem 0 als 00:00 am 1. Januar 2018 definiert wird. Das 2018-System unterst&uuml;tzt eine gr&ouml;&szlig;ere Pr&auml;zision, wenn z. B. Daten mit dem Importassistenten importiert werden (z. B. unterst&uuml;tzt <b>Benutzerdefiniertes Datumsformat</b> &quot;MM&apos;/&apos;dd&apos;/&apos;yyyy HH&apos;:&apos;mm&apos;:&apos;ss&apos;.&apos;######&quot;). Zuvor war die Pr&auml;zision auf 0,0001 Sekunden beschr&auml;nkt. Weitere Informationen finden Sie unter <a class="external text" href="../../UserGuide/UserGuide/Dates_and_Times_in_Origin.html"><b>Daten und Zeiten in Origin</b></a>.</li></ul>
<table class="note">

<tr>
<td><b>Hinweis:</b> Weitere Informationen zu Zahlen finden Sie unter:<p><b>Hilfe: Origin: Origin-Hilfe &gt; Grundlagen von Origin &gt; Elemente des Origin-Arbeitsbereichs &gt; <a class="external text" href="../../UserGuide/UserGuide/Numbers_in_Origin.html">Zahlen in Origin</a></b></p>
</td></tr></table>
<p><br /> Origin-Arbeitsmappen und -Matrixmappen unterst&uuml;tzen die folgenden <b>Datentypen</b>:</p>
<table class="simple">

<tr>
<th>Arbeitsmappe</th>
<th>Matrixmappe</th>
<th>Bytes</th>
<th>Wertebereich</th></tr>
<tr>
<td>
<p>double</p>
</td>
<td>
<p>double</p>
</td>
<td>
<p>8</p>
</td>
<td>
<p>±1,7E±308 (15 Stellen)</p>
</td></tr>
<tr>
<td>
<p>real</p>
</td>
<td>
<p>float</p>
</td>
<td>
<p>4</p>
</td>
<td>
<p>±3,4E±38 (7 Stellen)</p>
</td></tr>
<tr>
<td>
<p>short</p>
</td>
<td>
<p>short</p>
</td>
<td>
<p>2</p>
</td>
<td>
<p>-32.768 bis 32.767</p>
</td></tr>
<tr>
<td>
<p>long</p>
</td>
<td>
<p>int</p>
</td>
<td>
<p>4</p>
</td>
<td>
<p>-2.147.483.648 bis 2.147.483.647</p>
</td></tr>
<tr>
<td>
<p>char</p>
</td>
<td>
<p>char</p>
</td>
<td>
<p>1</p>
</td>
<td>
<p>-128 bis 127</p>
</td></tr>
<tr>
<td>
<p>Byte</p>
</td>
<td>
<p>char, ohne Vorzeichen</p>
</td>
<td>
<p>1</p>
</td>
<td>
<p>0 bis 255</p>
</td></tr>
<tr>
<td>
<p>ushort</p>
</td>
<td>
<p>kurz, ohne Vorzeichen</p>
</td>
<td>
<p>2</p>
</td>
<td>
<p>0 bis 65.535</p>
</td></tr>
<tr>
<td>
<p>ulong</p>
</td>
<td>
<p>int, ohne Vorzeichen</p>
</td>
<td>
<p>4</p>
</td>
<td>
<p>0 bis 4.294.967.295</p>
</td></tr>
<tr>
<td>
<p>complex</p>
</td>
<td>
<p>complex</p>
</td>
<td>
<p>16</p>
</td>
<td>
<p>±1,7E±308 (15 Stellen), alle 8 Bytes</p>
</td></tr></table>
<h2><a name="Topics_for_Further_Reading"></a><span class="mw-headline">Weiterf&uuml;hrende Themen</span></h2>
<ul><li> <a class="external text" href="../../UserGuide/UserGuide/Project_Explorer.html">Projekt Explorer</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Customizing_Toolbars.html">Symbolleisten benutzerdefiniert anpassen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Popup_Button.html">Minisymbolleisten</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Object_Manager.html">Die Objektverwaltung</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Finding_in_Origin_Project.html">Daten in Ihrem Origin-Projekt suchen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Basic_Child_Window_Operations.html">Grundlegende Operationen der Unterfenster</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Numbers_in_Origin.html">Zahlen in Origin</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/Dates_and_Times_in_Origin.html">Datums- und Zeitangaben in Origin</a></li>
<li> <a class="external text" href="../../QuickHelp/QuickHelp/How_do_I_customize_the_collapsible_menu.html">FAQ: Wie schalte ich die minimierbaren Men&uuml;s aus und zeige die vollst&auml;ndigen Men&uuml;s an?</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Customizing_Toolbars.html">Symbolleisten benutzerdefiniert anpassen</a></li>
<li> <a class="external text" href="../../UserGuide/Category/Setting_Your_Preferences_with_the_Options_Dialogue_Box.html">Ihre Voreinstellungen festlegen</a></li>
<li> <a class="external text" href="../../UserGuide/UserGuide/The_(Options)_Numeric_Format_Tab.html">Die Registerkarte Zahlenformat (Einstellungen: Optionen)</a></li></ul>



    