<h1 class="firstHeading">Dialog Achsen f&uuml;r Polardiagramme</h1><p class='urlname' style='display: none'>polar-axis-dlg</p>
<p><br /></p><p>Origins Polardiagramme k&ouml;nnen sowohl &quot;Winkel-&quot; als auch &quot;Radial&quot;achsen anzeigen. Es gibt zwei Arten von Winkelachsen, innere und &auml;u&szlig;ere. Sie k&ouml;nnen aus- oder eingeblendet werden und genauso wie eine konventionelle kartesische Achse benutzerdefiniert angepasst werden. Radialachsen k&ouml;nnen innerhalb oder au&szlig;erhalb der Zeichnung gezeigt werden. Radialachsen sind ebenfalls vollst&auml;ndig benutzerdefiniert anpassbar. Achsenanpassungen werden im Dialog Achsen der Polardiagramme festgelegt. Das Bild oben zeigt einen Dialog <b>Achsen</b>, der Bedienelemente f&uuml;r mehrere innere und &auml;u&szlig;ere Radialachsen anzeigt (z.B. <i>Innere Achse 1</i>, <i>&Auml;u&szlig;ere Achse 2</i>). Das Diagramm unten stellt die Typen und Positionen von Origins polaren Diagrammachsen und Gitternetzen dar.</p>
<table class="noborder">

<tr>
<td align="center"> <a  class="image"><img alt="Polar Axis Dialog 2.png" src="../images/Axes_Dialog_for_Polar_Graph/Polar_Axis_Dialog_2.png" width="665"  /></a></td></tr>
<tr>
<td align="center"> <b>Dialog Achsen f&uuml;r Polardiagramme</b></td></tr>
<tr>
<td align="center"> <a  class="image"><img alt="Polar Axes Example 2.png" src="../images/Axes_Dialog_for_Polar_Graph/Polar_Axes_Example_2.png" width="629"  /></a></td></tr>
<tr>
<td align="center"> <b>Terminologie der Achsen in Polardiagrammen</b></td></tr>
</table>
<p>Der Dialog <b>Achsen</b> ist ein auf Registerkarten basierender Dialog mit Bedienelementen zum benutzerdefinierten Anpassen der Achsen in Polardiagrammen. In diesem Dialog gibt es 7 Registerkarten, um die verschiedenen Attribute einer Achse separat festzulegen. Um diesen Dialog schnell zu nutzen, w&auml;hlen Sie zuerst ein oder mehrere Symbole (halten Sie die <b>Strg</b>-Taste gedr&uuml;ckt, um mehrere Symbole zu markieren) im linken Bedienfeld aus. Diese/s Symbol/e kennzeichnet/n die anzupassende/n Achse/n. W&auml;hlen Sie dann im rechten Bedienfeld eine Registerkarte und verwenden Sie die Bedienelemente, um die Achseneigenschaften benutzerdefiniert anzupassen.</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Angular_Axes"><span class="tocnumber">1</span> <span class="toctext">Winkelachsen</span></a><ul>
<li class="toclevel-2 tocsection-2"><a href="#Show"><span class="tocnumber">1.1</span> <span class="toctext">Zeigen</span></a></li>
<li class="toclevel-2 tocsection-3"><a href="#Scale"><span class="tocnumber">1,2</span> <span class="toctext">Skalierung</span></a></li>
<li class="toclevel-2 tocsection-4"><a href="#Tick_Labels"><span class="tocnumber">1.3</span> <span class="toctext">Beschriftungen der Hilfsstriche</span></a><ul>
<li class="toclevel-3 tocsection-5"><a href="#Display"><span class="tocnumber">1.3.1</span> <span class="toctext">Anzeige</span></a></li>
<li class="toclevel-3 tocsection-6"><a href="#Format"><span class="tocnumber">1.3.2</span> <span class="toctext">Format</span></a></li>
<li class="toclevel-3 tocsection-7"><a href="#Minor_Tick_Labels"><span class="tocnumber">1.3.3</span> <span class="toctext">Beschriftung der kleinen Hilfsstriche</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-8"><a href="#Title"><span class="tocnumber">1.4</span> <span class="toctext">Titel</span></a></li>
<li class="toclevel-2 tocsection-9"><a href="#Grids"><span class="tocnumber">1.5</span> <span class="toctext">Gitternetze</span></a></li>
<li class="toclevel-2 tocsection-10"><a href="#Line_and_Ticks"><span class="tocnumber">1.6</span> <span class="toctext">Linie und Hilfsstriche</span></a></li>
<li class="toclevel-2 tocsection-11"><a href="#Reference_Lines"><span class="tocnumber">1.7</span> <span class="toctext">Referenzlinien</span></a></li>
<li class="toclevel-2 tocsection-12"><a href="#Special_Ticks_.28Outer_and_Inner.29"><span class="tocnumber">1.8</span> <span class="toctext">Spezielle Hilfsstriche (Au&szlig;en und Innen)</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-13"><a href="#Radial_Axes"><span class="tocnumber">2</span> <span class="toctext">Radialachsen</span></a><ul>
<li class="toclevel-2 tocsection-14"><a href="#Radial_Axes_Configuration_Dialog"><span class="tocnumber">2.1</span> <span class="toctext">Dialog der Konfiguration der Radialachsen</span></a><ul>
<li class="toclevel-3 tocsection-15"><a href="#Axes_Inside_Polar"><span class="tocnumber">2.1.1</span> <span class="toctext">Achsen innerhalb Polar</span></a></li>
<li class="toclevel-3 tocsection-16"><a href="#Axes_Outside_Polar"><span class="tocnumber">2.1.2</span> <span class="toctext">Achsen au&szlig;erhalb Polar</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-17"><a href="#Show_2"><span class="tocnumber">2.2</span> <span class="toctext">Zeigen</span></a></li>
<li class="toclevel-2 tocsection-18"><a href="#Scale_2"><span class="tocnumber">2,3</span> <span class="toctext">Skalierung</span></a></li>
<li class="toclevel-2 tocsection-19"><a href="#Tick_Labels_2"><span class="tocnumber">2.4</span> <span class="toctext">Beschriftungen der Hilfsstriche</span></a></li>
<li class="toclevel-2 tocsection-20"><a href="#Title_2"><span class="tocnumber">2.5</span> <span class="toctext">Titel</span></a></li>
<li class="toclevel-2 tocsection-21"><a href="#Grids_2"><span class="tocnumber">2.6</span> <span class="toctext">Gitternetze</span></a></li>
<li class="toclevel-2 tocsection-22"><a href="#Line_and_Ticks_.28Inner_and_Outer.29"><span class="tocnumber">2.7</span> <span class="toctext">Linie und Hilfsstriche (Innen und Au&szlig;en)</span></a></li>
<li class="toclevel-2 tocsection-23"><a href="#Reference_Lines_2"><span class="tocnumber">2.8</span> <span class="toctext">Referenzlinien</span></a></li>
<li class="toclevel-2 tocsection-24"><a href="#Special_Ticks_.28Inner_and_Outer.29"><span class="tocnumber">2.9</span> <span class="toctext">Spezielle Hilfsstriche (Innen und Au&szlig;en)</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-25"><a href="#Crop"><span class="tocnumber">3</span> <span class="toctext">Beschneiden</span></a></li>
<li class="toclevel-1 tocsection-26"><a href="#Apply_to_Others"><span class="tocnumber">4</span> <span class="toctext">Auf andere anwenden</span></a></li>
</ul>
</div>

<h2><a name="Angular_Axes"></a><span class="mw-headline">Winkelachsen</span></h2>
<p>Die Winkelachsen sind die Achsen f&uuml;r die <img src="../images/Axes_Dialog_for_Polar_Graph/math-2554a2bb846cffd697389e5dc8912759.png" title="\theta" alt="\theta" class="tex"/>-Werte. Sie werden als ein Kreis (oder Teil eines Kreises) gezeigt. Es kann &auml;u&szlig;ere und innere Winkelachsen geben. Die Anfangspositionen der inneren/&auml;u&szlig;eren Winkelachsen befinden sich jeweils bei den Werten <b>Von</b>/<b>Bis</b> der <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Scale_2" title="UserGuide:Axes Dialog for Polar Graph">Radialachsen</a>.</p>
<h3><a name="Show"></a><span class="mw-headline">Zeigen</span></h3>
<table class="dialogcontroltable">

<tr>
<th>Gleiche Optionen f&uuml;r &Auml;u&szlig;ere-Achse und Inneres-Achse verwenden</th>
<td>Legen Sie fest, ob die gleichen Einstellungen f&uuml;r die &auml;u&szlig;eren und inneren Winkelachsen verwendet werden sollen.</td></tr>
<tr>
<th>Zeigen</th>
<td>Legen Sie fest, ob die ausgew&auml;hlte Winkelachse gezeigt wird.</td></tr>
<tr>
<th>Ausrichtung</th>
<td>Bestimmen Sie die Richtung und den Anfangswert der Achse f&uuml;r die gezeigten Winkelachsen.<ul><li><b>Richtung</b><dl><dd>Bestimmen Sie die Richtung der Winkelachsen. Die Optionen sind <b>Im Uhrzeigersinn</b> oder <b>Gegen den Uhrzeigersinn</b>.</dd></dl></li>
<li><b>Drehen (Grad)</b><dl><dd>Bestimmen Sie den Drehwinkel der Winkelachsen. Dabei muss es sich um eine ganze Zahl zwischen 0 und 360 handeln. Wenn es 0 ist, befindet sich die Anfangsposition der Achse auf 3 Uhr; wenn es sich um einen anderen Wert als 0 handelt, wird die Position des Achsenanfangs von dem definierten Winkelwert bestimmt, der gegen den Uhrzeigersinn gedreht wird.</dd></dl></li></ul>
</td></tr>
</table>
<p><br /></p>
<h3><a name="Scale"></a><span class="mw-headline">Skalieren</span></h3>
<p>Diese Registerkarte steuert den Achsenbereich und das Inkrement. Die meisten Bedienelemente sind identisch zu denen auf der <a href="../../UserGuide/UserGuide/Scale_2.html" title="UserGuide:Scale 2">Registerkarte <b>Skalierung</b></a> im allgemeinen Dialog der 2D-Achsen; nur der Baumknoten <b>Definition der Einheiten</b> ist einzigartig f&uuml;r den Dialog der Polarachsen.</p>
<table class="dialogcontroltable">

<tr>
<th>Einheiten</th>
<td>Legen Sie die Einheiten der Winkelachsen fest, die gezeigt werden.<ul><li><b>Grad</b><dl><dd>Grad wird als die Einheit der Winkelachsen verwendet. Der Anfangs- und Endwert ist 0 bzw. 360.</dd></dl></li>
<li><b>Radianten</b><dl><dd>Radiant wird als die Einheit der Winkelachsen verwendet. Der Anfangs- und Endwert ist 0 Pi bzw. 2 Pi.</dd></dl></li>
<li><b>Gon</b><dl><dd>Gon wird als die Einheit der Winkelachsen verwendet. Der Anfangs- und Endwert ist 0 bzw. 400.</dd></dl></li>
<li><b>Benutzerdefiniert</b><dl><dd>Es werden benutzerdefinierte Anfangs- und Endwerte der Einheit verwendet. </dd></dl></li></ul>
</td></tr>
<tr>
<th>Anfangswert des Kreises</th>
<td>Diese Option ist nur verf&uuml;gbar, wenn <b>Benutzerdefiniert</b> f&uuml;r <b>Einheiten</b> gew&auml;hlt ist. Sie wird verwendet, um den Anfangswert der benutzerdefinierten Einheit festzulegen. Der Wert wird als &auml;quivalent zu 0 Grad betrachtet, wenn die Einheit konvertiert wird.</td></tr>
<tr>
<th>Endwert des Kreises</th>
<td>Diese Option ist nur verf&uuml;gbar, wenn <b>Benutzerdefiniert</b> f&uuml;r <b>Einheiten</b> gew&auml;hlt ist. Sie wird verwendet, um den Endwert der benutzerdefinierten Einheit festzulegen. Der Wert wird als &auml;quivalent zu 360 Grad betrachtet, wenn die Einheit konvertiert wird.</td></tr>
</table>
<p>Einzelheiten zu den anderen Bedienelemente auf dieser Seite finden Sie in der Hilfe auf der <a href="../../UserGuide/UserGuide/Scale_2.html" title="UserGuide:Scale 2">Seite Skalierung</a> im Dialog der allgemeinen 2D/3D-Achsen.</p>
<table class="note">

<tr>
<td><b>Hinweise:</b> Wenn der benutzerdefinierte Achsenbereich  (d.h. der Abstand zwischen den Werten <b>Von</b> und <b>Bis</b>) gleich einem Abschnitt der ausgew&auml;hlten <b>Einheit</b> ist oder ihn &uuml;berschreitet (d.h. der Abstand zwischen dem <b>Anfangswert des Kreises</b> und dem <b>Endwert des Kreises</b>), wird der Achsenbereich automatisch auf die Standardeinstellung des vollen Abschnitts zur&uuml;ckgesetzt. Wenn der absolute Wert den Wert von entweder <b>Von</b> oder <b>Bis</b> den gr&ouml;&szlig;eren der absoluten Werte von <b>Anfangswert des Kreises</b> und <b>Endwert des Kreises</b> &uuml;berschreitet, dann wird der Achsenbereich so angepasst, dass er zwischen dem Negativen von <b>Anfangswert des Kreises</b> und <b>Endwert des Kreises</b> liegt.</td></tr></table>
<p><br /></p>
<h3><a name="Tick_Labels"></a><span class="mw-headline">Beschriftungen der Hilfsstriche</span></h3>
<p>Sie k&ouml;nnen die Beschriftung der Hilfsstriche f&uuml;r die &auml;u&szlig;ere Winkelachse auf dieser Registerkarte benutzerdefiniert anpassen.</p>
<table class="dialogcontroltable">

<tr>
<th>Zeigen</th>
<td>Legen Sie fest, ob die Beschriftung der Hilfsstriche auf der ausgew&auml;hlten Winkelachse gezeigt werden.</td></tr>
<tr>
<th>Gleiche Optionen f&uuml;r Innen und Au&szlig;en verwenden</th>
<td>Legen Sie fest, ob die gleichen Einstellungen f&uuml;r die Beschriftung der Hilfsstriche der &auml;u&szlig;eren und inneren Winkelachsen verwendet werden sollen.</td></tr></table>
<h4><a name="Display"></a><span class="mw-headline">Anzeige</span></h4>
<p>Die untergeordnete Registerkarte <b>Anzeige</b> enth&auml;lt die Bedienelemente f&uuml;r die Anzeige der Hilfsstrichsbeschriftung. Die meisten der Bedienelemente entsprechen denen im Dialog der allgemeinen 2D-Achsen. Einige Optionen sind speziell f&uuml;r polare Winkelachsen.</p>
<table class="dialogcontroltable">

<tr>
<th>Geben Sie</th>
<td>Diese Option bestimmt den Anzeigetyp der Hilfsstrichsbeschriftung. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Type" title="UserGuide:Tick Labels 2">Referenz f&uuml;r die Auswahlliste <b>Typ</b></a>.</td></tr>
<tr>
<th>Anzeige</th>
<td>Diese Option ist <font color="red">NICHT</font> verf&uuml;gbar, wenn der <b>Typ</b> auf <b>Text aus Datensatz</b>, <b>Datensatz mit indizierten Hilfsstrichen</b> oder <b>Kategorie</b> gesetzt ist.<p>Das Anzeigeformat der Hilfsstrichsbeschriftung wird bestimmt. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Display" title="UserGuide:Tick Labels 2">Referenz f&uuml;r die Auswahlliste <b>Anzeige</b></a>.</p>
</td></tr>
<tr>
<th>Datensatzname</th>
<td>Diese Option ist nur<b> </b>verf&uuml;gbar, wenn der <b>Typ</b> auf <b>Text aus Datensatz</b>, Datensatz mit indizierten Hilfsstrichen oder <b>Kategorie</b> gesetzt ist.<p>Der f&uuml;r die Hilfsstrichsbeschriftung verwendete Datensatz wird bestimmt. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Dataset_Name" title="UserGuide:Tick Labels 2">Referenz f&uuml;r die Auswahlliste <b>Datensatzname</b></a>.</p>
</td></tr>
<tr>
<th>Dezimalstellen festlegen</th>
<td>Diese Option ist nur dann verf&uuml;gbar, wenn der <b>Typ</b> auf <b>Numerisch</b> gesetzt ist.<p>Sie steuert, ob die Dezimalstellen der Hilfsstrichsbeschriftung gesetzt werden.</p>
</td></tr>
<tr>
<th>Dezimalstellen</th>
<td>Diese Option ist nur verf&uuml;gbar, wenn das Kontrollk&auml;stchen <b>Dezimalstellen festlegen</b> aktiviert ist und wenn der <b>Typ</b> auf <b>Numerisch</b> gesetzt ist.</td></tr>
<tr>
<th>Negative Beschriftungen als positive zeigen</th>
<td>Dieses Kontrollk&auml;stchen ist nur verf&uuml;gbar, wenn der <b>Typ</b> auf <b>Numerisch</b> gesetzt ist.<p>Sie k&ouml;nnen festlegen, ob Hilfsstrichsbeschriftung(en) mit negativen Werten in positive Werte umgewandelt werden soll(en).</p>
</td></tr>
<tr>
<th>Beschriftungsformat</th>
<td>Diese Option bestimmt die Anzeigeeinheit f&uuml;r die Beschriftung der Hilfsstriche.<ul><li><b>Auto</b><dl><dd>Die Einheit der Hilfsstrichsbeschriftung ist die gleiche wie die <b>Einheit</b>, die auf der <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Scale" title="UserGuide:Axes Dialog for Polar Graph">Seite <b>Skalierung</b></a> gew&auml;hlt wurde.</dd></dl></li>
<li><b>Grad</b><dl><dd>Die Einheit der Hilfsstrichsbeschriftung ist Grad.</dd></dl></li>
<li><b>Radianten</b><dl><dd>Die Einheit der Hilfsstrichsbeschriftung ist Radiant.</dd></dl></li>
<li><b>Gon</b><dl><dd>Die Einheit der Hilfsstrichsbeschriftung ist Gon.</dd></dl></li></ul>
</td></tr>
<tr>
<th>Teilungsfaktor</th>
<td>Dies ist ein allgemeines Bedienelement f&uuml;r den Dialog 2D-Achsen. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Divide_by_Factor" title="UserGuide:Tick Labels 2">Hilfe</a>.</td></tr>
<tr>
<th>Formel</th>
<td>Dies ist ein allgemeines Bedienelement f&uuml;r den Dialog 2D-Achsen. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Formula" title="UserGuide:Tick Labels 2">Hilfe</a>.</td></tr>
<tr>
<th>Pr&auml;fix</th>
<td>Dies ist ein allgemeines Bedienelement f&uuml;r den Dialog 2D-Achsen. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Prefix" title="UserGuide:Tick Labels 2">Hilfe</a>.</td></tr>
<tr>
<th>Suffix</th>
<td>Dies ist ein allgemeines Bedienelement f&uuml;r den Dialog 2D-Achsen. Einzelheiten finden Sie in der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Suffix" title="UserGuide:Tick Labels 2">Hilfe</a>.</td></tr>
</table>
<h4><a name="Format"></a><span class="mw-headline">Format</span></h4>
<p>Die Registerkarte <b>Format</b> enth&auml;lt Bedienelemente f&uuml;r das Format der Hilfsstrichsbeschriftung. Die Bedienelemente sind im Allgemeinen die gleichen wie auf der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Format_Tab" title="UserGuide:Tick Labels 2">Registerkarte <b>Format</b></a> im allgemeinen Dialog der 2D-Achsen mit Ausnahme der Option <b>Umbruch im Text</b>.</p>
<h4><a name="Minor_Tick_Labels"></a><span class="mw-headline">Beschriftung kleiner Hilfsstriche</span></h4>
<p>Die Registerkarte <b>Beschriftung der kleinen Hilfsstriche</b> enth&auml;lt Optionen, mit denen die Beschriftungen der kleinen Hilfsstriche speziell angepasst werden k&ouml;nnen. Die Bedienelemente &auml;hneln denen der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Minor_Tick_Labels_Tab" title="UserGuide:Tick Labels 2">Registerkarte <b>Beschriftung der kleinen Hilfsstriche</b></a> im allgemeinen Dialog der 2D-Achsen.</p><p><br /></p>
<h3><a name="Title"></a><span class="mw-headline">Titel</span></h3>
<p>Diese Registerkarte wird verwendet, um den Titel der Winkelachse festzulegen.</p><p>Das Kontrollk&auml;stchen <b>Zeigen</b> wird verwendet, um festzulegen, ob ein Titel f&uuml;r die spezifische Winkelachse angezeigt werden soll.</p><p>Die anderen Bedienelemente sind im Allgemeinen identisch zu denen der <a href="../../UserGuide/UserGuide/Title_2.html" title="UserGuide:Title 2">Seite <b>Titel</b></a> des allgemeinen Dialogs 2D-Achsen.</p><p><br /></p>
<h3><a name="Grids"></a><span class="mw-headline">Gitternetze</span></h3>
<p>Diese Registerkarte bietet Optionen zum benutzerdefinierten Anpassen der Gitternetzlinien der Winkelachsen, d.h. die Gitternetzlinien, die vom Ursprung aus nach au&szlig;en gehen.</p><p>Die Zweige <b>Hauptgitternetzlinien</b> und <b>Nebengitternetzlinien</b> k&ouml;nnen verwendet werden, um die Gitternetzlinien f&uuml;r die <a href="../../UserGuide/UserGuide/Scale_2.html#Major_Ticks" title="UserGuide:Scale 2">gro&szlig;en Hilfsstriche</a> und <a href="../../UserGuide/UserGuide/Scale_2.html#Minor_Ticks" title="UserGuide:Scale 2">kleinen Hilfsstriche</a> festzulegen. Die meisten Bedienelemente entsprechen denen im <a href="../../UserGuide/UserGuide/Grids_2.html#Major.2FMinor_Grid_Lines" title="UserGuide:Grids 2">Zweig <b>Hauptgitternetzlinien</b></a> im allgemeinen Dialog der 2D-Achsen.</p><p><br /> Die Baumnoten <b>Zus&auml;tzliche Linien</b> k&ouml;nnen verwendet werden, um die gegen&uuml;berliegende Linie und die Linie bei einem festgelegten Winkelachsenwert anzuzeigen.</p>
<table class="dialogcontroltable">

<tr>
<th> Gegen&uuml;ber</th>
<td>  Legen Sie fest, ob die gegen&uuml;berliegende Linie auf der Position der inneren Winkelachse angezeigt wird.</td></tr>
<tr>
<th> Y =</th>
<td> Aktivieren Sie das Kontrollk&auml;stchen <b>Y=</b>, um einen Wert in das Feld einzugeben und eine Linie bei dem festgelegten Winkelachsenwert hinzuzuf&uuml;gen.</td></tr></table>
<p><br /></p>
<h3><a name="Line_and_Ticks"></a><span class="mw-headline">Linie und Hilfsstriche</span></h3>
<p>Diese Registerkarte enth&auml;lt Bedienelemente zum Festlegen von Linienstil und Hilfsstrichen der polaren Winkelachsen.</p><p>Auf der Seite <b>Linie und Hilfsstriche</b> sind drei Kontrollk&auml;stchen verf&uuml;gbar, um die Optionen f&uuml;r Linie und Hilfsstriche festzulegen.</p>
<table class="dialogcontroltable">

<tr>
<th> Linie und Hilfsstriche zeigen</th>
<td> Legen Sie fest, ob Linie und Hilfsstriche auf der ausgew&auml;hlten Winkelachse angezeigt werden.</td></tr>
<tr>
<th> Gleiche Optionen f&uuml;r Innen und Au&szlig;en verwenden</th>
<td> Aktivieren Sie dieses Kontrollk&auml;stchen, um die gleichen Optionen f&uuml;r Linie und Hilfsstriche der &auml;u&szlig;eren und inneren Winkelachsen zu verwenden. Wenn das Kontrollk&auml;stchen aktiviert ist, ist das Kontrollk&auml;stchen <b>Linie und Hilfsstriche zeigen</b> auf der Seite der inneren Achse nicht verf&uuml;gbar und sein Status wird automatisch auf den gleichen Status wie <b>Linie und Hilfsstriche zeigen</b> der Seite f&uuml;r die &auml;u&szlig;ere Achse gesetzt.</td></tr></table>
<p><br /> Der Zweig <b>Linie</b> enth&auml;lt Optionen zum benutzerdefinierten Anpassen des Linienstils:</p>
<table class="dialogcontroltable">

<tr>
<th> Zeigen</th>
<td> Aktivieren Sie dieses Kontrollk&auml;stchen, um die Linie auf der ausgew&auml;hlten Achse anzuzeigen.</td></tr>
<tr>
<th> Farbe</th>
<td> W&auml;hlen oder definieren Sie eine Farbe in dieser Auswahlliste und verwenden Sie sie als Anzeigefarbe der Achsenlinien und -hilfsstriche.</td></tr>
<tr>
<th> Dicke</th>
<td> Geben Sie eine gew&uuml;nschte Linienst&auml;rke (in Punkten, wobei ein Punkt=1/72 Inch) f&uuml;r die Achse und die Hilfsstriche in dieses Kombinationsfeld ein oder w&auml;hlen eine aus.</td></tr>
<tr>
<th> Achsenversatz</th>
<td> Legen Sie den Versatz der entsprechenden Winkelachse fest.<ul><li><b>Anfangsposition</b><dl><dd>Zeigen Sie die Achse in ihrer Anfangsposition an. Die Anfangspositionen der &auml;u&szlig;eren und inneren Winkelachsen werden von den Werten <b>Von</b> bzw. <b>Bis</b> auf der <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Scale_2" title="UserGuide:Axes Dialog for Polar Graph">Seite<b> Skalierung</b> der <b>Radialachsen</b></a> bestimmt.</dd></dl></li>
<li><b>% von Anfangsposition</b><dl><dd>Verwenden Sie den Prozentwert, um den Versatz der Achse von ihrer Anfangsposition aus zu definieren. Der Prozentsatz wird im Feld <b>Prozent/Wert</b> definiert.</dd></dl></li>
<li><b>An Position=</b><dl><dd>Positionieren Sie die Winkelachse an einer bestimmten Position entlang der Radialachse. Der Positionswert wird im Feld <b>Prozent/Wert</b> definiert. </dd></dl></li></ul>
</td></tr>
<tr>
<th> Prozent/Wert</th>
<td>Dieses Eingabefeld ist nur verf&uuml;gbar, wenn der <b>Achsenversatz</b> auf <b>% von Anfangsposition</b> oder <b>Bei Position=</b> gesetzt ist. Diese Option wird verwendet, um den Prozentsatz/Wert des Achsenversatzes zu bestimmen. Wenn <b>% von Anfangsposition</b> gew&auml;hlt ist, geben Sie einen Prozentwert ein. Sowohl positive als auch negative Prozentwerte sind zugelassen. Wenn <b>Bei Position=</b> gew&auml;hlt ist, sollte es sich um einen beliebigen Wert mit Bezug zur Radialachse handeln.</td></tr></table>
<p>Der Zweig <b>Hilfsstriche</b> enth&auml;lt Optionen f&uuml;r die benutzerdefinierte Anpassung von Richtung und L&auml;nge der Hilfsstriche. Die Optionen werden mit dem <a href="../../UserGuide/UserGuide/Line_and_Ticks_2.html#Major.2FMinor_Ticks" title="UserGuide:Line and Ticks 2">Zweig <b>Gro&szlig;e/Kleine Hilfsstriche</b></a> im allgemeinen Dialog der 2D-Achsen gemeinsam genutzt.</p>
<h3><a name="Reference_Lines"></a><span class="mw-headline">Referenzlinien</span></h3>
<p>Wie Achsen im kartesischen Koordinatensystem k&ouml;nnen Sie hier Referenzlinien auf der Winkelachse einer polaren Koordinate mit den Optionen der Registerkarte <b>Referenzlinien</b> hinzuf&uuml;gen.</p><p>Informationen dazu, wie die Optionen funktionieren, erfahren Sie &uuml;ber die <a href="../../UserGuide/UserGuide/Reference_Lines.html" title="UserGuide:Reference Lines">Registerkarte <b>Referenzlinien</b></a> der Achsen von kartesischen Koordinaten.</p><p>F&uuml;r die Winkelachse eines Polardiagramms wird die Referenzlinie als Gerade angezeigt, die beim Wert <b>Von</b> anf&auml;ngt und beim Wert <b>Biso</b> der Radialachse endet.</p>
<h3><a name="Special_Ticks_.28Outer_and_Inner.29"></a><span class="mw-headline">Spezielle Hilfsstriche (Au&szlig;en und Innen)</span></h3>
<p>Sie k&ouml;nnen eine oder mehr Beschriftungen f&uuml;r spezielle Hilfsstriche bei bestimmten Achsenpositionen auf den Winkelachsen hinzuf&uuml;gen.</p>
<table class="dialogcontroltable">

<tr>
<th> Gleiche Optionen f&uuml;r Innen und Au&szlig;en verwenden</th>
<td> Aktivieren Sie dieses Kontrollk&auml;stchen, um die gleichen Optionen f&uuml;r die Hilfsstriche der &auml;u&szlig;eren und inneren Winkelachsen zu verwenden.</td></tr></table>
<p>Auf dieser Registerkarte Seite k&ouml;nnen Sie den Stil der speziellen Hilfsstriche auf der &auml;u&szlig;eren Winkelachse benutzerdefiniert anpassen, wenn auf der Seite <b>Spezielle Hilfsstriche</b> gew&auml;hlt ist, dass sie angezeigt werden. Die Optionen werden mit der <a href="../../UserGuide/UserGuide/Special_Ticks_2.html" title="UserGuide:Special Ticks 2">Registerkarte Spezielle Hilfsstriche</a> im allgemeinen Dialog der 2D-Achsen gemeinsam genutzt.</p>
<h2><a name="Radial_Axes"></a><span class="mw-headline">Radialachsen</span></h2>
<p>Die Radialachsen k&ouml;nnen innerhalb und au&szlig;erhalb des Polardiagramms gezeigt werden. Innere Achsen f&uuml;hren strahlenf&ouml;rmig von der Mitte weg. Sie werden als <b>Innere Achse <i>n</i></b> bezeichnet. &Auml;u&szlig;ere Achsen wreden au&szlig;erhalb des Rahmens des Polardiagramms gezeichnet und als <b>&Auml;u&szlig;ere Achse <i>n</i></b> bezeichnet.</p><p>Sie k&ouml;nnen zu jedem gro&szlig;en Hilfsstrich auf den Winkelachsen Radialachsen hinzuf&uuml;gen und diese alle gleichzeitig benutzerdefiniert anpassen.</p><p>F&uuml;r <b>Radialachsen</b> k&ouml;nnen Sie die Anfangskonfiguration der Radialachsen mit zwei Methoden bestimmen:</p>
<ol>
<li>Klicken Sie auf die Schaltfl&auml;chen <b>Eine Radialachse hinzuf&uuml;gen</b> oder <b>Eine Radialachse l&ouml;schen</b>, um die Radialachse direkt hinzuzuf&uuml;gen bzw. zu l&ouml;schen. <br /><font color="blue"><b>Hinweis:</b> Wenn Sie auf die Schaltfl&auml;che <b>Eine Radialachse hinzuf&uuml;gen</b> klicken, wird die innere Radialachse hinzugef&uuml;gt. Wenn Sie auf die Schaltfl&auml;che <b>Eine Radialachse l&ouml;schen</b> klicken, wird die letzte Radialachse im linken Bedienfeld gel&ouml;scht.</font>

<li>Klicken Sie auf die Schaltfl&auml;che <b>Neue Konfiguration</b>, um den <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Radial_Axes_Configuration_Dialog" title="UserGuide:Axes Dialog for Polar Graph">Dialog <b>Konfiguration der Radialachsen</b></a> zu &ouml;ffnen.</ol>
<p><br /></p>
<h3><a name="Radial_Axes_Configuration_Dialog"></a><span class="mw-headline">Dialog Konfiguration der Radialachsen</span></h3>
<p>Dieser Dialog wird verwendet, um die Konfiguration f&uuml;r alle Radialachsen schnell festzulegen. Die aktuelle Konfiguration der Radialachsen geht verloren, wenn eine neue Konfiguration angewendet wird.</p><p>In diesem Dialog werden die <b>Achsen innerhalb des Polardiagramms</b> und die <b>Achsen au&szlig;erhalb des Polardiagramms </b>in separaten Zweigen gesteuert.</p>
<dl><dd><a  class="image"><img alt="Radial Axes Configuration Dialog.png" src="../images/Axes_Dialog_for_Polar_Graph/Radial_Axes_Configuration_Dialog.png" width="322"  /></a></dd></dl>
<h4><a name="Axes_Inside_Polar"></a><span class="mw-headline">Achsen innerhalb Polar</span></h4>
<table class="dialogcontroltable">

<tr>
<th> Achsen innerhalb Polar</th>
<td> Dieses Kontrollk&auml;stchen wird verwendet, um festzulegen, ob die Radialachsen innerhalb des Polardiagramms gezeigt werden. Wenn es deaktiviert ist, werden alle anderen Bedienelemente in diesem Baumknoten deaktiviert und es werden keine Achsen innerhalb des Polardiagramms gezeigt, d.h. keine <b>Inneren Achsen</b>.</td></tr>
<tr>
<th> Positionstyp</th>
<td> Bestimmen Sie den Positionstyp von allen <b>Inneren Achsen.</b><ul><li><b>Winkel</b>: Verwenden Sie die Werte der Winkelachsen, um die Position der Radialachsen zu bestimmen. Die Position ist relativ zu den Winkelachsen.</li>
<li><b>Uhr</b>: Verwenden Sie die einstellbare Uhrposition in dem Diagramm, um die Position der Radialachsen zu bestimmen. Die Position wird nicht ver&auml;ndert, wenn die Winkelachsen ge&auml;ndert werden.</li>
<li><b>Gro&szlig;e Hilfsstriche</b>: Mehrere Radialachsen werden bei jeder Position eines gro&szlig;en Hilfsstrichs auf der Winkelachse angezeigt. Sie k&ouml;nnen nur zusammen durch die im Feld ausgew&auml;hlte Seite <b>Hauptradialachsen</b> benutzerdefiniert angepasst werden.</li></ul>
</td></tr>
<tr>
<th> Winkelliste</th>
<td> Diese Auswahlliste ist nur verf&uuml;gbar, wenn die Option <b>Winkel</b> f&uuml;r den <b>Positionstyp</b> gew&auml;hlt ist. Sie k&ouml;nnen eine Standardwinkelliste f&uuml;r die Radialachsen oder <b>Benutzerdefiniert</b> w&auml;hlen und dann eine benutzerdefinierte Winkelliste im Eingabefeld <b>Wert (<i>Winkeleinheiten</i>)</b> erstellen.</td></tr>
<tr>
<th> Wert (<i>Winkeleinheiten</i>)</th>
<td> Dieses Eingabefeld ist nur verf&uuml;gbar, wenn die Option <b>Benutzerdefiniert</b> f&uuml;r <b>Winkelliste</b> gew&auml;hlt wurde. <i>Winkeleinheiten</i> wird entsprechend der <b>Einheiten</b> ge&auml;ndert, die auf der Registerkarte <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Scale" title="UserGuide:Axes Dialog for Polar Graph"><b>Winkelskalierung</b></a> definiert sind. Sie k&ouml;nnen die Position der Radialachsen definieren, indem Sie einen oder mehrere Winkelwerte in Winkelachsen eingeben. Verwenden Sie &quot;Leerzeichen&quot; als Trennzeichen.</td></tr>
<tr>
<th> Liste der Uhrzeiten</th>
<td> Diese Auswahlliste ist nur verf&uuml;gbar, wenn die Option <b>Uhrzeit</b> f&uuml;r den <b>Positionstyp</b> gew&auml;hlt ist. Sie k&ouml;nnen die Standardliste der Uhrzeiten f&uuml;r die Radialachsen w&auml;hlen.</td></tr></table>
<h4><a name="Axes_Outside_Polar"></a><span class="mw-headline">Achsen au&szlig;erhalb Polar</span></h4>
<p>Es gibt vier Auswahllisten in diesem Zweig: <b>Links</b>, <b>Rechts</b>, <b>Oben</b> und <b>Unten</b>. Jede bestimmt, ob Achsen in dem entsprechenden Rahmen gezeigt werden, z.B. wird die Auswahlliste <b>Links</b> f&uuml;r die Radialachsen an der linken Linie des Rahmenrands verwendet.</p><p>Diese Auswahllmen&uuml;s haben &auml;hnliche Optionen:</p>
<table class="optiontable">

<tr>
<th> Kein</th>
<td> Es werden keine Radialachsen an diesem Rahmenrand angezeigt.</td></tr>
<tr>
<th> Oben oder Links</th>
<td> Es wird nur die obere (f&uuml;r <b>Links</b> und <b>Rechts</b>) oder linke (f&uuml;r <b>Oben</b> und <b>Unten</b>) Radialachse an diesem Rahmenrand angezeigt.</td></tr>
<tr>
<th> Unten oder Rechts</th>
<td> Es wird nur die untere (f&uuml;r <b>Links</b> und <b>Rechts</b>) oder rechte (f&uuml;r <b>Oben</b> und <b>Unten</b>) Radialachse an diesem Rahmenrand angezeigt.</td></tr>
<tr>
<th> Oben &amp; Unten oder Links &amp; Rechts</th>
<td> Es wird die obere und untere (f&uuml;r <b>Links</b> und <b>Rechts</b>) oder die linke und rechte (f&uuml;r <b>Oben</b> und <b>Unten</b>) Radialachse an diesem Rahmenrand angezeigt.</td></tr></table>
<p>F&uuml;r jede Auswahlliste gibt es ein zus&auml;tzliches Eingabefeld<b> %s of Radius</b>, wenn die Option <b>Kein</b> NICHT gew&auml;hlt ist. Sie k&ouml;nnen hier einen Wert eingeben, um den Versatz der entsprechenden Radialachse(n) in Hinblick auf die Endposition der Radiuslinie zu definieren, die senkrecht zu dieser Radialachse steht.</p><p><br /></p>
<h3><a name="Show_2"></a><span class="mw-headline">Zeigen</span></h3>
<p>Auf der Seite <b>&Auml;u&szlig;ere Achse <i>n</i></b> oder <b>Innere Achse <i>n</i></b> oder <b>Hauptachsen</b> k&ouml;nnen Sie entscheiden, ob und wo die Radialachsen gezeigt werden sollen.</p><p>Das Kontrollk&auml;stchen <b>Zeigen</b> gibt Ihnen die M&ouml;glichkeit festzulegen, ob die ausgew&auml;hlte Radialachse angezeigt werden soll.</p><p>Der Zweig <b>Achsenposition</b> enth&auml;lt Optionen, mit denen Sie entscheiden k&ouml;nnen, wo die ausgew&auml;hlte Radialachse gezeigt werden soll:</p>
<table class="dialogcontroltable">

<tr>
<th> Referenz</th>
<td> Diese Auswahlliste wird verwendet, um zu bestimmen, ob die Radialachsen innerhalb oder au&szlig;erhalb des Polardiagramms gezeigt werden sollen und ob f&uuml;r die innere Achse die Option Winkelachsen oder Richtung der Uhrzeit als Referenz verwendet werden soll.<ul><li><b>Winkelachsen</b><dl><dd>Wenn diese Option gew&auml;hlt ist, ist die Achse eine <b>Innere Achse</b>, und die Achsenposition ist relevant f&uuml;r die Skalierungseinstellung der Winkelachse. Dies entspricht der Einstellung des <b>Positionstyps</b> als <b>Winkel</b> im <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Radial_Axes_Configuration_Dialog" title="UserGuide:Axes Dialog for Polar Graph">Dialog <b>Konfiguration der Radialachsen</b></a>.</dd></dl></li>
<li><b>Ziffernblatt</b><dl><dd>Wenn diese Option gew&auml;hlt ist, ist die Achse eine <b>Innere Achse</b>, und die Achsenposition richtet sich nach der gew&auml;hlten Richtung der Uhrzeit. Dies entspricht der Einstellung des <b>Positionstyps</b> auf <b>Uhrzeit</b> im <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Radial_Axes_Configuration_Dialog" title="UserGuide:Axes Dialog for Polar Graph">Dialog <b>Konfiguration der Radialachsen.</b></a>.  </dd></dl></li>
<li><b>Rahmengrenze</b><dl><dd>Wenn diese Option gew&auml;hlt ist, ist die Achse eine <b>&Auml;u&szlig;ere Achse</b>, und die Achse befindet sich  mit/ohne einem senkrechten Versatz an der Linie des Rahmenrands.</dd></dl></li></ul>
</td></tr>
<tr>
<th> Winkel bei</th>
<td> Dieses Auswahlliste ist nur verf&uuml;gbar, wenn die Option <b>Winkelachsen</b> f&uuml;r unter <b>Referenz</b> gew&auml;hlt ist. Sie wird verwendet, um die Achsenposition mit Hilfe des Winkelwerts bei den Winkelachsen festzulegen.<ul><li><b>Anfangswinkel</b><dl><dd>Platzieren Sie die Radialachse beim Anfangswinkel der Winkelachse, der durch <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Angular_Axes" title="UserGuide:Axes Dialog for Polar Graph"><b>Achsenanfang bei (Grad)</b></a> definiert ist.</dd></dl></li>
<li><b>Endwinkel</b><dl><dd>Platzieren Sie die Radialachse am Endwinkel der Winkelachse, der durch den Wert <b>Bis</b> auf der <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Scale" title="UserGuide:Axes Dialog for Polar Graph">Seite <b>Skalierung</b> der Winkelachse</a> definiert ist.</dd></dl></li>
<li><b>% von Anfangswinkel</b><dl><dd>Verwenden Sie einen Versatz im Prozentsatz hinsichtlich des <b>Anfangswinkels</b>, um die Position der Radialachsen zu definieren. Der Versatz wird im Eingabefeld <b>Wert (<i>Winkeleinheiten</i>)</b> definiert.</dd></dl></li>
<li><b>% von Endwinkel</b><dl><dd>Verwenden Sie einen Versatz im Prozentsatz hinsichtlich des <b>Anfangswinkels</b>, um die Position der Radialachsen zu definieren. Der Versatz wird im Eingabefeld <b>Wert (<i>Winkeleinheiten</i>)</b> definiert.</dd></dl></li>
<li><b>Winkel bei</b><dl><dd>Verwenden Sie einen beliebigen Winkelwert, um die Position der Radialachsen zu definieren. Der Wert wird im Eingabefeld <b>Wert (<i>Winkeleinheiten</i>)</b> definiert.</dd></dl></li></ul>
</td></tr>
<tr>
<th> Wert (<i>Winkeleinheiten</i>)</th>
<td> Dieses Eingabefeld ist verf&uuml;gbar, wenn die Auswahlliste <b>Winkel bei</b> auf <b>% von Anfangswinkel</b> oder <b>% von Endwinkel</b> oder <b>Winkel bei</b> gesetzt ist. Die <i>Winkeleinheiten</i> werden entsprechend der <b>Einheiten</b> ge&auml;ndert, die auf der Registerkarte <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Scale" title="UserGuide:Axes Dialog for Polar Graph"><b>Winkelskalierung</b></a> definiert sind.<ul><li>Wenn <b>Winkel bei</b> auf <b>% von Anfangswinkel</b> oder <b>% von Endwinkel</b> gesetzt ist, ist dieser Wert der Prozentversatz, um den die Radialachse von dem Referenzwinkel weg verschoben wird.</li>
<li>Wenn f&uuml;r <b>Winkel bei</b> die Option <b>Winkel bei</b> gew&auml;hlt ist, ist dieser Wert der tats&auml;chliche Winkelwert und die Radialachse wird in diese Position gesetzt.  </li></ul>
</td></tr>
<tr>
<th> Uhrzeiten</th>
<td> Diese Auswahlliste ist nur verf&uuml;gbar, wenn die Option <b>Ziffernblatt</b> unter <b>Referenz</b> gew&auml;hlt ist. Sie enth&auml;lt 4 Optionen, um die Radialachse auf die Richtung 3, 6, 9 bzw. 12 Uhr zu setzen. Die Achsenposition &auml;ndert sich nicht mit der Winkelachse.</td></tr>
<tr>
<th> Winkel bei</th>
<td> Diese Auswahlliste ist nur verf&uuml;gbar, wenn die Option <b>Rahmengrenze</b> unter <b>Referenz</b> gew&auml;hlt ist. Sie verf&uuml;gt &uuml;ber 8 Optionen, um die Radialachsen bei spezifischen Positionen au&szlig;erhalb des Rahmens zu positionieren.</td></tr>
<tr>
<th> Senkrechte Verschiebung</th>
<td> Dieses Kontrollk&auml;stchen wird verwendet, um festzulegen, ob der Versatz in senkrechter Richtung durchgef&uuml;hrt werden soll.</td></tr>
<tr>
<th>% von Radius</th>
<td> Diese Option ist nur verf&uuml;gbar, wenn <b>Senkrechte Verschiebung</b> aktiviert ist. Dieser Wert wird verwendet, um den Versatz in Prozent der Radialachse zu definieren. Genauso verh&auml;lt es sich mit dem Eingabefeld <b>%s von Radius</b> im <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Axes_Outside_Polar" title="UserGuide:Axes Dialog for Polar Graph">Dialog <b>Konfiguration der Radialachsen</b></a>.</td></tr>
<tr>
<th> Flie&szlig;richtung</th>
<td> Diese Auswahl wird verwendet, um die Richtung von Hilfsstrichen, Hilfsstrichsbeschriftung und Titel festzulegen. Sie h&auml;ngt mit der Ausrichtung der Winkelachse und dem Referenztyp der Radialachse zusammen. In dem Dialog wird ein Hinweis angezeigt, der die positive Flie&szlig;richtung unter den aktuellen Einstellungen angibt. Die negative Richtung ist nur eine Umkehrung der positiven Richtung.</td></tr></table>
<h3><a name="Scale_2"></a><span class="mw-headline">Skalieren</span></h3>
<p>Diese Registerkarte bietet Bedienelemente, mit denen Sie Achsenbereich, Achsentyp, Hilfsstrichspositionen etc. aller Radialachsen bestimmen k&ouml;nnen. Sie sind im Grunde die gleichen wie auf der <a href="../../UserGuide/UserGuide/Scale_2.html" title="UserGuide:Scale 2">Registerkarte <b>Skalierung</b></a> im Dialog der 2D-Achsen au&szlig;er ein Kontrollk&auml;stchen, das sich ausschlie&szlig;lich auf Radialachsen in Polardiagrammen bezieht:</p>
<table class="dialogcontroltable">

<tr>
<th> Zentrum bei (%)</th>
<td>
<p>Geben Sie einen Prozentwert des Abstands zwischen <b>Von</b> und <b>Bis</b> ein, um den Abstand vom Zentrumswert bis zum Wert <b>Von</b> festzulegen.</p><p>Wenn zum Beispiel die Radialachse von <b>50</b> bis <b>100</b> reicht und Sie das Zentrum bei <b>40</b> setzen m&ouml;chten, dann k&ouml;nnen Sie diese Prozentangaben eingeben: <br /> <i>(<b>Von</b>-<b>Wert des Zentrums</b>) / (<b>Bis</b>-<b>Von</b>) *100% = (50-40) / (100-50) *100% = 20%</i></p><p>Der Standardwert ist <b>0</b>. Dies bedeutet, dass das Zentrum des Polardiagramms auf den Ursprung (r=0) festgelegt wird, unabh&auml;ngig von dem Wert <b>Von</b> der Radialachsen.</p>
</td></tr></table>
<p><br /> <b>Hinweis:</b></p>
<ul><li> Radialachsen unterst&uuml;tzen einen positiven Bereich wie <b>Von</b> = -0,2 und <b>Bis</b> = 1,0. </li>
<li> Die Radialachse kann eine umgekehrte Achse sein. Das bedeutet, dass <b>Von</b> gr&ouml;&szlig;er ist als <b>Bis</b> und das Inkrement ist negativ.<br /></li></ul>
<p>Siehe <a href="../../UserGuide/UserGuide/The_Hierarchical_Cluster_Analysis_Dialog_Box.html#Plot" title="UserGuide:The Hierarchical Cluster Analysis Dialog Box">das zirkul&auml;re Dendrogramm</a>:</p>
<dl><dd><a  class="image"><img alt="Reverse Radial Axis.png" src="../images/Axes_Dialog_for_Polar_Graph/800px-Reverse_Radial_Axis.png" width="800"   /></a></dd></dl>
<p><br /></p>
<h3><a name="Tick_Labels_2"></a><span class="mw-headline">Beschriftungen der Hilfsstriche</span></h3>
<p>Auf dieser Registerkarte k&ouml;nnen Sie die Beschriftung der Hilfsstriche der spezifischen Radialachse benutzerdefiniert anpassen:</p>
<table class="dialogcontroltable">

<tr>
<th> Anzeige</th>
<td> Diese Registerkarte bietet Bedienelemente f&uuml;r die Anzeige der Hilfsstrichsbeschriftungen. Diese sind identisch mit den Bedienelementen der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Display" title="UserGuide:Tick Labels 2"><b>Anzeige</b> der Hilfsstrichsbeschriftung</a> im allgemeinen Dialog der 2D-Achsen.</td></tr>
<tr>
<th> Format</th>
<td> Diese Registerkarte bietet Bedienelemente zur benutzerdefinierten Anpassung des Beschriftungsformat der Hilfsstriche. Die Bedienelemente sind im Allgemeinen die gleichen wie das <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Format_Tab" title="UserGuide:Tick Labels 2"><b>Format</b> der Hilfsstrichsbeschriftungen</a> im allgemeinen Dialog der 2D-Achsen mit Ausnahme der Option <b>Umbruch im Text</b>.</td></tr>
<tr>
<th> Beschriftung kleiner Hilfsstriche</th>
<td> Die Registerkarte enth&auml;lt Optionen, mit denen die Beschriftungen der kleinen Hilfsstriche speziell angepasst werden k&ouml;nnen. Die Bedienelemente &auml;hneln denen der <a href="../../UserGuide/UserGuide/Tick_Labels_2.html#Minor_Tick_Labels_Tab" title="UserGuide:Tick Labels 2">Registerkarte <b>Beschriftung der kleinen Hilfsstriche</b></a> im allgemeinen Dialog der 2D-Achsen.</td></tr></table>
<h3><a name="Title_2"></a><span class="mw-headline">Titel</span></h3>
<p>Diese Registerkarte wird verwendet, um den Titel der Radialachse festzulegen.</p><p>Das Kontrollk&auml;stchen <b>Zeigen</b> wird verwendet, um festzulegen, ob ein Titel f&uuml;r die spezifische Radialachse angezeigt werden soll.</p><p>Die anderen Bedienelemente sind im Allgemeinen identisch zu denen der <a href="../../UserGuide/UserGuide/Title_2.html" title="UserGuide:Title 2">Seite <b>Titel</b></a> des allgemeinen Dialogs 2D-Achsen.</p><p><br /></p>
<h3><a name="Grids_2"></a><span class="mw-headline">Gitternetze</span></h3>
<p>Diese Seite bietet Optionen zum benutzerdefinierten Anpassen der Gitternetzlinien der Radialachsen, d.h. den konzentrischen Kreisen um die Winkelachsen.</p><p>Haupt- und Nebengitternetzlinien k&ouml;nnen separat benutzerdefiniert angepasst werden in den Zweigen <b>Hauptgitterlinien</b> bzw. <b>Nebengitternetzlinien</b>. Die Bedienelemente dieser zwei Zweige werden auch von den entsprechenden Knoten der <a href="../../UserGuide/UserGuide/Grids_2.html" title="UserGuide:Grids 2">Registerkarte <b>Gitternetze</b></a> des allgemeinen Dialogs der 2D-Achsen genutzt.</p><p><br /></p>
<h3><a name="Line_and_Ticks_.28Inner_and_Outer.29"></a><span class="mw-headline">Linie und Hilfsstriche (Innen und Au&szlig;en)</span></h3>
<p>Diese Registerkarte wird verwendet, um den Stil von Linie und Hilfsstrichen der Radialachse benutzerdefiniert anzupassen.</p><p>Das Kontrollk&auml;stchen <b>Zeigen</b> wird verwendet, um festzulegen, ob Linie und Hilfsstriche f&uuml;r die spezifische Radialachse angezeigt werden sollen.</p><p>Die anderen Bedienelemente sind im Allgemeinen identisch zu den Bedienelementen der <a href="../../UserGuide/UserGuide/Line_and_Ticks_2.html" title="UserGuide:Line and Ticks 2">Seite <b>Linie und Hilfsstriche</b></a> des Standarddialogs der 2D-Achsen.</p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Axes_Dialog_for_Polar_Graph/Tip_icon.png" width="57"  border="0" /></td><td><p>Seit Origin 2023 sind die Enden von Achsenlinien f&uuml;r radiale (aber nicht winklige) Achsen standardm&auml;&szlig;ig quadratisch und werden von der Systemvariable <a class="external text" href="../../LabTalk/LabTalk/System_Variable_List.html#L"><b>@LCAL</b></a> gesteuert.</p></td></tr></table>
<h3><a name="Reference_Lines_2"></a><span class="mw-headline">Referenzlinien</span></h3>
<p>Wie Achsen im kartesischen Koordinatensystem k&ouml;nnen Sie Referenzlinien auf der Radialachse einer polaren Koordinate mit den Optionen der Registerkarte <b>Referenzlinien</b> hinzuf&uuml;gen.</p><p>Informationen dazu, wie die Optionen funktionieren, erfahren Sie &uuml;ber die <a href="../../UserGuide/UserGuide/Reference_Lines.html" title="UserGuide:Reference Lines">Registerkarte <b>Referenzlinien</b></a> der Achsen von kartesischen Koordinaten.</p><p>F&uuml;r die Radialachse eines Polardiagramms wird die Referenzlinie als Gerade angezeigt, die beim Wert <b>Von</b> der Winkelachse anf&auml;ngt und beim Wert <b>Bis</b> endet.</p>
<h3><a name="Special_Ticks_.28Inner_and_Outer.29"></a><span class="mw-headline">Spezielle Hilfsstriche (Innen und Au&szlig;en)</span></h3>
<p>Diese Registerkarte wird verwendet, um spezielle Hilfsstrichsbeschriftungen auf den Radialachsen hinzuzuf&uuml;gen/zu entfernen/zu bearbeiten.</p><p>Die Bedienelemente sind identisch zu den Bedienelementen der <a href="../../UserGuide/UserGuide/Axes_Dialog_for_Polar_Graph.html#Special_Ticks" title="UserGuide:Axes Dialog for Polar Graph">Seite <b>Spezielle Hilfsstriche</b></a> des Dialogs der Winkelachsen.</p><p><br /></p>
<h2><a name="Crop"></a><span class="mw-headline">Schneiden</span></h2>
<p>Klicken Sie auf <b>Beschneiden</b>, um den Dialog <b>Verschiedenes</b> zu &ouml;ffnen. Diagrammelemente au&szlig;erhalb des definierten Rechtecks werden aus dem Diagramm entfernt.</p>
<table class="dialogcontroltable">
<tr>
<th> Aktivieren</th>
<td> Aktivieren Sie dieses Kontrollk&auml;stchen, um die Funktion des Abschneidens zu aktivieren. Nur wenn dieses K&auml;stchen aktiviert ist, werden auch die anderen Bedienelemente auf dieser Seite aktiviert.</td></tr>
<tr>
<th> Einheiten</th>
<td> W&auml;hlen Sie die Einheit, um die Dimension des Rechtecks zu definieren.<ul><li><b>% der Seite</b><dl><dd>Wurde diese Einheit ausgew&auml;hlt, entsprechen die Werte in den Textfeldern <b>Links</b>, <b>Oben</b>, <b>H&ouml;he</b> und <b>Breite</b> den Prozentwerten der H&ouml;he und Breite der Diagrammseite.  </dd></dl></li>
<li><b>Zoll, cm, mm, Pixel, Punkt</b><dl><dd>Absolute Einheiten f&uuml;r <b>Links</b>, <b>Oben</b>, <b>Breite</b> und <b>H&ouml;he</b></dd></dl></li></ul>
</td></tr>
<tr>
<th> Links</th>
<td> Dieses Eingabefeld wird verwendet, um die Position der linken Linie des Rechtecks zu definieren.</td></tr>
<tr>
<th> Oben</th>
<td> Dieses Eingabefeld wird verwendet, um die Position der oberen Linie des Rechtecks zu definieren.</td></tr>
<tr>
<th> Breite</th>
<td> Dieses Eingabefeld wird verwendet, um die Breite des Rechtecks zu definieren.</td></tr>
<tr>
<th> H&ouml;he</th>
<td> Dieses Eingabefeld wird verwendet, um die H&ouml;he des Rechtecks zu definieren.</td></tr>
</table>
<h2><a name="Apply_to_Others"></a><span class="mw-headline">Auf andere anwenden</span></h2>
<p>Klicken Sie auf <b>Anwenden auf</b>, um den Dialog <b>Anwenden auf</b> zu &ouml;ffnen. Dieser Dialog wird durch Klicken auf die Schaltfl&auml;che <b>Anwenden auf...</b> unten im Dialog <b>Achsen</b> ge&ouml;ffnet. Sie k&ouml;nnen das Format der Hilfsstrichsbeschriftungen, Linie und Hilfsstriche sowie Gitternetzlinien festlegen, um diese von der Quellachse auf die Zielachse zu &uuml;bertragen.</p><p>Dieser Dialog funktioniert wie die <a href="../../UserGuide/UserGuide/Apply_To_dialog.html" title="UserGuide:Apply To dialog">Seite <b>Auf andere anwenden</b></a> im allgemeinen Dialog der Achsen von 2D-Diagrammen.</p><p><br /></p>


    