<h1 class="firstHeading">Grundlegende Operationen des Diagrammfensters</h1><p class='urlname' style='display: none'>GraphWindow-Operation</p>
<p><br /> Origin unterst&uuml;tzt &uuml;ber <b>100 Diagrammtypen</b>.</p>
<ul><li> In erster Linie ist dieses <i>Fenster</i> der Beh&auml;lter f&uuml;r all diese Diagrammtypen.  </li>
<li> Jeder der &uuml;ber 100 Diagrammtypen nutzt eine standardm&auml;&szlig;ige benutzerdefinierbare <a href="../../UserGuide/Category/Creating_Graphs_from_Graph_Templates.html" title="Category:Creating Graphs from Graph Templates">Diagrammvorlage</a> zum Erstellen des Schaubildes (einige Diagrammtypen k&ouml;nnen eine Vorlage teilen).</li>
<li> Jedes Diagrammfenster besteht aus einer einzelnen editierbare <i>Seite</i>.  </li>
<li> Die Diagrammseite muss mindestens einen Layer -- <i>und kann bis zu 1024</i> -- <i>Diagrammlayer</i>enthalten.  </li>
<li> Jeder Layer ist mit <i>Diagrammachsen</i> verbunden, auch wenn Achsen verborgen oder von mehreren Layern gemeinsam genutzt werden k&ouml;nnen.</li></ul>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Opening_a_new_graph_window"><span class="tocnumber">1</span> <span class="toctext">&Ouml;ffnen eines neuen Diagrammfensters</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Graph_templates_and_graph_customization"><span class="tocnumber">2</span> <span class="toctext">Diagrammvorlagen und Anpassen von Diagrammen</span></a></li>
<li class="toclevel-1 tocsection-3"><a href="#Notes_window_for_Graph_window"><span class="tocnumber">3</span> <span class="toctext">Notizfenster f&uuml;r Diagrammfenster</span></a></li>
</ul>
</div>

<h2><a name="Opening_a_new_graph_window"></a><span class="mw-headline">&Ouml;ffnen eines neuen Diagrammfensters</span></h2>
<p>Um ein neues 2D-Diagrammfenster zu &ouml;ffnen:</p><p>1. Klicken Sie auf <b>Neue Grafik</b> <a  class="image"><img alt="Button New Graph.png" src="../images/Basic_Graph_Window_Operations/Button_New_Graph.png" width="23"  /></a> in der Symbolleiste Standard.</p><p>Wenn sie nicht vom Anwender ver&auml;ndert wurde, &ouml;ffnet diese Schaltfl&auml;che <a href="../../UserGuide/UserGuide/Creating_Child_Window.html#Creating_a_new_window_using_the_Standard_toolbar_buttons" title="UserGuide:Creating Child Window">ein normales 2D-Diagrammfenster f&uuml;r XY-Daten basierend auf der Vorlage von Origin.otp</a>. Daten k&ouml;nnen -- durch den <a href="../../UserGuide/Category/Plot_Setup.html" title="Category:Plot Setup">Dialog <b>Diagrammeinstellungen</b></a> oder durch <a class="external text" href="../../GettingStarted/OriginLab/2D_Graphs.html#Adding_Data_by_Drag_and_Drop">Drag &amp; Drop</a> -- direkt zu dieser Vorlage hinzugef&uuml;gt werden, um <b>Linien</b>, <b>Symbol</b>, <b>Linie + Symbol</b> und <b>Balken/S&auml;ulen</b>-Diagramme zu zeichnen.</p><p>Beachten Sie, dass viele Diagrammtypen das &Ouml;ffnen einer leeren Vorlage und anschlie&szlig;endes Hinzuf&uuml;gen von Daten nicht unterst&uuml;tzen (z. B. Boxdiagramme). Dies liegt daran, dass eine bestimmte Menge an Daten bereitstehen muss, bevor ein Diagramm gezeichnet werden kann. Die gew&ouml;hnliche Methode zum Erstellen solch eines Diagramms ist folgende: (1) W&auml;hlen Sie Ihre Daten (m&uuml;ssen dem Diagrammtyp entsprechen), (2) zeichnen Sie sie durch Auswahl eines der Diagrammtypen im Men&uuml; <b>Zeichnen</b> oder durch Klicken auf eine der Schaltfl&auml;chen der Symbolleisten zum Zeichnen.</p>
<h2><a name="Graph_templates_and_graph_customization"></a><span class="mw-headline">Diagrammvorlagen und Anpassen von Diagrammen</span></h2>
<p>Wie bereits erw&auml;hnt basieren alle Diagramme in Origin auf benutzerdefinierbaren <a href="../../UserGuide/UserGuide/Template_Files.html" title="UserGuide:Template Files">Diagrammvorlagen</a>, die zusammen mit Origin installiert werden. Die Vorlagen speichern Informationen &uuml;ber die Gr&ouml;&szlig;e der Diagrammseite, die Anzahl der Diagrammlayer, Konfiguration der Diagrammachsen, Zeichnungsstil, Farben usw. Weitere Informationen &uuml;ber die Informationen, die mit den Diagrammvorlagen gespeichert oder welche nicht, finden Sie unter <a href="../../UserGuide/UserGuide/What_is_Saved_with_the_Graph_Template.html" title="UserGuide:What is Saved with the Graph Template">Was wird mit der Diagrammvorlage gespeichert?</a></p><p>Weitere Informationen &uuml;ber das benutzerdefinierte Anpassen von Diagrammen und deren Erstellung Sie unter:</p>
<ul><li><a href="../../UserGuide/Category/Basic_Graphing.html" title="Category:Basic Graphing">Grundlagen des Zeichnens</a></li></ul>
<ul><li><a class="external text" href="../../GettingStarted/OriginLab/2D_Graphs.html#Grouping_Data_Plots">Diagramme gruppieren</a></li></ul>
<ul><li><a class="external text" href="../../GettingStarted/OriginLab/Customizing_Graphs.html">Diagramm benutzerdefiniert anpassen</a></li></ul>
<p><br /></p>
<h2><a name="Notes_window_for_Graph_window"></a><span class="mw-headline">Notizfenster f&uuml;r Diagrammfenster</span></h2>
<ul><li> Aktivieren Sie ein Diagrammfenster und klicken Sie auf die kleine Schaltfl&auml;che <b>Notizen zeigen</b> in der oberen rechten Ecke der Objektverwaltung. Sie &ouml;ffnen auf diese Weise das Notizfenster f&uuml;r das aktive Diagrammfenster.</li></ul>
<dl><dd><a  class="image"><img alt="Show Notes for Graph.png" src="../images/Basic_Graph_Window_Operations/Show_Notes_for_Graph.png" width="279"  /></a></dd></dl>
<ul><li> Aktivieren Sie ein Diagrammfenster und klicken Sie auf die kleine Schaltfl&auml;che <b>Notizen verbergen</b> in der oberen rechten Ecke der Objektverwaltung, um das Notizfenster zu verbergen.</li></ul>
<dl><dd><a  class="image"><img alt="Hide Notes for Graph.png" src="../images/Basic_Graph_Window_Operations/Hide_Notes_for_Graph.png" width="271"  /></a></dd></dl>







    