<h1 class="firstHeading">Stapelzeichnen</h1><p class='urlname' style='display: none'>Graphing-Batch-Plotting</p>
<p><br /> In Origin gibt es mehrere Methoden, wie Sie ein Diagramm benutzerdefiniert anpassen k&ouml;nnen. Sie k&ouml;nnen diese Anpassungen danach f&uuml;r andere Datens&auml;tze wieder verwenden.</p>
<ul><li> Sie k&ouml;nnen Ihre benutzerdefinierten Einstellungen als <a href="../../UserGuide/UserGuide/Graph_Template_Basics.html" title="UserGuide:Graph Template Basics">Diagrammvorlagen</a> speichern.</li>
<li> Sie k&ouml;nnen Ihre Anpassungen als <a href="../../UserGuide/UserGuide/Saving_a_Format_as_a_Theme.html" title="UserGuide:Saving a Format as a Theme">Diagrammdesigns</a> speichern. </li>
<li> Sie k&ouml;nnen Formate aus einem Diagramm kopieren und <a href="../../UserGuide/UserGuide/Copying_and_Pasting_Formats.html" title="UserGuide:Copying and Pasting Formats">sie in andere Diagramme einf&uuml;gen</a>.</li>
<li> Sie k&ouml;nnen Origins Funktion des Stapelzeichnens oder <b>Arbeitsblatt &auml;ndern</b> verwenden, das im Folgenden beschrieben wird. </li></ul>
<p>Um Diagramm<b>vorlagen</b> und Diagramm<b>designs</b> zu verwenden, m&uuml;ssen Sie zuvor eine Gruppe von Anpassungen in einer Datei gespeichert haben. <b>Formate kopieren/einf&uuml;gen</b> und <b>Stapelzeichnen</b> erfordert kein vorheriges Speichern einer Datei. Alle haben ihre Anwendungen, aber das Stapelzeichnen ist insbesondere n&uuml;tzlich beim Arbeiten mit Daten in mehreren Spalte/Bl&auml;ttern/Mappen. In diesem Abschnitt wird erl&auml;utert, wie Sie mit neuen Spalten/Arbeitsbl&auml;ttern/Arbeitsmappen, die eine identische Struktur wie die urspr&uuml;nglichen Daten aus Spalten/Bl&auml;tter/Mappen bzw. &uuml;bereinstimmende Identifizierer haben, gestapelt zeichnen.</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Supported_graph_types"><span class="tocnumber">1</span> <span class="toctext">Unterst&uuml;tzte Diagrammtypen</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Four_Cases_of_Batch_Plotting"><span class="tocnumber">2</span> <span class="toctext">Vier F&auml;lle des Stapelzeichnens</span></a><ul>
<li class="toclevel-2 tocsection-3"><a href="#Duplicate_with_new_books"><span class="tocnumber">2.1</span> <span class="toctext">Mit neuen Arbeitsmappen duplizieren</span></a><ul>
<li class="toclevel-3 tocsection-4"><a href="#Settings_for_matching_conditions"><span class="tocnumber">2.1.1</span> <span class="toctext">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></a></li>
<li class="toclevel-3 tocsection-5"><a href="#List_the_matching_books"><span class="tocnumber">2.1.2</span> <span class="toctext">&Uuml;bereinstimmende Mappen auflisten</span></a></li>
<li class="toclevel-3 tocsection-6"><a href="#Settings_for_result_graph"><span class="tocnumber">2.1.3</span> <span class="toctext">Einstellungen f&uuml;r Ergebnisdiagramm</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-7"><a href="#Duplicate_with_new_sheets"><span class="tocnumber">2,2</span> <span class="toctext">Mit neuen Arbeitsbl&auml;ttern duplizieren</span></a><ul>
<li class="toclevel-3 tocsection-8"><a href="#Settings_for_matching_conditions_2"><span class="tocnumber">2.2.1</span> <span class="toctext">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></a></li>
<li class="toclevel-3 tocsection-9"><a href="#List_the_matching_sheets"><span class="tocnumber">2.2.2</span> <span class="toctext">&Uuml;bereinstimmende Bl&auml;tter auflisten</span></a></li>
<li class="toclevel-3 tocsection-10"><a href="#Settings_for_result_graph_2"><span class="tocnumber">2.2.3</span> <span class="toctext">Einstellungen f&uuml;r Ergebnisdiagramm</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-11"><a href="#Duplicate_with_new_columns"><span class="tocnumber">2,3</span> <span class="toctext">Mit neuen Spalten duplizieren</span></a><ul>
<li class="toclevel-3 tocsection-12"><a href="#Settings_for_matching_conditions_3"><span class="tocnumber">2.3.1</span> <span class="toctext">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-13"><a href="#Duplicate_with_column_offset"><span class="tocnumber">2.4</span> <span class="toctext">Mit Spaltenversatz duplizieren</span></a><ul>
<li class="toclevel-3 tocsection-14"><a href="#Settings_for_matching_conditions_4"><span class="tocnumber">2.4.1</span> <span class="toctext">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<h2><a name="Supported_graph_types"></a><span class="mw-headline">Unterst&uuml;tzte Diagrammtypen</span></h2>
<ul><li>Stapelzeichnen ist nur f&uuml;r 2D-/3D-Diagramme in demselben Projekt und von demselben Datenquelltyp verf&uuml;gbar. <br /><b>Hinweis:</b> F&uuml;r die meisten der gruppierten 2D-Diagramme, die &uuml;ber das Men&uuml; Zeichnen erstellt werden, wird die Gruppierungsinfospalte als Modifiziererspalte und nicht als Datenspalte behandelt. </li>
<li>Beim Duplizieren mit neuen Spalten sollte jede Spalte eine <b>Diagrammzuordnung</b> von <b>Y</b> (f&uuml;r 2D) haben bzw. <b>Z</b> (f&uuml;r 3D oder Kontur) und sich in dem gleichen Arbeitsblatt befinden.</li>
<li>Beim Duplizieren mit neuen Bl&auml;ttern sollte jedes Blatt genau die gleiche Spaltenstruktur haben.</li>
<li>Beim Duplizieren mit neuen Mappen sollte jede Mappe genau die gleiche Blatt- und Spaltenstruktur haben.</li></ul>
<h2><a name="Four_Cases_of_Batch_Plotting"></a><span class="mw-headline">Vier F&auml;lle des Stapelzeichnens</span></h2>
<p><span class='headerInParagraph'>Um das Hilfsmittel Stapelzeichnen zu &ouml;ffnen:</span></p>
<ul><li> Klicken Sie mit der rechten Maustaste auf den Titelbalken des Diagramms oder eine beliebige leere Stelle um den Diagrammlayerrahmen und w&auml;hlen Sie <b>Stapelzeichnen...</b>.</li></ul>
<dl><dd><a  class="image"><img alt="Dialog Batch Plotting 01.png" src="../images/Batch_Plotting/Dialog_Batch_Plotting_01.png" width="639"  /></a></dd></dl>
<p>Sie k&ouml;nnen die Auswahlliste <b>Zeichnung stapeln mit</b> verwenden, um zwischen den unterschiedlichen Quelldaten zu wechseln und das aktuelle Diagramm zu duplizieren:</p>
<ul><li> <a href="#Duplicate_with_new_books">Aus Arbeitsmappen/Matrixmappen</a></li>
<li> <a href="#Duplicate_with_new_sheets">Aus Arbeitsbl&auml;ttern/Matrixbl&auml;ttern</a></li>
<li> <a href="#Duplicate_with_new_columns">Aus Arbeitsblattspalten</a></li>
<li> <a href="#Duplicate_with_column_offset">Aus Spaltenversatz</a></li></ul>
<p>Wenn Sie <b>Mappe/Blatt/Spalte</b> f&uuml;r die Option <b>Zeichnung stapeln mit</b> ausw&auml;hlen, werden die verf&uuml;gbaren Mappen/Bl&auml;tter/Spalten im mittleren leeren Feld jeweils aufgelistet.</p>
<h3><a name="Duplicate_with_new_books"></a><span class="mw-headline">Mit neuen Mappen duplizieren</span></h3>
<p>Wenn alle Zeichnungen in einer Grafik aus einer Mappe stammen, k&ouml;nnen Sie die Funktion Stapelzeichnen starten, um Ihre Grafik mit anderen Mappen zu duplizieren. Dabei ist die Auswahlliste <b>Zeichnung stapeln mit</b> auf <b>Mappe</b> gesetzt. Wie zu sehen, zeigt der Dialog Stapelzeichnen <b>Arbeitsmappe ausw&auml;hlen</b> in der Titelleiste, um auf den aktuellen Stapelmodus hinzuweisen.</p>
<dl><dd><a  class="image"><img alt="Dialog Batch Plotting.png" src="../images/Batch_Plotting/Dialog_Batch_Plotting.png" width="524"  /></a></dd></dl>
<h5><a name="Settings_for_matching_conditions"></a><span class="mw-headline">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></h5>
<table class="dialogcontroltable">

<tr>
<th> Exakt</th>
<td> Wenn diese Option aktiviert ist (Standard), werden nur die Mappen mit einer Blatt- und Spaltenstruktur wie diejenigen des aktiven Diagramms aufgelistet. Wenn die Mappe zus&auml;tzliche Bl&auml;tter oder Spalten enth&auml;lt (innerhalb eines gegebenen Blatts), werden sie beim Klonen eines Diagramms ignoriert. Wenn die Mappe weniger Bl&auml;tter enth&auml;lt als zum Erzeugen des aktiven Diagramms notwendig, wird die Mappe nicht aufgef&uuml;hrt.<br /><br />Wenn <b>Exakt</b> deaktiviert ist, werden Mappen, die die minimale Anzahl von Bl&auml;ttern, aber weniger Spalten als notwendig zum Erzeugen des aktiven Diagramms haben, eventuell angezeigt, abh&auml;ngig von der Einstellung von <b>Zeichnungsspalten stimmen &uuml;berein mit</b> (siehe n&auml;chsten Abschnitt).</td></tr>
<tr>
<th> Zeichnungsspalten/-bl&auml;tter <br />stimmen &uuml;berein mit</th>
<td> Durch W&auml;hlen von <b>Langname</b>, <b>Kurzname</b> oder <b>Spaltenindex</b> im Filter <b>Zeichnungsspalten stimmen &uuml;berein mit</b> sowie <b>Langname</b>, <b>Kurzname</b> oder <b>Index</b> im Filter <b>Blatt stimmt &uuml;berein mit</b> k&ouml;nnen Sie das Stapelzeichnen in zugewiesene Arbeitsmappen, die die gleiche Struktur wie die urspr&uuml;nglichen Arbeitsmappen haben, implementieren.</td></tr>
<tr>
<th>Modifizierer stimmen &uuml;berein mit</th>
<td>Diese Liste wird verwendet, um festzulegen, mit was die Modifizierer &uuml;bereinstimmen sollen (Arbeitsblattspalten der Werte, die zum Modifizieren der Zeichnung, z. B. Diagrammfarbe, verwendet werden). Hier ist die Standardauswahl dem Bedienelement <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Miscellaneous_Tab.html#Match_Modifier_by_.28for_template_and_copy_format.29" title="UserGuide:The (Plot Details) Miscellaneous Tab"><b>Modifizierer stimmen &uuml;berein mit</b></a> auf der Registerkarte <b>Allgemeines</b> des Dialogs <b>Details Zeichnung</b> verbunden. Nat&uuml;rlich k&ouml;nnen Sie Ihre eigenen Einstellungen f&uuml;r die aktuelle Routine vornehmen.</td></tr></table>
<h5><a name="List_the_matching_books"></a><span class="mw-headline">&Uuml;bereinstimmende Mappen auflisten</span></h5>
<p>Entsprechend dem ersten Teil der Filterbedingungen werden alle &uuml;bereinstimmenden Mappen im Projekt im mittleren Feld aufgef&uuml;hrt. Sie k&ouml;nnen Datens&auml;tze aus einer oder mehreren Mappen ausw&auml;hlen, um das Stapelzeichnen durchzuf&uuml;hren.</p>
<h5><a name="Settings_for_result_graph"></a><span class="mw-headline">Einstellungen f&uuml;r Ergebnisdiagramm</span></h5>
<table class="dialogcontroltable">

<tr>
<th>Achsen neu skalieren</th>
<td>Dieses Kontrollk&auml;stchen ist standardm&auml;&szlig;ig aktiviert. Deaktivieren Sie das Kontrollk&auml;stchen, um zu verhindern, dass bei &Auml;nderung der Eingabedaten die Achsen neu skaliert werden.</td></tr>
<tr>
<th>Farbabbildung ggf. neu skalieren</th>
<td>Dieses Kontrollk&auml;stchen ist standardm&auml;&szlig;ig aktiviert. Deaktivieren Sie das Kontrollk&auml;stchen, um zu verhindern, dass bei &Auml;nderung der Eingabedaten die Farbabbildung neu skaliert wird.</td></tr>
<tr>
<th> Zeichnung ausgew&auml;hlt f&uuml;r</th>
<td> Diese Liste wird verwendet, um festzulegen, wo die ausgew&auml;hlten Mappen gezeichnet werden. Mit dieser Option k&ouml;nnen Sie<dl><dd><ul><li> die ausgew&auml;hlten Mappen in das aktive Diagramm zeichnen, </li>
<li> jede Auswahl jeweils in ein einzelnes Diagramm zeichnen, </li>
<li> die ausgew&auml;hlten Mappen in ein neues Diagramm zeichnen. </li></ul></dd></dl>
</td></tr>
<tr>
<th> Diagrammkurzname</th>
<td> Diese Bearbeitungsfelder werden verwendet, um die duplizierten Diagrammkurznamen zu definieren.<dl><dd><ul><li> Der Standardwert &lt;Auto&gt; bedeutet, dass der duplizierte Diagrammkurzname als Graph<i>n</i> festgelegt wird, wobei <i>n</i> die Abfolgenummer des Diagrammfensters ist. </li>
<li> Es k&ouml;nnen Formatzeichenketten/Labtalk-Skripte eingegeben werden. Mehrere Notationen und beliebige festgelegte Zeichenketten k&ouml;nnen zudem nach Wunsch kombiniert werden. Au&szlig;erdem stellt die Schaltfl&auml;che <a  class="image"><img alt="Triangle button 01.png" src="../images/Batch_Plotting/Triangle_button_01.png" width="26"  /></a> rechts vom Bearbeitungsfeld einige der <a class="external text" href="../../LabTalk/LabTalk/Text_Label_Options.html">h&auml;ufig verwendeten Notationen</a> und Beispielsyntax zur Verf&uuml;gung. </li></ul></dd></dl>
</td></tr>
<tr>
<th> Diagrammlangname</th>
<td> Diese Bearbeitungsfelder werden verwendet, um die duplizierten Diagrammkurznamen zu definieren.<dl><dd><ul><li> Der Standard &lt;Auto&gt; bedeutet, den Langnamen als Kombination einer festen Zeichenkette &quot;Dupliziert mit&quot; sowie dem Quellenarbeitsmappen- und Blattnamen festzulegen.</li>
<li> Es k&ouml;nnen Formatzeichenketten/Labtalk-Skripte eingegeben werden. Mehrere Notationen und beliebige festgelegte Zeichenketten k&ouml;nnen zudem nach Wunsch kombiniert werden. Au&szlig;erdem stellt die Schaltfl&auml;che <a  class="image"><img alt="Triangle button 01.png" src="../images/Batch_Plotting/Triangle_button_01.png" width="26"  /></a> rechts vom Bearbeitungsfeld einige der <a class="external text" href="../../LabTalk/LabTalk/Text_Label_Options.html">h&auml;ufig verwendeten Notationen</a> und Beispielsyntax zur Verf&uuml;gung. </li></ul></dd></dl>
</td></tr></table>
<p><br /></p>
<h3><a name="Duplicate_with_new_sheets"></a><span class="mw-headline">Mit neuen Arbeitsbl&auml;ttern duplizieren</span></h3>
<p>Wenn alle Zeichnungen in einem Diagramm aus einem Blatt stammen, k&ouml;nnen Sie die Funktion Stapelzeichnen starten, um Ihr Diagramm mit anderen Bl&auml;ttern zu duplizieren. Dabei ist die Auswahlliste <b>Zeichnung stapeln mit</b> auf <b>Blatt</b> gesetzt. Wie zu sehen, zeigt der Dialog Stapelzeichnen <b>Arbeitsblatt ausw&auml;hlen</b> in der Titelleiste, um auf den aktuellen Stapelmodus hinzuweisen.</p>
<dl><dd><a  class="image"><img alt="Dialog Batch Plotting Sheet.png" src="../images/Batch_Plotting/Dialog_Batch_Plotting_Sheet.png" width="524"  /></a></dd></dl>
<h5><a name="Settings_for_matching_conditions_2"></a><span class="mw-headline">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></h5>
<table class="dialogcontroltable">

<tr>
<th> Exakt</th>
<td> Wenn diese Option aktiviert ist (Standard), werden nur die Bl&auml;tter mit einer Spaltenstruktur wie derjenigen des aktiven Diagramms aufgelistet. Wenn das Blatt zus&auml;tzliche Spalten enth&auml;lt, werden sie beim Klonen eines Diagramms ignoriert. Wenn das Blatt weniger Spalten enth&auml;lt als zum Erzeugen des aktiven Diagramms notwendig, wird das Blatt nicht aufgef&uuml;hrt.<br /><br />Wenn <b>Exakt</b> deaktiviert ist, werden Bl&auml;tter, die weniger Spalten als notwendig zum Erzeugen des aktiven Diagramms haben, eventuell angezeigt, abh&auml;ngig von der Einstellung von <b>Zeichnungsspalten stimmen &uuml;berein mit</b> (siehe n&auml;chsten Abschnitt). Beachten Sie, dass dies eine Methode ist, mit der Sie neue Zeichnungen zu einem <b>Aktiven Diagramm</b> hinzuf&uuml;gen k&ouml;nnen (siehe <b>Ausgew&auml;hlte zeichnen in</b>).</td></tr>
<tr>
<th> Zeichnungsspalten stimmen &uuml;berein mit</th>
<td> Durch W&auml;hlen von <b>Langname</b>, <b>Kurzname</b> oder <b>Spaltenindex</b> in diesem Filter k&ouml;nnen Sie das Stapelzeichnen in zugewiesenen Arbeitsbl&auml;ttern implementieren, die &uuml;ber die gleiche Struktur von <b>Langname</b>, <b>Kurzname</b> oder <b>Spaltenindex</b> verf&uuml;gen wie die urspr&uuml;nglichen Arbeitsbl&auml;tter.</td></tr>
<tr>
<th>Modifizierer stimmen &uuml;berein mit</th>
<td>Diese Liste wird beim Stapelzeichnen mit den ausgew&auml;hlten Arbeitsbl&auml;ttern verwendet, um festzulegen, mit was die Modifizierer &uuml;bereinstimmen sollen (Arbeitsblattspalten der Werte, die zum Modifizieren der Zeichnung, z. B. Diagrammfarbe, verwendet werden). Hier ist die Standardauswahl dem Bedienelement <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Miscellaneous_Tab.html#Match_Modifier_by_.28for_template_and_copy_format.29" title="UserGuide:The (Plot Details) Miscellaneous Tab"><b>Modifizierer stimmen &uuml;berein mit</b></a> auf der Registerkarte <b>Allgemeines</b> des Dialogs <b>Details Zeichnung</b> verbunden. Nat&uuml;rlich k&ouml;nnen Sie Ihre eigenen Einstellungen f&uuml;r die aktuelle Routine vornehmen.</td></tr></table>
<h5><a name="List_the_matching_sheets"></a><span class="mw-headline">&Uuml;bereinstimmende Bl&auml;tter auflisten</span></h5>
<p>Entsprechend dem ersten Teil der &uuml;bereinstimmenden Bedingungen werden alle &uuml;bereinstimmenden Bl&auml;tter im Projekt im mittleren Feld aufgef&uuml;hrt. Sie k&ouml;nnen Datens&auml;tze aus einem oder mehreren Bl&auml;ttern ausw&auml;hlen, um das Stapelzeichnens durchzuf&uuml;hren.</p>
<h5><a name="Settings_for_result_graph_2"></a><span class="mw-headline">Einstellungen f&uuml;r Ergebnisdiagramm</span></h5>
<p>Die Optionen sind die gleichen wie bei den <a href="../../UserGuide/UserGuide/Batch_Plotting.html#Settings_for_result_graph" title="UserGuide:Batch Plotting"><b>Einstellungen f&uuml;r Ergebnisdiagramm</b></a> in Mit neuen Mappen duplizieren.</p>
<table class="note">

<tr>
<td><b>Hinweis:</b> <a href="../../UserGuide/Category/Managing_Data_Plots_in_Layers.html#Changing_the_datasets_associated_with_a_plot" title="Category:Managing Data Plots in Layers"><b>Arbeitsblatt &auml;ndern</b></a> ist eine Funktion, die es Ihnen erm&ouml;glicht, ein bestehendes 2D-Diagramm mit Hilfe von Datens&auml;tzen aus einem anderen Blatt erneut zu erstellen. Sowohl <b>Stapelzeichnen mit neuen Bl&auml;ttern</b> als auch <b>Arbeitsblatt &auml;ndern</b> erfordern Bl&auml;tter mit genau der gleichen Spaltenstruktur, einschlie&szlig;lich Kurznamen, Diagrammzuordnung und Indizes. <b>Arbeitsblatt &auml;ndern</b> erm&ouml;glicht Ihnen, Datenzeichnungen innerhalb von einem Layer mit einem Kontextmen&uuml;befehl schnell zu &auml;ndern. <b>Arbeitsblatt &auml;ndern</b> kann eins-zu-eins auf jede Zeichnung in einem Layer, das mehrere Zeichnungen enth&auml;lt, angewendet werden. Diese Funktion ist verf&uuml;gbar, wenn Zeichnungen nicht &quot;gruppiert&quot; sind. Wenn Zeichnungen &quot;gruppiert&quot; <i>sind</i>, klicken Sie ein Mal, machen eine Pause, klicken ein zweites Mal, und diese Funktion wird verf&uuml;gbar (beachten Sie, dass Sie in diesem Modus noch immer nur eine Zeichnung ersetzen -- nicht die gesamte Zeichnungsgruppe).</td></tr></table>
<p><br /></p>
<h3><a name="Duplicate_with_new_columns"></a><span class="mw-headline">Mit neuen Spalten duplizieren</span></h3>
<p>Wenn die Zeichnung aus einer Y/Z-Spalte in dem Arbeitsblatt erstellt wurde, k&ouml;nnen Sie Ihre Zeichnung mit anderen Y/Z-Spalten in diesem Blatt duplizieren, wobei die Auswahlliste <b>Zeichnung stapeln mit</b> auf <b>Spalte</b> gesetzt ist. Wie zu sehen, zeigt der Dialog Stapelzeichnen <b>Spalte ausw&auml;hlen</b> in der Titelleiste, um auf den aktuellen Stapelmodus hinzuweisen. <br /></p>
<dl><dd><a  class="image"><img alt="Dialog Batch Plotting Column.png" src="../images/Batch_Plotting/Dialog_Batch_Plotting_Column.png" width="524"  /></a></dd></dl>
<h5><a name="Settings_for_matching_conditions_3"></a><span class="mw-headline">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></h5>
<table class="dialogcontroltable">

<tr>
<th> Verbundenes X verwenden / Verbundenes XY verwenden</th>
<td> Das Kontrollk&auml;stchen ist standardm&auml;&szlig;ig aktiviert. Wenn es aktiviert ist, verwenden neue Zeichnungen <a href="../../UserGuide/UserGuide/Set_Column_Designation.html" title="UserGuide:Set Column Designation">die X-Spalte(n), die mit der ausgew&auml;hlte(n) Y-Spalte(n) verbunden ist/sind</a>. Wenn dieses Kontrollk&auml;stchen deaktiviert ist, verwenden neue Zeichnungen die X/X&amp;Y-Spalte(n) der zu duplizierenden Zeichnung.</td></tr>
<tr>
<th>Modifizierer stimmen &uuml;berein mit</th>
<td>Dieses Kontrollk&auml;stchen und die zugeh&ouml;rige Auswahlliste werden verwendet, um festzulegen, wie die Modifizierer beim Stapelzeichnen mit ausgew&auml;hlten Spalten &uuml;bereinstimmen (die Spalten, die zum Steuern der Gruppierungsinfos, Diagrammfarbe oder anderer Diagrammeigenschaften verwendet werden). Hier folgt die Standardauswahl dem Bedienelement <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Miscellaneous_Tab.html#Match_Modifier_by_.28for_template_and_copy_format.29" title="UserGuide:The (Plot Details) Miscellaneous Tab"><b>Modifizierer stimmen &uuml;berein mit</b></a> auf der Registerkarte <b>Allgemeines</b> des Dialogs <b>Details Zeichnung</b>.<p>Bitte beachten Sie, dass Ihnen f&uuml;r diese Art von Stapelzeichnen die Auswahl von <i>&lt;Versatz&gt;</i> f&uuml;r diese Option sehr empfohlen wird, um die modifizierenden Spalten mit dem gleichen Spaltenversatz, angefangen bei der ausgew&auml;hlten Diagrammspalte, auszuw&auml;hlen. Jede Auswahl einer Spaltenbeschriftung bildet immer die Zeichnungseigenschaften auf die ersten geeigneten Spalten im aktuellen Arbeitsblatt ab.</p>
</td></tr></table>
<h3><a name="Duplicate_with_column_offset"></a><span class="mw-headline">Mit Spaltenversatz duplizieren</span></h3>
<p>Wenn die Zeichnung aus einer Y/Z-Spalte im Arbeitsblatt erstellt wurde, k&ouml;nnen Sie Ihre Zeichnung mit anderen Y/Z-Spalten in diesem Blatt duplizieren, wobei die Auswahlliste <b>Zeichnung stapeln mit</b> auf <b>Spaltenversatz</b> gesetzt ist. Wie zu sehen, zeigt der Dialog Stapelzeichnen <b>Spaltenversatz festlegen</b> in der Titelleiste, um den aktuellen Stapelmodus zu kennzeichnen. <br /></p>
<dl><dd><a  class="image"><img alt="Dialog Batch Plotting ColumnOffset.png" src="../images/Batch_Plotting/Dialog_Batch_Plotting_ColumnOffset.png" width="524"  /></a></dd></dl>
<h4><a name="Settings_for_matching_conditions_4"></a><span class="mw-headline">Einstellungen f&uuml;r &uuml;bereinstimmende Bedingungen</span></h4>
<table class="dialogcontroltable">

<tr>
<th> Column Offset</th>
<td> Legen Sie einen Versatz von der/n Spalte/n fest, der im Quelldiagramm verwendet wird, um die Spalten mit diesem Versatz per Stapelverarbeitung zu zeichnen. Wenn das Quelldiagramm beispielsweise ein Punktdiagramm mit den Y-Spalten D&amp;E enth&auml;lt, bedeutet ein <b>Spaltenversatz</b> = <i>+2</i>, dass die neuen Diagrammspalten F&amp;G sind. Ein <b>Spaltenversatz</b> = <i>-2</i> bedeutet, dass die neuen Diagrammspalten B&amp;C sind.</td></tr>
<tr>
<th> Anzahl der Vers&auml;tze</th>
<td> Legen Sie fest, wie viele Male per Stapelverarbeitung gezeichnet werden soll. Standardm&auml;&szlig;ig ist die Option <b>Auto</b> aktiviert, um zu berechnen, wie oft das Stapelzeichnen maximal durchgef&uuml;hrt werden soll.<p>Sie k&ouml;nnen das Kontrollk&auml;stchen <b>Auto</b> deaktivieren und einen kleineren Wert als den automatisch berechneten eingeben. Das Quelldiagramm verf&uuml;gt zum Beispiel &uuml;ber ein Punktdiagramm mit den Y-Spalten D&amp;E. Wenn die <b>Anzahl der Vers&auml;tze</b> nicht auf 1 gesetzt ist, wird das Stapelzeichnen mit den folgenden Spalten wiederholt. Ein <b>Spaltenversatz</b> = <i>+2</i> und eine <b>Anzahl der Vers&auml;tze</b> = <i>3</i> f&uuml;r das Quelldiagramm mit den Y-Spalten B&amp;C bedeutet, dass die neuen Diagrammspalten die Spalten D&amp;E, F&amp;G, H&amp;I sind.</p><p>Die automatische Berechnung f&uuml;r diese Option folgt den folgenden Regeln:</p>
<ul><li> Wenn <b>Modifizierer stimmen &uuml;berein mit</b> auf <i>&lt;Versatz&gt;</i> gesetzt ist, ber&uuml;cksichtigt die <b>Anzahl der Vers&auml;tze</b> die Modifiziererspalte, damit jede Datensatzkopie ihre Modifiziererspalte enth&auml;lt. </li>
<li> Wenn <b>Verbundenes X verwenden</b> deaktiviert ist und <b>&Uuml;bereinstimmung von X mit Versatz</b> aktiviert ist, ber&uuml;cksichtigt die <b>Anzahl der Vers&auml;tze</b> die X-Spalte, damit jede Datensatzkopie ihre X-Spalte enth&auml;lt.</li></ul>
</td></tr>
<tr>
<th> Verbundenes X verwenden / Verbundenes XY verwenden</th>
<td> Das Kontrollk&auml;stchen ist standardm&auml;&szlig;ig aktiviert. Wenn es aktiviert ist, verwenden neue Zeichnungen <a href="../../UserGuide/UserGuide/Set_Column_Designation.html" title="UserGuide:Set Column Designation">die X-Spalte(n), die mit der ausgew&auml;hlte(n) Y-Spalte(n) verbunden ist/sind</a>. Wenn dieses Kontrollk&auml;stchen deaktiviert ist, verwenden neue Zeichnungen die X/X&amp;Y-Spalte(n) der zu duplizierenden Zeichnung.</td></tr>
<tr>
<th> &Uuml;bereinstimmung von X mit Versatz</th>
<td> Dieses Kontrollk&auml;stchen ist standardm&auml;&szlig;ig abgeblendet und deaktiviert. Nur verf&uuml;gbar, wenn <b>Verbundenes X/XY verwenden</b> deaktiviert ist. Wenn die Option deaktiviert ist, verwenden Sie das urspr&uuml;ngliche X des Diagramms; wenn sie aktiviert ist, verwenden Sie den Versatz, um X zu bestimmen. Wie die Option <b>Verbundenes X verwenden</b> wird <b>&Uuml;bereinstimmung von X mit Versatz</b> auf Fehler, Beschriftung, Y-Spalten (zusammen mit Z gezeichnet) angewendet.</td></tr>
<tr>
<th>Modifizierer stimmen &uuml;berein mit</th>
<td>Dieses Kontrollk&auml;stchen und die zugeh&ouml;rige Auswahlliste werden verwendet, um festzulegen, wie die Modifizierer beim Stapelzeichnen mit ausgew&auml;hlten Spalten &uuml;bereinstimmen (die Spalten, die zum Steuern der Gruppierungsinfos, Diagrammfarbe oder anderer Diagrammeigenschaften verwendet werden). Hier folgt die Standardauswahl dem Bedienelement <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Miscellaneous_Tab.html#Match_Modifier_by_.28for_template_and_copy_format.29" title="UserGuide:The (Plot Details) Miscellaneous Tab"><b>Modifizierer stimmen &uuml;berein mit</b></a> auf der Registerkarte <b>Allgemeines</b> des Dialogs <b>Details Zeichnung</b>.<p>Bitte beachten Sie, dass Origin f&uuml;r diese Art von Stapelzeichnen den gleichen Spaltenversatz auf Modifiziererspalten anwendet, wenn <b>Modifizierer stimmen &uuml;berein mit</b> auf Versatz gesetzt ist; wenn &quot;Modifizierer stimmen &uuml;berein mit&quot; auf eine andere Option festgelegt ist, verwendet Origin die aktuelle &Uuml;bereinstimmungsregel, um den Modifizierer zu finden. In den meisten F&auml;llen ist es der gleiche wie im Quelldiagramm.</p>
</td></tr></table>







    