<h1 class="firstHeading">Dialog Grafikfenster zusammenf&uuml;gen</h1><p class='urlname' style='display: none'>GraphRef-MergeGraph</p>
<p><br /> Sie k&ouml;nnen den Dialog <b>Grafiken zusammenf&uuml;gen: merge_graph</b> im Men&uuml; &uuml;ber <b>Grafik: Grafikfenster zusammenf&uuml;gen</b> &ouml;ffnen, wenn ein Diagramm aktiv ist.</p><p><a  class="image"><img alt="Merge Graph Dialog Box1.png" src="../images/Merge_Graph_Dialog_Box/Merge_Graph_Dialog_Box1.png" width="710"  /></a></p><p>Diese Funktion verbindet die ausgew&auml;hlten Diagramme in einem neuen Diagrammfenster. In der neuen Grafik sind die Quelldiagramme <b>Zeile</b> f&uuml;r <b>Spalte</b> angeordnet.</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Graphs"><span class="tocnumber">1</span> <span class="toctext">Diagramme</span></a><ul>
<li class="toclevel-2 tocsection-2"><a href="#Flyout_Menu_Options"><span class="tocnumber">1.1</span> <span class="toctext">Optionen des Ausklappmen&uuml;s</span></a></li>
<li class="toclevel-2 tocsection-3"><a href="#Graph_Browser"><span class="tocnumber">1.2</span> <span class="toctext">Diagrammbrowser</span></a></li>
</ul>
</li>
<li class="toclevel-1 tocsection-4"><a href="#Keep_Source_Graphs"><span class="tocnumber">2</span> <span class="toctext">Quelldiagramme beibehalten</span></a></li>
<li class="toclevel-1 tocsection-5"><a href="#Rearrange_Layout"><span class="tocnumber">3</span> <span class="toctext">Layout neu anordnen</span></a></li>
<li class="toclevel-1 tocsection-6"><a href="#Arrange_Settings"><span class="tocnumber">4</span> <span class="toctext">Einstellungen Anordnung</span></a></li>
<li class="toclevel-1 tocsection-7"><a href="#Spacing"><span class="tocnumber">5</span> <span class="toctext">Abst&auml;nde</span></a></li>
<li class="toclevel-1 tocsection-8"><a href="#Page_Setup"><span class="tocnumber">6</span> <span class="toctext">Seite einrichten</span></a></li>
<li class="toclevel-1 tocsection-9"><a href="#Scale_Elements"><span class="tocnumber">7</span> <span class="toctext">Elemente skalieren</span></a></li>
<li class="toclevel-1 tocsection-10"><a href="#Add_Label"><span class="tocnumber">8</span> <span class="toctext">Beschriftungen hinzuf&uuml;gen</span></a></li>
</ul>
</div>

<h2><a name="Graphs"></a><span class="mw-headline">Diagramme</span></h2>
<p>Listet die Diagramme <i>in der Reihenfolge</i> auf, in der sie zusammengef&uuml;gt werden. Mit den Schaltfl&auml;chen oberhalb der Box k&ouml;nnen Diagramme ausgew&auml;hlt und sortiert werden. Beachten Sie das Ausklappmen&uuml; f&uuml;r die Diagrammauswahl.</p>
<dl><dd><a  class="image"><img alt="Merge Graph Dialog Box Graphs Controls.png" src="../images/Merge_Graph_Dialog_Box/Merge_Graph_Dialog_Box_Graphs_Controls.png" width="588"  /></a></dd></dl>
<h3><a name="Flyout_Menu_Options"></a><span class="mw-headline">Optionen des Ausklappmen&uuml;s</span></h3>
<table class="dialogcontroltable">

<tr>
<th>Aktive Seite</th>
<td>Alle Diagramme auf der aktiven Seite</td></tr>
<tr>
<th>Alle im aktiven Ordner</th>
<td>Alle Diagramme im aktiven Ordner, ohne Unterordner</td></tr>
<tr>
<th>Alle im aktiven Ordner (Rekursiv)</th>
<td>Alle Diagramme im aktiven Ordner, einschlie&szlig;lich Unterordner</td></tr>
<tr>
<th>Alle im aktiven Ordner (Offen)</th>
<td>Alle offenen Diagramme im aktiven Ordner</td></tr>
<tr>
<th>Alle im aktiven Ordner (einschlie&szlig;lich Eingebetteten)</th>
<td>Alle Diagramme im aktiven Ordner, einschlie&szlig;lich eingebetteten Diagrammen.</td></tr>
<tr>
<th>Alle im Projekt</th>
<td>Alle Diagramme im aktuellen Projekt</td></tr>
<tr>
<th>Diagrammbrowser ...</th>
<td>&Ouml;ffnet den Diagrammbrowser (siehe n&auml;chsten Abschnitt).</td></tr></table>
<h3><a name="Graph_Browser"></a><span class="mw-headline">Diagrammbrowser</span></h3>
<p>Der <b>Diagrammbrowser</b> wird zum Hinzuf&uuml;gen der Diagramme in die Liste <b>Diagramme</b> verwendet. Mit Hilfe der Auswahlliste zum Filtern von Ordnern in der oberen linken Ecke k&ouml;nnen Sie alle Diagramme im Ordner durchsuchen und dann mit den Schaltfl&auml;chen <a  class="image"><img alt="Button Expand Panel Right.png" src="../images/Merge_Graph_Dialog_Box/Button_Expand_Panel_Right.png" width="20"  /></a> und <a  class="image"><img alt="Button Expand Panel Left.png" src="../images/Merge_Graph_Dialog_Box/Button_Expand_Panel_Left.png" width="20"  /></a> Diagramme aus der Liste <b>Diagramme</b> entfernen oder zu ihr hinzuf&uuml;gen.</p>
<dl><dd><a  class="image"><img alt="Merge Graph Dialog Box Browser.png" src="../images/Merge_Graph_Dialog_Box/Merge_Graph_Dialog_Box_Browser.png" width="648"  /></a></dd></dl>
<p><br /> <i><b>Einige wissenswerte Fakten:</b></i></p>
<ul><li> Durch Aktivieren des Kontrollk&auml;stchens <b>Eingebettetes Diagramm zeigen</b> k&ouml;nnen Sie die Diagramme durchsuchen und einschlie&szlig;en, die in Arbeitsbl&auml;ttern eingebettet waren (und vielleicht gar nicht mehr als alleinstehende Diagramme existieren).</li>
<li> Sie k&ouml;nnen Diagramme im rechten Bedienfeld sortieren oder neu ordnen durch (a) Klicken auf die &Uuml;berschrift <b>Name</b> oder durch (b) Ziehen an der Schaltfl&auml;che gleich links vom <b>Namen</b> des Diagramms.</li></ul>
<h2><a name="Keep_Source_Graphs"></a><span class="mw-headline">Quelldiagramme beibehalten</span></h2>
<p>Bestimmt, ob die Quelldiagramme beibehalten werden sollen, nachdem sie zusammengef&uuml;gt wurden.</p>
<h2><a name="Rearrange_Layout"></a><span class="mw-headline">Layout neu anordnen</span></h2>
<p>Bestimmt, ob die Layer, die zu Diagrammen mit mehreren Layer geh&ouml;ren, neu angeordnet werden sollen.</p><p>Beachten Sie, dass, wenn Grafiken mit mehreren Layern zusammengef&uuml;gt werden, die verkn&uuml;pfte Layer enthalten, jede Grafik als eine Einheit behandelt wird. Dadurch bleiben die Verkn&uuml;pfungen innerhalb der einzelnen Grafiken bewahrt.</p>
<dl><dd><dl><dd><a  class="image"><img alt="Merge linked layer graphs.png" src="../images/Merge_Graph_Dialog_Box/Merge_linked_layer_graphs.png" width="370"  /></a></dd></dl></dd></dl>
<h2><a name="Arrange_Settings"></a><span class="mw-headline">Anordnungseinstellungen</span></h2>
<p>Einstellungen zum Anordnen der Layer</p>
<table class="dialogcontroltable">

<tr>
<th>Anzahl der Zeilen</th>
<td>Bestimmt die Anzahl der Zeilen im neuen Diagramm. Die Diagramme werden in einem Gitter Zeile f&uuml;r Spalte im neuen Fenster angeordnet.</td></tr>
<tr>
<th>Anzahl der Spalten</th>
<td>Bestimmt die Anzahl der Spalten im neuen Diagramm. Die Diagramme werden in einem Gitter Zeile f&uuml;r Spalte im neuen Fenster angeordnet.</td></tr>
<tr>
<th> Richtung</th>
<td>
<p>Dieses Hilfsmittel legt die Richtung zum Anordnen der Diagrammlayer im festgelegten Gitternetz fest.</p>
<ul><li>Horizontal zuerst<dl><dd>Layer zuerst in horizontaler Richtung anordnen</dd></dl></li>
<li>Vertikal zuerst<dl><dd>Layer zuerst in vertikaler Richtung anordnen</dd></dl></li></ul>
</td></tr>
<tr>
<th> Alternative Seite zum Zeigen von Hilfsstrichen und Beschriftungen verwenden</th>
<td>
<p>Legt fest, ob die Achsenhilfsstriche und Beschriftungen links und rechts (oben und unten) abwechselnd in den Diagrammlayern gezeigt werden sollen.</p>
<table class="notes">

<tr>
<td>
<p><b>Hinweis</b>: Diese Variable ist nur im Stapeldiagramm verf&uuml;gbar. Das bedeutet, das entweder die <b>Anzahl der Zeilen</b> oder die <b>Anzahl der Spalten</b> <b>1</b> sein muss, aber nicht beide. <br />Wenn die <b>Anzahl der Spalten</b> = 1 und die <b>Anzahl der Zeilen</b> &gt; 1, dann werden die Layer vertikal gestapelt und die Layer zeigen die Y-Achse links und rechts abwechselnd an. <br />Wenn die <b>Anzahl der Zeilen</b> = 1 und die <b>Anzahl der Spalten</b> &gt; 1, dann werden die Layer horizontal gestapelt und die Layer zeigen die X-Achse links und rechts abwechselnd an.</p>
</td></tr></table>
</td></tr>
<tr>
<th>Weitere(n) Layer f&uuml;r das Gitter hinzuf&uuml;gen</th>
<td>Bestimmt, ob neue Layer f&uuml;r leere Gitter hinzugef&uuml;gt werden sollen, wenn die Anzahl der Quelldiagramme kleiner ist als das Produkt der Werte der Zeilenvariable und der Spaltenvariable.</td></tr>
<tr>
<th>Layerverh&auml;ltnis beibehalten</th>
<td>Bestimmt, ob das urspr&uuml;ngliche Seitenverh&auml;ltnis der Diagrammlayer beibehalten werden soll.</td></tr>
<tr>
<th>Jedes Quelldiagramm als eine Einheit behandeln</th>
<td>Wenn dieses Kontrollk&auml;stchen aktiviert ist, werden alle Layer des gleichen Quelldiagramms beim Zusammenf&uuml;gen von Grafiken als eine Einheit behandelt. Nicht verkn&uuml;pfte Layer im Quelldiagramm werden mit dem urspr&uuml;nglichen <i>Layer1</i> verkn&uuml;pft.<p>Dieses Bedienelement ist verf&uuml;gbar, wenn <a href="#Rearrange_Layout"><b>Layout neu anordnen</b></a> aktiviert worden ist.</p>
</td></tr>
<tr>
<th>Quelldiagramme verkn&uuml;pfen</th>
<td>Alle nicht verkn&uuml;pften Layer werden mit <i>Layer1</i> in dem zusammengef&uuml;gten Diagramm verkn&uuml;pft. Die verkn&uuml;pften Layer bleiben mit dem Layer verkn&uuml;pft, mit dem sie vor dem Zusammenf&uuml;gen verkn&uuml;pft waren.<p><b>Hinweis:</b> Das Aktivieren von sowohl <b>Jedes Quelldiagramm als eine Einheit behandeln</b> und <b>Quelldiagramme verkn&uuml;pfen</b> f&uuml;hrt dazu, dass:</p>
<ul><li> Nicht verkn&uuml;pfte Layer in jedem Quelldiagramm mit <i>Layer1</i> des Quelldiagramms verkn&uuml;pft werden.</li>
<li> <i>Layer1</i> jedes Quelldiagramms mit  <i>Layer1</i> des zusammengef&uuml;gten Diagramms verkn&uuml;pft wird.</li></ul>
</td></tr>
<tr>
<th>Layerbreite nach gemeinsamer Skalierung festlegen</th>
<td>
<p>Die Breite jedes Layers wird mit Hilfe einer gemeinsamen Skalierung bestimmt. Beim Zeichnen von gestapelten Balkendiagrammen wird beispielsweise eine gemeinsame Skalierung erzeugt, die den direkten visuellen Vergleich der Balkenl&auml;nge layer&uuml;bergreifend erm&ouml;glicht. Im Gegensatz dazu zeigen zwei Achsen mit den gleichen physikalischen Dimensionen m&ouml;glicherweise sehr unterschiedliche Skalierungsbereiche, wenn diese Option nicht aktiviert ist.</p><p>Dieses Bedienelement ist nicht verf&uuml;gbar, wenn <a href="#Rearrange_Layout"><b>Layout neu anordnen</b></a> aktiviert wurde und <a href="#Page_Setup"><b>Ausrichtung</b></a> auf <b>Auto</b> gesetzt ist.</p>
</td></tr>
<tr>
<th>Layerh&ouml;he nach gemeinsamer Skalierung festlegen</th>
<td>
<p>Die H&ouml;he jedes Layers wird mit Hilfe einer gemeinsamen Skalierung bestimmt. Beim Zeichnen von gestapelten S&auml;ulendiagrammen wird beispielsweise eine gemeinsame Skalierung erzeugt, die den direkten visuellen Vergleich der S&auml;ulenl&auml;nge layer&uuml;bergreifend erm&ouml;glicht. Im Gegensatz dazu zeigen zwei Achsen mit den gleichen physikalischen Dimensionen m&ouml;glicherweise sehr unterschiedliche Skalierungsbereiche, wenn diese Option nicht aktiviert ist.</p><p>Dieses Bedienelement ist nicht verf&uuml;gbar, wenn <a href="#Rearrange_Layout"><b>Layout neu anordnen</b></a> aktiviert wurde und <a href="#Page_Setup"><b>Ausrichtung</b></a> auf <b>Auto</b> gesetzt ist.</p>
</td></tr>
<tr>
<th>Achsenrahmen zeigen</th>
<td>Dieses Kontrollk&auml;stchen legt fest, ob Achsenrahmen gezeigt und Achsen/Hilfsstriche der Diagramme verborgen werden, wenn sich Achsen/Hilfsstriche &uuml;berschneiden.</td></tr></table>
<h2><a name="Spacing"></a><span class="mw-headline">Abst&auml;nde</span></h2>
<table class="dialogcontroltable">

<tr>
<th>Einheit</th>
<td>Legt eine Einheit f&uuml;r die Abst&auml;nde und R&auml;nder unten fest. Unterst&uuml;tzte Einheiten: <b>% der Seite</b>, <b>Zoll</b>, <b>cm</b>, <b>mm</b>, <b>Pixel</b> und <b>Punkt</b>.</td></tr>
<tr>
<th>Horizontaler Abstand</th>
<td>Bestimmt den horizontalen Abstand zwischen benachbarten Layern.</td></tr>
<tr>
<th>Vertikaler Abstand</th>
<td>Bestimmt den vertikalen Abstand zwischen benachbarten Layern.</td></tr>
<tr>
<th>Linker Rand</th>
<td>Bestimmt den linken Rand zur neuen Diagrammseite.</td></tr>
<tr>
<th>Rechter Rand</th>
<td>Bestimmt den rechten Rand zur neuen Diagrammseite.</td></tr>
<tr>
<th>Oberer Rand</th>
<td>Bestimmt den oberen Rand zur neuen Diagrammseite.</td></tr>
<tr>
<th>Unterer Rand</th>
<td>Bestimmt den unteren Rand zur neuen Diagrammseite.</td></tr></table>
<h2><a name="Page_Setup"></a><span class="mw-headline">Seite einrichten (Page Setup):</span></h2>
<table class="noborder">
	<tr>
	<td style="vertical-align:top" width="60"><img src="../images/Merge_Graph_Dialog_Box/Alert_icon.png" width="57"  border="0" /></td><td><p>Eine neue Standardeinstellung f&uuml;r <b>Ausrichtung</b> -- <i>Auto</i> -- wurde mit <b>Origin 2021b</b> eingef&uuml;hrt. Wie unten beschrieben, erh&ouml;ht dies die Dimensionen der Seite. Um Diagramme auf einer Seite mit den gleichen Dimensionen wie die urspr&uuml;nglichen Diagramme zusammenzuf&uuml;gen, setzen Sie <b>Ausrichtung</b> auf <i>Querformat</i> oder <i>Hochformat</i>.</p>
	</td>
	</tr>
	</table>
<table class="dialogcontroltable">

<tr>
<th>Ausrichtung</th>
<td>Bestimmt die Ausrichtung f&uuml;r die neue Diagrammseite, einschlie&szlig;lich:<ul><li>Auto</li>
<li>Querformat</li>
<li>Hochformat</li></ul>
<p><b>Auto</b> ist per Standard ausgew&auml;hlt. Das bedeutet, das die Layergr&ouml;&szlig;e von den zusammengef&uuml;gten Diagrammen beibehalten wird. Die Seitenh&ouml;he und -breite wird durch die Summe der Layergr&ouml;&szlig;e und -abst&auml;nde gesteuert.</p>
</td></tr>
<tr>
<th>Breite</th>
<td>Bestimmt die Breite der neuen Diagrammseite. Die Option steht nicht zur Verf&uuml;gung und zeigt nur die Breite der Seite, wenn Sie <b>Auto</b> unter <b>Ausrichtung</b> ausw&auml;hlen.</td></tr>
<tr>
<th>H&ouml;he</th>
<td>Bestimmt die H&ouml;he der neuen Diagrammseite. Die Option steht nicht zur Verf&uuml;gung und zeigt nur die H&ouml;he der Seite, wenn Sie <b>Auto</b> unter <b>Ausrichtung</b> ausw&auml;hlen.</td></tr>
<tr>
<th>Einheit</th>
<td>Bestimmt die Einheit f&uuml;r die neue Diagrammseite.</td></tr></table>
<table class="note">

<tr>
<td><b>Hinweis:</b> Wenn Sie eine 1x1-Anordnung (1 Zeile, 1 Spalte) von 2 oder mehr Diagrammen und <b>Ausrichtung</b> = <i>Auto</i> festlegen (d. h., mehrere Layer &uuml;berschneiden sich), verwendet Origin die maximale Breiten- und H&ouml;hendimensionen der sich &uuml;berschneidenden Layer/Diagramme.</td></tr></table>
<h2><a name="Scale_Elements"></a><span class="mw-headline">Elemente skalieren</span></h2>
<table class="dialogcontroltable">

<tr>
<th>Skalierungsmodus</th>
<td>Bestimmt, wie Achsen, Achsenbeschriftungen, Legenden, Diagramme und andere Objekte, die mit dem Layerbereich oder dem Layer und den Skalierungen verbunden sind, von einer Gr&ouml;&szlig;en&auml;nderung eines Layers in der neuen Diagrammseite beeinflusst werden.<ul><li><b>Auto:</b> Verwendet die Einstellungen in den Quelldiagrammen.</li>
<li><b>Mit Layerrahmen skalieren</b>: Skalieren der Layerelemente proportional zum Layer.</li>
<li><b>Fester Faktor</b>: Bestimmt die Gr&ouml;&szlig;e der Layerelemente in Relation zu ihrer urspr&uuml;nglichen Gr&ouml;&szlig;e (Schriftgr&ouml;&szlig;e, Symbolgr&ouml;&szlig;e und Linienbreite usw.). Die Gr&ouml;&szlig;e dieser Elemente wird durch Multiplizieren ihrer urspr&uuml;nglichen Gr&ouml;&szlig;e mit dem Skalierungsfaktor, der im Textfeld <b>Fester Faktor</b> eingegeben wurde, bestimmt.</li></ul>
</td></tr>
<tr>
<th>Fester Faktor</th>
<td>Diese Variable ist nur verf&uuml;gbar, wenn die Variable f&uuml;r den <b>Skalierungsmodus</b> auf <b>Fester Faktor</b> gesetzt ist. Sie bestimmt den festen Faktor der Skalierung.</td></tr></table>
<table class="note">
<tr>
<td><b>Hinweis:</b> Wenn Sie einen festen Faktor in der <a href="../../UserGuide/UserGuide/The_(Plot_Details)_Size_Speed_Tab.html#Scale_Elements_Group" title="UserGuide:The (Plot Details) Size Speed Tab">Gruppe <b>Skalierungselemente</b> auf der Registerkarte <b>Gr&ouml;&szlig;e</b> im Dialog <b>Details Zeichnung</b></a> f&uuml;r den Diagrammlayer festgelegt haben, wird der <b>Feste Faktor</b> mit <b>1</b> &uuml;berschritten, wenn Sie das Diagramm mit anderen zusammenf&uuml;gen und <b>Ausrichtung</b> = <b>Auto</b> im Zweig <a href="#Page_Setup"><b>Seite einrichten</b></a> setzen.</td></tr></table>
<h2><a name="Add_Label"></a><span class="mw-headline">Beschriftung hinzuf&uuml;gen</span></h2>
<table class="dialogcontroltable">

<tr>
<th>Beschriftungstext</th>
<td>Bedienelemente zum Hinzuf&uuml;gen und Formatieren von Beschriftungen f&uuml;r zusammengef&uuml;gte Diagramme<ul><li><b>Kein</b>: Es werden keine Beschriftungen zu den Diagrammen hinzugef&uuml;gt.</li>
<li><b>A</b>: Die Beschriftungen werden in Gro&szlig;buchstaben angezeigt (<b>A</b>, <b>B</b>, <b>C</b>...).</li>
<li><b>a</b>: Die Beschriftungen werden in Kleinbuchstaben angezeigt (<b>a</b>, <b>b</b>, <b>c</b>...).</li>
<li><b>Benutzerdefiniert</b>: Die Beschriftung wird indem Textfeld unten definiert. </li></ul>
</td></tr>
<tr>
<th>Benutzerdefiniert</th>
<td>Dieses Textfeld ist verf&uuml;gbar, wenn nur <b>Benutzerdefiniert</b> in der Auswahlliste <b>Beschriftungstext</b> ausgew&auml;hlt wird. Legen Sie die benutzerdefinierten Beschriftungstexte fest.<ul><li> Wenn Sie <b>a$</b> und <b>A$</b> ausw&auml;hlen, werden die Gro&szlig;- und Kleinbuchstaben nummeriert, um die zusammengef&uuml;gten Layer zu beschriften, zum Beispiel (<b>a</b>, <b>b</b>, <b>c</b>...) und (<b>A</b>, <b>B</b>, <b>C</b>...).</li></ul>
<ul><li> Wenn Sie <b>r$</b> und <b>R$</b> ausw&auml;hlen, werden die gro&szlig;en und kleinen r&ouml;mischen Zahlen nummeriert, um die zusammengef&uuml;gten Layer zu beschriften, zum Beispiel (<b>i</b>, <b>ii</b>,<b>iii</b>...) und (<b>I</b>, <b>II</b>, <b>III</b>...).</li></ul>
<ul><li> Wenn Sie <b>n$</b> ausw&auml;hlen, wird der Layerindex nummeriert, um Layer zu beschriften, zum Beispiel (1, 2, 3...). </li></ul>
<ul><li> Wenn Sie <b>h$</b> ausw&auml;hlen, wird das Zeichen <b>#</b> zu den Layern hinzugef&uuml;gt.</li></ul>
<ul><li> Wenn Sie <b>Diagramm ##</b> im Textfeld <b>Benutzerdefiniert</b> ausw&auml;hlen. Es werden Beschriftungen in der Form <b>Graph 01</b>, <b>Graph 02</b>, <b>Graph 03</b> etc. zu den Diagrammen hinzugef&uuml;gt.</li></ul>
<ul><li> Das <a class="external text" href="../../LabTalk/LabTalk/String_registers.html">Zeichenkettenregister</a> <b>%H</b> speichert den Namen des aktiven Fenstertitels. W&auml;hlen Sie diese Option, um mit dem Fensterkurznamen zu beschriften. Beachten Sie, dass diese Beschriftung statisch ist. Wenn der Titel des Quellfensters sich &auml;ndert, werden die Textbeschriftungen nicht aktualisiert.</li></ul>
<p>Das Kontrollk&auml;stchen Substitution aktivieren ist standardm&auml;&szlig;ig aktiviert. <a class="external text" href="../../LabTalk/Category/Substitution_Notation.html">Substitutionsnotation</a> und Nummerierungscode werden unterst&uuml;tzt. F&uuml;r den Nummerierungscode nummerieren <b>%(u$)</b> und <b>%(v$)</b> Gro&szlig;- bzw. Kleinbuchstaben. <b>$(i)</b> und <b>#</b> nummerieren den Index. <b>%(p$)</b> stellen das Zeichen <b>#</b> dar.</p>
</td></tr>
<tr>
<th>Beschriftungsposition</th>
<td>Hier legen Sie die Beschriftungsposition fest. Die Beschriftungen k&ouml;nnen <b>Oben Links Au&szlig;en</b>, <b>Oben Links Innen</b>, <b>Oben Rechts Au&szlig;en</b>, <b>Oben Rechts Innen</b>, <b>Oben Mitte Innen</b>, <b>Oben Mitte Au&szlig;en</b> oder <b>Unten Mitte Au&szlig;en</b> angezeigt werden.</td></tr></table>



    