<h1 class="firstHeading">Diagramme in andere Anwendungen einf&uuml;gen oder einbetten</h1><p class='urlname' style='display: none'>Paste-Embed-OLE</p>
<p>Es gibt <b>zwei M&ouml;glichkeiten</b>, wie Sie Origin-Diagramme in andere Anwendungsdateien einbinden k&ouml;nnen -- als <b>Bild</b> oder durch Verwendung von <b>OLE </b>(<b>O</b>bjektverkn&uuml;pfung und <b>E</b>inbettung):</p>
<ul><li>Wenn Sie Ihr Origin-Diagramm als Bild einbinden m&ouml;chten, kann es nicht mit Origin-Hilfsmitteln bearbeitet werden.</li>
<li>Wenn Sie Ihr Diagramm mit Hilfe von OLE einbinden m&ouml;chten, kann das Diagramm mit den Origin-Hilfsmitteln bearbeitet werden (Sie k&ouml;nnen generell ein Bild in einer Zielanwendung bearbeiten, wenn Sie deren Bildanwendungshilfsmittel verwenden, das ist aber nicht dasselbe). Wenn Sie Ihr Origin-Diagramm einbetten, enth&auml;lt die Zieldatei eine Kopie des Diagrammobjekts.  </li></ul>
<p>Wenn Sie Ihr Diagramm in einer Zieldatei als OLE-Objekt einbinden, agiert Origin als OLE-Server.</p>
<div id="toc" class="toc"><div id="toctitle"><h2>Inhalt</h2></div>
<ul>
<li class="toclevel-1 tocsection-1"><a href="#Copy.2FPaste_Graph_as_Image"><span class="tocnumber">1</span> <span class="toctext">Diagramm als Bild kopieren/einf&uuml;gen</span></a></li>
<li class="toclevel-1 tocsection-2"><a href="#Embed_your_graph_in_another_application"><span class="tocnumber">2</span> <span class="toctext">Diagramm in eine andere Anwendung einbetten</span></a><ul>
<li class="toclevel-2 tocsection-3"><a href="#How_to_Embed_Graphs"><span class="tocnumber">2.1</span> <span class="toctext">Diagramme einbetten</span></a></li>
<li class="toclevel-2 tocsection-4"><a href="#Edit_an_embedded_graph"><span class="tocnumber">2.2</span> <span class="toctext">Eingebettetes Diagramm bearbeiten</span></a></li>
</ul>
</li>
</ul>
</div>

<h2><a name="Copy.2FPaste_Graph_as_Image"></a><span class="mw-headline">Diagramm als Bild kopieren/einf&uuml;gen</span></h2>
<p>Kopieren Sie das Diagramm in die Zwischenablage ohne Verwendung von OLE. Das Diagramm wird dann als Bild in andere Anwendungen eingef&uuml;gt.</p><p><span class='headerInParagraph'>Um ein Diagramm als Bild zu kopieren, k&ouml;nnen Sie:</span></p>
<ol>
<li>Klicken Sie auf die Schaltfl&auml;che <b>Diagramm als Bild kopieren</b> <a  class="image"><img alt="Copy Graph as Image button.png" src="../images/Pasting_or_Embedding_Graphs_in_other_Applications/Copy_Graph_as_Image_button.png" width="27"  /></a> auf der Minisymbolleiste des Diagramms. <br /><i>oder</i> <br />W&auml;hlen Sie <b>Bearbeiten: Diagramm als Bild kopieren</b> im Men&uuml;. <br /><i>oder</i> <br />Klicken Sie mit der rechten Maustaste auf das Diagramm und w&auml;hlen Sie im Kontextmen&uuml; <b>Kopieren: Diagramm als Bild kopieren</b>. <br /><i>oder</i> <br />Aktivieren Sie das Diagrammfenster und dr&uuml;cken Sie <b>Strg + Alt + J</b>. <br /><br /><li>Im <a class="external text" href="../../XFunction/X-Function/Copyimg.html">Dialog <b>Diagramm als Bild kopieren</b></a> k&ouml;nnen Sie das Bildformat benutzerdefiniert anpassen (<i>PNG</i>, <i>EMF</i>, <i>DIB</i>, <i>HTML</i> und <i>JPEG</i>). Klicken Sie dann auf die Schaltfl&auml;che <b>Kopieren</b>.<dl><dd><a  class="image"><img alt="Copy Graph as Image.png" src="../images/Pasting_or_Embedding_Graphs_in_other_Applications/Copy_Graph_as_Image.png" width="290"  /></a></dd></dl><br /><li>Dr&uuml;cken Sie in der Zielanwendung (wie Microsoft® Word) die Tasten <b>Strg + V</b> oder klicken Sie auf die Schaltfl&auml;che <b>Einf&uuml;gen</b>.</ol>
<p><br /></p>
<table class="note">

<tr>
<td><b>Hinweis:</b> Exakt das gleiche Ergebnis wird durch folgende Methode erzielt:<ul><li><b>Strg + C</b> (Origin) =&gt; <b>Strg + V</b> (MS Word).</li></ul>
<p>Sie k&ouml;nnen <b>Einstellungen &gt; Optionen &gt; Seite</b> &ouml;ffnen, um <b>Strg + C</b> zum Kopieren von OLE festzulegen.</p>
</td></tr></table>
<h2><a name="Embed_your_graph_in_another_application"></a><span class="mw-headline">Diagramm in eine andere Anwendung einbetten</span></h2>
<p>Sie k&ouml;nnen Origin-Diagramme mit OLE-kompatiblen Anwendungen durch <b>Einbetten</b> Ihrer Diagramme teilen. Wenn Sie die Diagramme in anderen Anwendungen einbetten, k&ouml;nnen Sie die Diagramme mit Hilfe von Origins Hilfsmittel bearbeiten.</p><p>Bitte bedenken Sie, wenn Sie Ihr Diagramm in anderen Anwendungsdateien <b>einbetten</b>, werden die Daten in der Zieldatei gespeichert -- nicht in der Origin-Datei. Ein nachtr&auml;gliches Bearbeiten des Diagramms kann mit einem Doppelklick auf das Diagramm in der Zieldatei ausgef&uuml;hrt werden.  <b>Hauptvorteil:</b> Dies erstellt eine einzelne eigenst&auml;ndige Datei.</p>
<h3><a name="How_to_Embed_Graphs"></a><span class="mw-headline">Diagramme einbetten</span></h3>
<p>Origin liefert Ihnen drei Methoden, Ihr Diagramm in eine OLE-kompatible Datei einzubetten.</p><p><br /> <span class='headerInParagraph'>Ihr Diagramm mit Hilfe der Zwischenablage durch Einf&uuml;gen in eine andere Datei einbetten:</span></p><p>Das Diagramm muss nicht in einem Diagrammfenster (*.OGG(U)) oder in einer Projektdatei (*.OPJ(U)) gespeichert werden. (Die Inhalte der aktuellen Origin-Sitzung m&uuml;ssen nicht gespeichert werden.)</p>
<ol><li>In Origin w&auml;hlen Sie <b>Bearbeiten: Seite kopieren</b>.  </li>
<li>In der Zielanwendung (wie z.B. Microsoft® Word) w&auml;hlen Sie <b>Bearbeiten: Inhalte einf&uuml;gen</b>. In Word &ouml;ffnet dieser Men&uuml;befehl den Dialog <b>Inhalte einf&uuml;gen</b>.  </li>
<li>W&auml;hlen Sie <b>Origin-Diagrammobjekt</b> aus der Liste <b>Einf&uuml;gen als </b>aus.  </li>
<li>Klicken Sie auf die Option <b>Einf&uuml;gen</b>.  </li>
<li>Klicken Sie auf <b>OK</b>.  </li></ol>
<p>Ihr Diagramm wird in der Zielanwendung als Objekt angezeigt.</p><p><br /></p>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Pasting_or_Embedding_Graphs_in_other_Applications/Tip_icon.png" width="57"  border="0" /></td><td><p>Lesen Sie wichtige Informationen zum Kopieren und Einf&uuml;gen einer Grafik in eine andere Anwendung in der Dokumentation <a href="../../UserGuide/UserGuide/The_(Options)_Page_Tab.html#Copy.2FExport_Page_Settings_Group" title="UserGuide:The (Options) Page Tab"><b>Gruppe Seitenkopier-/exporteinstellungen</b></a>.</p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Pasting_or_Embedding_Graphs_in_other_Applications/Tip_icon.png" width="57"  border="0" /></td><td><p>Die OLE-Einbettung wird nicht von <a href="../../UserGuide/UserGuide/Creating_a_master_Page_Layout_for_Graphs.html" title="UserGuide:Creating a master Page Layout for Graphs">Origins Funktion der Masterseite</a> unterst&uuml;tzt. Beim Exportieren der Grafiken, die Masterelemente (Master Items) f&uuml;r MS Office oder andere Dokumente enthalten, sollten Sie die Grafik als ein Bild einf&uuml;gen. Weitere Informationen finden Sie unter <a href="../../UserGuide/UserGuide/Creating_a_master_Page_Layout_for_Graphs.html#Adding_common_elements_to_an_MS_Word_or_PowerPoint_file" title="UserGuide:Creating a master Page Layout for Graphs"><b>Allgemeine Elemente zu einer MS Word- oder PowerPoint-Datei hinzuf&uuml;gen</b></a>.</p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Pasting_or_Embedding_Graphs_in_other_Applications/Tip_icon.png" width="57"  border="0" /></td><td><p>Origin 2018 f&uuml;hrte die neuen Unicode-kompatiblen Dateitypen ein, einschlie&szlig;lich denen f&uuml;r das Origin-Projekt (OPJU) und f&uuml;r das Origin-Diagramm (OGGU). Wenn Sie Origin 2018 oder h&ouml;her verwenden, um ein Origin-Diagramm in ein Word-Dokument einzubetten, und das Dokument dann einem Kollegen geben, der Origin 2017 oder &auml;lter verwendet, kann er bzw. sie das Origin-Diagramm nicht bearbeiten. Lesen Sie Einzelheiten in <a class="external text" href="../../QuickHelp/QuickHelp/Error_editing_graph_in_Word_object_is_Origin95.html">dieser FAQ</a>.</p></td></tr></table>
<table class="noborder"><tr>
	<td style="vertical-align:top" width="60"><img src="../images/Pasting_or_Embedding_Graphs_in_other_Applications/Tip_icon.png" width="57"  border="0" /></td><td><p>Wenn Sie eine Diagrammseite aus einer vorhandenen OPJU-Datei kopieren und dann in eine Anwendung von MS Office einf&uuml;gen, z. B. Word, PPT etc., gibt es eine Option <b>Link einf&uuml;gen</b> im Dialog <b>Inhalte einf&uuml;gen</b>, um das Origin-Diagramm als Link einzuf&uuml;gen und damit Speicher im MS-Dokument zu sparen. Dies funktioniert allerdings nicht gut mit den neuen MS-Dokumentformaten (docx, pptx etc.). Beim Laden dieser MS-Dokumente und dem Doppelklick auf das Origin-Diagramm werden mehreren Instanzen von Origin im Hintergrund gestartet und verursachen eine Verringerung der Geschwindigkeit. Das Schlie&szlig;en des Dokuments schlie&szlig;t diese verborgenen Origin-Sitzungen auch nicht. Dieses Problem besteht nicht bei MS-Dokumenten, die im alten Format (doc, ppt etc.) gespeichert sind.</p></td></tr></table>
<p><br /> <span class='headerInParagraph'>Um Ihr Diagrammfenster (*.OGG(U)) in eine andere Datei einzubetten:</span></p><p>Das Diagramm muss schon als Diagrammfenster (*.OGG(U)) gespeichert worden sein.</p>
<ol><li>W&auml;hlen Sie in der Zielanwendung (wie Word) <b>Einf&uuml;gen: Objekt</b>. In Word &ouml;ffnet dieser Men&uuml;befehl den Dialog <b>Objekt</b>.  </li>
<li>W&auml;hlen Sie die Registerkarte <b>Aus Datei erstellen</b>.  </li>
<li>Klicken Sie auf Durchsuchen. Hierdurch &ouml;ffnet sich der Dialog <b>Durchsuchen</b>.</li>
<li>W&auml;hlen Sie die gew&uuml;nschte *.OGG(U)-Datei aus.  </li>
<li>Klicken Sie auf <b>OK</b>.  </li>
<li>Stellen Sie sicher, dass im Dialog <b>Objekt</b> das Kontrollk&auml;stchen <b>Verkn&uuml;pfen</b> deaktiviert ist.</li>
<li>Klicken Sie auf <b>OK</b>.</li></ol>
<p>Ihr Diagramm wird in der Zielanwendung als Objekt angezeigt.</p><p><br /> <span class='headerInParagraph'>Erstellen (und Einbetten) eines neuen Origin-Diagramms in eine andere Anwendung</span></p>
<ol><li>W&auml;hlen Sie in der Zielanwendung (wie Word) <b>Einf&uuml;gen: Objekt</b>. In Word &ouml;ffnet dieser Men&uuml;befehl den Dialog <b>Objekt</b>.  </li>
<li>W&auml;hlen Sie die Registerkarte <b>Neu erstellen</b>.  </li>
<li>W&auml;hlen Sie <b>Origin-Diagramm</b> aus der Liste <b>Objekttyp</b> aus.</li>
<li>Klicken Sie auf <b>OK</b>. Hierdurch &ouml;ffnet sich eine neue Origin-Einheit, die ein Diagramm im <b>Dokument<i>n</i></b>-Fenster anzeigt.  </li>
<li>Aktivieren Sie diese neue Origin-Einheit.  </li>
<li>Erstellen Sie Ihr Diagramm (in der neuen Programmeinheit).</li>
<li>Bei aktivem Diagrammfenster w&auml;hlen Sie <b>Datei: Dokument<i>n</i> aktualisieren</b>.  </li>
<li>W&auml;hlen Sie <b>Datei:Beenden und Zur&uuml;ckkehren zu Document<i>n</i>.</b> Dieser Men&uuml;befehl schlie&szlig;t die neue Origin-Einheit und aktiviert die Zielanwendung (in diesem Fall Word) wieder.</li></ol>
<h3><a name="Edit_an_embedded_graph"></a><span class="mw-headline">Eingebettetes Diagramm bearbeiten</span></h3>
<p>Wenn das Origin-Objekt in einer OLE-kompatiblen Datei eingebettet ist, ist es mit den Hilfsmitteln von Origin bearbeitungsf&auml;hig.</p>
<ul><li>Das eingebettete Objekt in Origin bearbeiten:</li></ul>
<ol><li>Klicken Sie doppelt auf das eingef&uuml;gte Diagramm.</li>
<li>Hierdurch wird eine Origin-Einheit ge&ouml;ffnet; das Diagrammfenster wird im Arbeitsbereich angezeigt und steht f&uuml;r die Bearbeitung zur Verf&uuml;gung.  </li>
<li>&Auml;nderungen an einem Diagramm vornehmen  </li></ol>
<ul><li>Um das eingebettete Objekt zu aktualisieren:</li></ul>
<ol><li>W&auml;hlen Sie <b>Datei: Zielanwendung aktualisieren</b>.</li></ol>
<ul><li>Um diese Origin-Einheit zu schlie&szlig;en und zur Zielanwendung zur&uuml;ckzukehren:</li></ul>
<ol><li>W&auml;hlen Sie <b>Datei: Beenden und Zur&uuml;ckkehren zu Zielanwendung.</b></li></ol>
<ul><li>Um das eingebettete Diagramm per Vor-Ort-Aktivierung zu bearbeiten:</li></ul>
<p>Alternativ hierzu k&ouml;nnen Origin-Objekte, die in eine Zieldatei eingef&uuml;gt wurden, ohne Verlassen der Zielanwendung bearbeitet werden. Diese Bearbeitungsmethode funktioniert durch <b>Vor-Ort-Aktivierung</b> einer Teilmenge der Hilfsmittel um Bearbeiten von Origin-Diagrammen.</p><p>Um die Vor-Ort-Aktivierung einzuschalten:</p>
<ol><li>W&auml;hlen Sie im Origin-Men&uuml; <b>Einstellungen: Optionen</b> und dort die Registerkarte <b>Grafik</b>.</li>
<li>Aktivieren Sie das Kontrollk&auml;stchen <b>OLE an Ort und Stelle aktivieren</b>.</li>
<li>Klicken Sie auf <b>OK</b>, um den Dialog zu schlie&szlig;en&nbsp;(Sie erhalten die Nachfrage <b>Als Origin Startup-Optionen speichern?</b>).  </li>
<li>Sie k&ouml;nnen Origin nun schlie&szlig;en.</li></ol>
<ul><li>Um das Diagramm per Vor-Ort-Aktivierung zu bearbeiten:</li></ul>
<ol><li>Klicken Sie doppelt auf das eingef&uuml;gte (nicht verkn&uuml;pfte) Origin-Diagramm in der Zielanwendung. Das Diagramm von Origin ist fertig zum Bearbeiten, nachdem Sie rechts auf das gew&auml;hlte Objekt geklickt und aus den verschiedenen Origin-Kontextmen&uuml;befehlen ausgew&auml;hlt haben. </li></ol>
<table class="note">

<tr>
<td><b>Hinweis:</b> Die Vor-Ort-Aktivierung zur Bearbeitung eingef&uuml;gter Origin-Diagramme ist im Allgemeinen nicht zu empfehlen; Sie haben hier keinen Zugang zu vielen n&uuml;tzlichen Origin-Funktionen - z.B. den Arbeitsmappenfenstern, die die im Diagramm gezeichneten Daten enthalten.</td></tr></table>



    